{"general knowledge": {"title": "General Knowledge", "body": "You gain a class skill of your choice when you create a themeless character. Also, you gain an ability adjustment of +1 to any ability score you choose.", "prerequisites": "", "level_requirement": 1}, "certainty": {"title": "Certainty", "body": "You can spend 1 _Resolve Point_ as a reaction to reroll one of your specialization’s associated skill checks (see page 243).", "prerequisites": null, "level_requirement": 6}, "extensive studies": {"title": "Extensive Studies", "body": "Choose a skill that is a class skill for you. Once per day, you can reroll one such skill check before learning the results of the roll. You must take the second result, even if it is worse.", "prerequisites": "", "level_requirement": 12}, "steely determination": {"title": "Steely Determination", "body": "Increase your pool of Resolve Points by 1.", "prerequisites": "", "level_requirement": 18}, "theme knowledge": {"title": "Theme Knowledge", "body": "You are trained to seek out, identify, and interact with alien life-forms. Reduce the DC to identify a rare creature using _Life Science_ by 5. _Life Science_ is a class skill for you, though if it is a class skill from the class you take at 1st level, you instead gain a +1 bonus to _Life Science_ checks. In addition, you gain an ability adjustment of +1 to _Charisma_ at _character creation_.", "prerequisites": null, "level_requirement": 1}, "lone wolf": {"title": "Lone Wolf", "body": "You know at least a little bit about handling every role on a starship, and you can sub in for certain tasks in a pinch. Whenever you need to attempt a skill check either during starship combat or to directly repair or otherwise maintain your starship, you can treat half your ranks in Piloting as your ranks in the appropriate skill for the check, if that would be better (since you effectively have ranks in the related skill, you are considered trained in the skill for the purposes of this check).", "prerequisites": "", "level_requirement": 6}, "need for speed": {"title": "Need for Speed", "body": "Speeding in a vehicle gives you a heady rush, and you can easily handle operating vehicles at high velocities that might send lesser pilots spinning out of control. Reduce any penalties to Piloting checks you make when on a vehicle by 1. When you take the double maneuver action during a vehicle chase (see page 283), reduce the penalty for each action by 1. Whenever a Piloting check has a penalty for failing by 5 or more, you take that penalty only if you fail by 10 or more.", "prerequisites": "", "level_requirement": 12}, "master pilot": {"title": "Master Pilot", "body": "Your piloting accomplishments invigorate you, giving you renewed purpose and zeal. Up to twice per day, when you defeat a significant foe in starship combat as a pilot or succeed in a vehicle chase (meaning\r\nthat you’ve either escaped a pursuer or caught or defeated your opponent), you recover 1 Resolve Point.", "prerequisites": "", "level_requirement": 18}, "swift hunter": {"title": "Swift Hunter", "body": "You know just how to ask around about your marks to gain information and insight in a hurry. You can use Diplomacy to gather information about a specific individual in half the normal time, and you reduce the penalty for following tracks using Survival while moving at full speed to 0.", "prerequisites": "", "level_requirement": 6}, "relentless": {"title": "Relentless", "body": "You never seem to get tired, even when working longer and harder than everyone else in pursuit of your mark; some of your targets might even refer to you as a tireless ghost or an all-seeing hunter. You can walk or be otherwise active for 12 hours instead of 8 before needing to attempt Constitution checks for a forced march (see page 258), and you can hustle for 2 hours a day during overland travel (see page 258) instead of 1 hour. Reduce the penalty for following tracks using Survival while moving at double speed to –10.", "prerequisites": "", "level_requirement": 12}, "master hunter": {"title": "Master Hunter", "body": "Your relentless pursuit of your mark steels your determination and can renew your inner reserves of strength. Once per day while in pursuit of your mark, you can review current information about your mark for 10 minutes to regain 1 Resolve Point; this doesn’t count as resting to regain Stamina Points. Additionally, once per day when you defeat your mark, you regain 1 Resolve Point.", "prerequisites": "", "level_requirement": 18}, "celebrity": {"title": "Celebrity", "body": "You are famous enough that pretty much everyone has either heard of you or can quickly find information about you (it’s a DC 10 Culture check to recognize your name and a DC 20 Culture check for someone to recognize you out of context from your appearance alone). Among those who follow your iconic profession, you’ve built up both fans and detractors due to your celebrity. If you’re looking for a generic person like “a doctor who can treat this disease,” you can almost always find one who’s a fan and whose attitude starts as friendly or helpful to you; this takes 2d4 hours. At the GM’s discretion, fans might give you services (although not goods) for a discount or even for free.", "prerequisites": "", "level_requirement": 6}, "megacelebrity": {"title": "Megacelebrity", "body": "Your reputation grows to the point that your name is ubiquitous. The DC of Culture checks to recognize you is reduced to 5 (or 10 to recognize you out of context from your appearance alone) and it takes only 1d4 hours to find a fan who meets a generic description. In addition, fans give you a 10% discount on purchased goods.", "prerequisites": "", "level_requirement": 12}, "master icon": {"title": "Master Icon", "body": "Up to twice per day, you can interact with the public about your profession (usually during a performance, such as a concert, but sometimes in a press conference afterward if your profession requires no audience) for a total of at least 10 minutes to recover 1 Resolve Point.", "prerequisites": "", "level_requirement": 18}, "grunt": {"title": "Grunt", "body": "You’re used to long marches while carrying heavy equipment and can hoist most machinery with ease. Treat your Strength as 1 higher for the purpose of determining your bulk limit (see page 167).", "prerequisites": null, "level_requirement": 6}, "squad leader": {"title": "Squad Leader", "body": "You are extremely skilled at coordinating with your squad, both because of your tactical efficiency and because of the respect that you command. If you are able to attempt the check in question, you automatically succeed at a skill check to aid another (see page 133) when assisting a squad member or other longtime ally (such as a fellow PC).", "prerequisites": "", "level_requirement": 12}, "commander": {"title": "Commander", "body": "You pull determination from your victories with your squad, no matter how bloody. After participating in at least three combats in a day in which you defeat distinct groups of significant foes, you recover 1 Resolve Point. After participating in six such combats in a day, you recover a second Resolve Point.", "prerequisites": "", "level_requirement": 18}, "legal corruption": {"title": "Legal Corruption", "body": "Your underworld contacts have serious pull with the corporations and the authorities and can get you out of just about any legal trouble—as long as you’re willing to pay the right price. Depending on the severity of the crime, this can be anywhere between 500 credits × your character level and 10,000 credits × your character level.", "prerequisites": "", "level_requirement": 6}, "black market connections": {"title": "Black Market Connections", "body": "You have contacts who can move goods of all manner discreetly and quietly just about anywhere to nearly any destination you can imagine. You can sell goods in any city for their usual price, even if the goods are illegal or too luxurious for the locals to afford. Additionally, for 10% more than the usual price, you can purchase goods to be delivered to a remote drop-off point (possibly near an adventure location) in the same solar system as a familiar city. The delivery always takes at least as long as the journey between the city and the drop-off point—and usually longer.", "prerequisites": "", "level_requirement": 12}, "master outlaw": {"title": "Master Outlaw", "body": "Organizing shady plans is one of your specialties, and doing so is like a sweet shot of adrenaline. Up to twice per day, after you spend at least 10 minutes to plan a significant heist, caper, or other crime (this\r\ndoesn’t count as resting to regain Stamina Points) and successfully complete at least one action toward enacting that plan, you regain 1 Resolve Point.", "prerequisites": "", "level_requirement": 18}, "mantle of the cergy": {"title": "Mantle of the Cergy", "body": "You have reached a rank of authority in your religion. Typical lay followers of your religion have a starting attitude of helpful toward you and will often provide you\r\nwith simple assistance on request due to some combination\r\nof adoration, respect, or fear (depending on your religion), and even other clergy must give your opinions due consideration in matters of disagreement. You gain a +2 bonus to Diplomacy and Intimidate checks against lay followers and lower- ranking clergy.", "prerequisites": "", "level_requirement": 6}, "divine boon": {"title": "Divine Boon", "body": "Your deity grants you mystic power. Choose one 1st- level mystic spell with some connection to your deity’s portfolio (subject to the GM’s approval). If you have levels in the mystic class, you gain 1 additional 1st- level spell per day and add the chosen spell to your list of mystic spells known. Otherwise, you can use the chosen spell once per day as a spell-like ability.", "prerequisites": "", "level_requirement": 12}, "true communion": {"title": "True Communion", "body": "Up to twice per day, after performing a significant action strongly aligned with your faith’s dogma (at the GM’s discretion), you can spend 10 minutes in deep meditation or prayer to regain 1 Resolve Point; this doesn’t count as resting to regain Stamina Points.", "prerequisites": "", "level_requirement": 18}, "tip of the tongue": {"title": "Tip of the Tongue", "body": "Sometimes, after pausing to collect your thoughts, you realize that you know the answer to a particularly challenging question. Once per day, you can reroll any skill check (see page 243) to recall knowledge. You must decide to use this ability after rolling but before learning the information from your first roll. You must take the second result, even if it is worse.", "prerequisites": "", "level_requirement": 6}, "research maven": {"title": "Research Maven", "body": "You can research much faster than most other people, allowing you to collate information from databases, libraries, and other sources in one-quarter the normal time; with this ability, you can typically take 20 to recall knowledge in 5 rounds.", "prerequisites": "", "level_requirement": 12}, "master scholar": {"title": "Master Scholar", "body": "To you, learning and absorbing knowledge related to your field of expertise is as refreshing as drinking from a cool spring in the middle of a desert planet. Up to twice per day, when in a situation where information from your specialty field could be useful (at the GM’s discretion), you can spend 10 minutes in deep contemplation and research of your specialty field and recover 1 Resolve Point, in addition to using recall knowledge (see page 133) for the information you seek; this doesn’t count as resting to regain Stamina Points.", "prerequisites": "", "level_requirement": 18}, "eager dabbler": {"title": "Eager Dabbler", "body": "In your journeys, you’ve picked up quite a few tricks about all sorts of things, even if you haven’t formally studied them, and you can often use this logic and intuition to your advantage. You gain a +2 bonus to skill checks if you don’t have any ranks in that skill. This ability does not allow you to attempt checks for trained-only skills (see page 134).", "prerequisites": "", "level_requirement": 6}, "jack of all trades": {"title": "Jack of All Trades", "body": "You’ve learned how to handle any situation. You can use all skills untrained, and you double your operative’s edge bonus when using a skill in which you have no ranks.", "prerequisites": "", "level_requirement": 2}, "master explorer": {"title": "Master Explorer", "body": "Scientifically noting the even tiniest details about a new place—including everything from apparent colors and incline grades to barometric, seismic, and other delicate readings—is absolutely invigorating to you. Up to twice per day while on an unexplored planet (typically one that has had no contact with the Pact Worlds, though it doesn’t need to be one you discovered yourself), you can spend 10 minutes exploring, mapping, and documenting a new geographical feature to recover 1 Resolve Point; this doesn’t count as resting to regain Stamina Points.", "prerequisites": "", "level_requirement": 18}, "quick pidgin": {"title": "Quick Pidgin", "body": "If you don’t share a language with creatures you encounter, you and the creatures can spend 10 minutes attempting to converse (if they are willing), after which you attempt a DC 25 Culture check. If you succeed, you formulate a simple pidgin language that allows basic communication. You can use the pidgin language with those specific creatures only, but you gain a +2 bonus to Culture checks to create a pidgin language with similar creatures that speak the same language.", "prerequisites": "", "level_requirement": 6}, "first contact": {"title": "First Contact", "body": "You know how to make a good first impression on new races and assuage their fears of the unknown. When meeting a creature that has never seen your race or any of the races of your traveling companions, if it would normally be unfriendly to unknown races, treat it as indifferent instead. This has\r\nno effect if the creature would be hostile, indifferent, friendly, or helpful.", "prerequisites": "", "level_requirement": 12}, "brilliant discovery": {"title": "Brilliant Discovery", "body": "Up to twice per day, when you discover and document a new species of flora or fauna, you recover 1 RP. On an unexplored planet where every species is new, this process usually takes 10 minutes at most (and doesn’t count as rest to regain SP, but even on known planets, you might be able to find a new species in 1d4 hours (or fewer) in a remote biome or one with a high variety of wildlife.", "prerequisites": "", "level_requirement": 18}, "flat affect": {"title": "Flat Affect", "body": "_Androids_ find emotions confusing and keep them bottled up. They take a –2 penalty to _Sense Motive_ checks, but the DCs of _Sense Motive_ checks attempted against them increase by 2.", "prerequisites": null, "level_requirement": null}, "constructed": {"title": "Constructed", "body": "For effects targeting creatures by type, androids count as both humanoids and constructs (whichever effect is worse). They receive a +2 racial bonus to saving throws against disease, mind-affecting effects, poison, and sleep, unless those effects specifically target constructs. In addition, androids do not breathe or suffer the normal environmental effects of being in a vacuum.", "prerequisites": "", "level_requirement": null}, "exceptional vision": {"title": "Exceptional Vision", "body": "_Androids_ have _low-light vision_ and _darkvision_. As a result, they can see in _dim light_ as if\r\nit were _normal light_, and they can see with no light source at all to a range of 60 feet in black and white only.", "prerequisites": null, "level_requirement": null}, "upgrade slot": {"title": "Upgrade Slot", "body": "_Androids_ have a single _armor_ _upgrade slot_ in their bodies. Regardless of whether _androids_ are wearing _physical armor_, they can use this slot to install any one _armor upgrade_ that could be installed into _light armor_.", "prerequisites": null, "level_requirement": null}, "bonus feat": {"title": "Bonus Feat", "body": "Humans select one extra feat at 1st level.", "prerequisites": "", "level_requirement": null}, "skilled": {"title": "Skilled", "body": "Humans gain an additional skill rank at 1st level and each level thereafter.", "prerequisites": "", "level_requirement": null}, "historian": {"title": "Historian", "body": "Due to their in-depth historical training and the wide-ranging academic background knowledge they possess, kasathas receive a +2 racial bonus to Culture checks.", "prerequisites": "", "level_requirement": null}, "four armed": {"title": "Four Armed", "body": "Kasathas have four arms, which allows them to wield and hold up to four hands’ worth of weapons and equipment. While their multiple arms increase the number of items they can have at the ready, it doesn't increase the number of attacks they can make during combat.", "prerequisites": "", "level_requirement": null}, "natural grace": {"title": "Natural Grace", "body": "Kasathas receive a +2 racial bonus to Acrobatics and Athletics checks.", "prerequisites": "", "level_requirement": null}, "desert stride": {"title": "Desert Stride", "body": "Kasathas can move through nonmagical difficult terrain in deserts, hills, and mountains at their normal speed.", "prerequisites": "", "level_requirement": null}, "dimorphic": {"title": "Dimorphic", "body": "All _lashuntas_ gain +2 _Charisma_ at _character creation_. Korasha _lashuntas_ are muscular\r\n(+2 _Strength_ at _character creation_) but often brash and unobservant (–2 _Wisdom_ at _character creation_). Damaya _lashuntas_ are typically clever and well-spoken (+2 _Intelligence_ at _character creation_) but somewhat delicate (–2 _Constitution_ at _character creation_).", "prerequisites": null, "level_requirement": null}, "lashunta magic": {"title": "Lashunta Magic", "body": "_Lashuntas_ gain the following _spell-like abilities_:\r\n\r\n* **At will:** _daze_, _psychokinetic hand_\r\n* **1/day:** _detect thoughts_\r\n\r\nSee _Spell-like Abilities_. The caster level for these effects is equal to the _lashunta's_ level.", "prerequisites": null, "level_requirement": null}, "limited telepathy": {"title": "Limited Telepathy", "body": "_Shirrens_ can communicate telepathically with any creatures within 30 feet with whom they share a language. Conversing telepathically with multiple creatures simultaneously is just as difficult as listening to multiple people speak", "prerequisites": null, "level_requirement": null}, "student": {"title": "Student", "body": "Lashuntas love to learn, and they receive a +2 racial bonus to any two skills of their choice.", "prerequisites": "", "level_requirement": null}, "blindsense": {"title": "Blindsense", "body": "Shirrens’ sensitive antennae grant them blindsense (vibration)—the ability to sense vibrations in the air—out to 30 feet. A shirren ignores the Stealth bonuses from any form of visual camouflage, invisibility, and the like when attempting a Perception check opposed by a creature’s Stealth check. Even on a successful Perception check, any foe that can’t be seen still has total concealment (50% miss chance) against a shirren, and the shirren still has the normal miss chance when attacking foes that have concealment. A shirren is still flat- footed against attacks from creatures it can’t see.", "prerequisites": "", "level_requirement": null}, "communalism": {"title": "Communalism", "body": "Shirrens are used to working with others as part of a team. Once per day, as long as an ally is within 10 feet, a shirren can roll a single attack roll\r\nor skill check twice and take the higher result.", "prerequisites": "", "level_requirement": null}, "cultural fascination": {"title": "Cultural Fascination", "body": "Shirrens are eager to learn about new cultures and societies. Shirrens receive a +2 racial bonus to Culture and Diplomacy checks.", "prerequisites": "", "level_requirement": null}, "fearless": {"title": "Fearless", "body": "Vesk receive a +2 racial bonus to saving throws against fear effects.", "prerequisites": "", "level_requirement": null}, "natural weapons": {"title": "Natural Weapons", "body": "Vesk are always considered armed. They can deal 1d3 lethal damage with unarmed strikes and the attack doesn’t count as archaic. Vesk gain a unique weapon specialization with their natural weapons at 3rd level, allowing them to add 1–1/2 × their character level to their damage rolls for their natural weapons (instead of just adding their character level, as usual).", "prerequisites": "", "level_requirement": null}, "low-light vision": {"title": "Low-light Vision", "body": "Vesk can see in dim light as if it were normal light. For more details, see page 264.", "prerequisites": "", "level_requirement": null}, "armor savant": {"title": "Armor Savant", "body": "Vesk use armor in a way that complements their uniquely sturdy physiology. When wearing armor, they gain a +1 racial bonus to AC. When they’re wearing heavy armor, their armor check penalty is 1 less severe than normal.", "prerequisites": "", "level_requirement": null}, "darkvision": {"title": "Darkvision", "body": "Ysoki can see up to 60 feet in the dark. See page 263 for more information.", "prerequisites": "", "level_requirement": null}, "moxie": {"title": "Moxie", "body": "Ysoki are scrappy and nimble even when the odds are against them. A ysoki can stand from prone as a swift action. Additionally, when off-kilter (see page 276), a ysoki does not take the normal penalties to attacks or gain the flat-footed condition. When attempting an Acrobatics check to tumble through the space of an opponent at least one size category larger than himself, a ysoki receive a +5 racial bonus to\r\nthe check.", "prerequisites": "", "level_requirement": null}, "scrounger": {"title": "Scrounger", "body": "Ysoki receive a +2 racial bonus to Engineering, Stealth, and Survival checks.", "prerequisites": "", "level_requirement": null}, "cheek pouches": {"title": "Cheek Pouches", "body": "Ysoki can store up to 1 cubic foot of items weighing up to 1 bulk in total in their cheek pouches, and they can transfer a single object between hand and cheek as a swift action. A ysoki can disgorge the entire contents of his pouch onto the ground in his square as a move action that does not provoke an attack of opportunity.", "prerequisites": "", "level_requirement": null}, "envoy improvisation": {"title": "Envoy Improvisation", "body": "As you gain experience, you learn _envoy improvisations_—little tricks that bolster allies, confound enemies, or change the ebb and flow of battle using guile, inspiration, or luck. You learn your first envoy improvisation at 1st level, and you learn an additional improvisation at 2nd level and every 2 levels thereafter.\r\n\r\nIf an improvisation allows you to grant an effect to an ally, you cannot grant yourself that effect unless the improvisation states otherwise. If an envoy improvisation allows a saving throw to resist its effects or requires an enemy to attempt a skill check, the DC is equal to 10 + half your envoy level + your Charisma modifier.\r\n\r\nSome _envoy improvisations_ are _language-dependent_, _mind-affecting_, _sense-dependent_, or some combination of any or all of these.", "prerequisites": null, "level_requirement": 1}, "clever feint": {"title": "Clever Feint", "body": "As a standard action, you can fake out an enemy within 60 feet, making that enemy open to your attacks. Attempt a Bluff check with the same DC as a check to feint against that enemy (though this isn’t a standard check to feint, so Improved Feint and Greater Feint don’t apply). Even if you fail, that enemy is flat-footed against your attacks (see page 276) until the end of your next turn. If you succeed, the enemy is also flat-footed against your allies’ attacks until the end of your next turn. You can’t use clever feint against a creature that lacks an Intelligence score.\r\n\r\nAt 6th level, you can spend 1 Resolve Point to treat a failed Bluff check for clever feint as if it were a success.", "prerequisites": null, "level_requirement": 1}, "dispiriting taunt": {"title": "Dispiriting Taunt", "body": "As a standard action, you can taunt an enemy within 60 feet. Attempt an Intimidate check with the same DC as a check to demoralize that enemy (though this isn’t a check to demoralize, so you can’t use abilities that would apply to a demoralization attempt, like the rattling presence expertise talent). If you fail, that enemy is off-target (see page 276) until the end of your next turn. If you succeed, that enemy is instead shaken (see page 277) until the end of your next turn. This is an emotion and fear effect.\r\n\r\nAt 6th level, you can spend 1 Resolve Point to treat a failed Intimidate check for dispiriting taunt as if it were a success", "prerequisites": null, "level_requirement": 1}, "don't quit": {"title": "Don't Quit", "body": "As a standard action, you can signal a single ally within 60 feet. That ally ignores one condition (see page 273) of your choice until the start of your next turn, chosen from the following list: confused, fascinated, fatigued, shaken, sickened, and staggered.\r\n\r\nWhile your ally doesn’t suffer the effects of the condition during that period, the condition is merely suppressed, not removed, and its effects resume at the start of your next turn. The condition can still be removed with spells, technology, and other effects as normal.\r\n\r\nAt 6th level, add the following conditions to the list: cowering, dazed, exhausted, frightened, nauseated, panicked, paralyzed, and stunned.\r\n\r\nAt 12th level, you can spend 1 Resolve Point to remove the condition with this ability instead of suppressing it. You can’t remove a condition with a permanent duration (see page 271) in this way; if you attempt to do so, your attempt fails but you don’t lose the Resolve Point.", "prerequisites": null, "level_requirement": 1}, "expanded attunement": {"title": "Expanded Attunement", "body": "You can use beneficial mind-affecting envoy improvisations to aid allies who usually would not be able to gain benefits from mind-affecting effects, such as constructs, robots, and undead. If the improvisation grants a morale bonus, even allies who can’t normally benefit from morale bonuses gain that bonus.", "prerequisites": null, "level_requirement": 1}, "get ’em": {"title": "Get ’Em", "body": "As a move action, you can choose one enemy within 60 feet. Until the start of your next turn, you and your allies gain a +1 morale bonus to attack rolls made against that enemy. The bonus persists even if the enemy moves beyond 60 feet or out of line of sight or hearing.\r\n\r\nAt 6th level, you can spend 1 Resolve Point to grant this bonus to attack rolls and damage rolls against all enemies who are within 60 feet.", "prerequisites": null, "level_requirement": 1}, "inspiring boost": {"title": "Inspiring Boost", "body": "As a standard action, you can signal an ally within 30 feet who has taken damage from any attack made by a significant enemy (see page 242) at any point after your last turn ended. That ally regains a number of Stamina Points (up to his maximum) equal to twice your envoy level + your Charisma modifier; at 15th level, this increases to three times your envoy level + your Charisma modifier. Once an ally has benefited from your inspiring boost, that ally can’t gain the benefits of your inspiring boost again until he takes a 10-minute rest to recover Stamina Points.\r\nAt 6th level, you can spend 1 Resolve Point to add your envoy level to the number of Stamina Points regained.", "prerequisites": "", "level_requirement": 1}, "look alive": {"title": "Look Alive", "body": "When you spend a Resolve Point to regain Stamina Points after a 10-minute rest, all allies who stay within 60 feet of you throughout the rest gain a +2 morale bonus to Perception and initiative checks for the next hour or until the next 10-minute rest to recover Stamina Points, whichever comes first.", "prerequisites": null, "level_requirement": 1}, "not in the face": {"title": "Not in the Face", "body": "As a move action, you can choose one enemy within 60 feet. That enemy must succeed at a Will save or take a –4 penalty to all attacks it makes against you until the end of your next turn.\r\n\r\nAt 6th level, you can spend 1 Resolve Point to make the enemy take the penalty with no saving throw allowed.", "prerequisites": null, "level_requirement": 1}, "universal expression": {"title": "Universal Expression", "body": "When using a language-dependent improvisation that affects an enemy, you can use the improvisation against that enemy even if the two of you do not share a language.", "prerequisites": null, "level_requirement": 1}, "watch your step": {"title": "Watch Your Step", "body": "When an ally within 60 feet must succeed at a Reflex save to avoid a harmful effect, as a reaction before your ally attempts the saving throw, you can grant the ally a +2 bonus to that saving throw.\r\n\r\nAt 6th level, you can spend 1 Resolve Point to have the ally roll twice on the saving throw and take the better result. Both of those rolls benefit from the +2 bonus provided by this ability.", "prerequisites": "", "level_requirement": 1}, "clever attack": {"title": "Clever Attack", "body": "You can make an attack that throws your enemy off-balance. As a standard action, you can make a single attack against a target within 60 feet and gain the benefits of clever feint (attempting a Bluff check against the target as normal). Apply the effects of clever feint before resolving your attack. You must have the clever feint envoy improvisation to choose this improvisation.", "prerequisites": "", "level_requirement": 4}, "duck under": {"title": "Duck Under", "body": "You can duck under a foe’s melee attack, causing it to overextend and move into a position more favorable to you. You must take the total defense action (see page 247) to use this ability. If, before the start of your next turn, a foe misses you with a melee attack, as a reaction you can attempt a reposition combat maneuver with a +8 bonus to your attack roll against that foe.", "prerequisites": "", "level_requirement": 4}, "focus": {"title": "Focus", "body": "As a standard action, you can encourage a single ally within 60 feet to focus on the danger at hand. If that ally is flat-footed or off-target, you end that condition. If circumstances would cause the ally to immediately become flat-footed or off-target again, you instead suppress that condition for 1 round.", "prerequisites": "", "level_requirement": 4}, "hurry": {"title": "Hurry", "body": "As a standard action, you can grant a single move action to an ally within 60 feet. The ally can use that move action during her next turn to take a guarded step, move up to her speed, or draw or sheathe a weapon. The ally can use her extra move action in between her other actions, and she can even use it before or after a full action. A character can use no more than one extra action from hurry in a single round.", "prerequisites": "", "level_requirement": 4}, "quick dispiriting taunt": {"title": "Quick Dispiriting Taunt", "body": "You can use dispiriting taunt as a move action instead of a standard action. You must have the dispiriting taunt envoy improvisation to choose this improvisation.", "prerequisites": "", "level_requirement": 4}, "quick inspiring boost": {"title": "Quick Inspiring Boost", "body": "You can use inspiring boost as a move action instead of a standard action, though when you do so, the number of Stamina Points your ally recovers is reduced by your envoy level. You must have the inspiring boost envoy improvisation to choose this improvisation.", "prerequisites": "", "level_requirement": 4}, "long-range improvisation": {"title": "Long-Range Improvisation", "body": "Double the range of your improvisations with ranges of at least 30 feet.", "prerequisites": "", "level_requirement": 4}, "watch out": {"title": "Watch Out", "body": "As a reaction, when an enemy makes a ranged attack against an ally within 60 feet of you, you can warn that ally of the danger. You must spend your reaction when the enemy declares the attack but before it makes the attack roll. Your ally can spend a reaction to gain a +4 to AC against the triggering attack. Once the triggering attack is resolved, the ally falls prone.\r\n\r\nAt 8th level, you can spend 1 Resolve Point to prevent your ally from falling prone after the attack.", "prerequisites": null, "level_requirement": 4}, "clever improvisations": {"title": "Clever Improvisations", "body": "The first time you would spend Resolve Points on one of your envoy improvisations, reduce the cost by 1 Resolve Point (minimum 0). This ability refreshes whenever you take a 10-minute rest to recover Stamina Points and after an 8-hour rest to recover Resolve Points, reducing the Resolve Point cost of your next envoy improvisation after the rest.", "prerequisites": "", "level_requirement": 6}, "draw fire": {"title": "Draw Fire", "body": "As a standard action, you can spend 1 Resolve Point to make all enemies within 100 feet take a –4 penalty to all ranged attacks they make that don’t target you until the end of your next turn. This penalty remains even if you and an enemy move more than 100 feet away from each other, and enemies that weren’t within 100 feet when you used draw fire don’t take the penalty if they later come within range.", "prerequisites": "", "level_requirement": 6}, "heads up": {"title": "Heads Up", "body": "When you succeed at a Perception check, as a reaction, you can signal a single ally within 60 feet. That ally can act as if he had also succeeded at the Perception check with the same result.", "prerequisites": "", "level_requirement": 6}, "improved get ’em": {"title": "Improved Get ’Em", "body": "Your morale bonus from get ’em increases to +2. As a standard action, you can make a single attack against a target within 60 feet. You and your allies within 60 feet gain the benefits of get ’em against that target (applying these effects before making the attack roll). As with get ’em, you can spend 1 Resolve Point to grant the benefits against all enemies within 60 feet. You must have the get ’em envoy improvisation to choose this improvisation.", "prerequisites": null, "level_requirement": 6}, "desperate defense": {"title": "Desperate Defense", "body": "As a move action, you can cause one ally adjacent to you to not be considered helpless (see page 276) for the purpose of actions that can be used only against helpless creatures (such as a coup de grace). This effect ends if the creature ceases to be adjacent to you or at the beginning of your next turn, whichever comes first.", "prerequisites": "", "level_requirement": 8}, "expert attack": {"title": "Expert Attack", "body": "As a move action, you can spend 2 Resolve Points to add your bonus from expertise to your next attack roll before the end of your turn.", "prerequisites": "", "level_requirement": 8}, "hidden agenda": {"title": "Hidden Agenda", "body": "You’re an expert at veiling your true thoughts and goals. Whenever a creature attempts a Sense Motive check to detect a deception of yours, the creature must roll twice and take the worse of the two results. When you attempt a saving throw against an effect or ability that would read your thoughts or reveal your motives, you can roll twice and take the better of the two results.", "prerequisites": "", "level_requirement": 8}, "improved hurry": {"title": "Improved Hurry", "body": "You can use the hurry envoy improvisation as a move action instead of a standard action. You must have the hurry envoy improvisation to choose this improvisation.\r\n\r\nAt 12th level, you can use hurry as a standard action and spend 1 Resolve Point to grant a standard action instead of a move action.", "prerequisites": "", "level_requirement": 8}, "situational awareness": {"title": "Situational Awareness", "body": "If you ready an action, once before the trigger you selected occurs, you can spend 1 Resolve Point to change both the trigger and the action you have ready. You must ready an action that takes the same kind of action as your originally readied action, or you must ready a lesser action. (For example, if you readied a standard action, you could switch to another standard action, a move action, or a swift action, and if you readied a move action, you could switch to another move action or a swift action.)", "prerequisites": "", "level_requirement": 8}, "sustained determination": {"title": "Sustained Determination", "body": "As a move action, you can spend 2 Resolve Points to grant an ally within 60 feet 1 Resolve Point that he can spend to empower one of his abilities, even if he has spent all of his own Resolve Points. The ally must spend the Resolve Point before the start of your next turn; if he does not do so, he loses the Resolve Point and you still lose the Resolve Points you spent. You can’t grant the same ally the benefits of this ability again until both you and your ally have recovered your Resolve Points after an 8-hour rest or its equivalent.", "prerequisites": "", "level_requirement": 8}, "expertise": {"title": "Expertise", "body": "You are an expert at dealing with challenges that test your skills, be the challenges social or otherwise. At 1st level, when attempting a Sense Motive check, you can roll 1d6 (your expertise die) and add the result of the roll to your check as an insight bonus. You can use this and other expertise abilities as long as you have at least 1 Resolve Point remaining. At 5th level, anytime you roll your expertise die, you gain a +1 bonus to the result. At 9th, 17th, and 20th levels, this bonus increases by 1. At 13th level, you roll 1d8 as your expertise die instead of 1d6.\r\n\r\nBeginning at 9th level, you have even greater expertise with skills to which you can add your expertise die that you have also selected with the Skill Focus feat. For each such skill, once per day when rolling your expertise die to add to that skill, you may roll the expertise die twice and take the better of the two results.", "prerequisites": "", "level_requirement": 1}, "skill expertise": {"title": "Skill Expertise", "body": "At 1st level and every 4 levels thereafter, you can use expertise with one additional class skill. You must have at least 1 rank in a skill to select it, and it must come from the following list: Bluff (Cha), Computers (Int), Culture (Int), Diplomacy (Cha), Disguise (Cha), Engineering (Int), Intimidate (Cha), and Medicine (Int).", "prerequisites": "", "level_requirement": 1}, "expertise talent": {"title": "Expertise Talent", "body": "At 3rd level and every 4 levels thereafter, you choose an expertise talent, which gives you an extra option when using a skill with which you have expertise. The list of expertise talents appears on pages 269–270.", "prerequisites": null, "level_requirement": 3}, "additional skill expertise": {"title": "Additional Skill Expertise", "body": "Choose another skill in which you have at least 1 rank from the list of skills you can choose with the expertise class feature; you can use expertise with that skill. You can choose this talent up to three times, choosing a different skill each time.", "prerequisites": "", "level_requirement": null}, "altered bearing": {"title": "Altered Bearing", "body": "You can quickly adjust your posture, your stride, your demeanor, and the way your clothes and gear fit, causing casual observers to fail to recognize your true appearance. When you attempt a Disguise check to alter minor details of your appearance, you can forgo your expertise die to attempt the check as a move action. You don’t reduce the DC by 5 for attempting to alter only minor details, and if an observer succeeds at an opposed Perception check that pierces your disguise, he also realizes your true race and what features you have disguised. You can’t use this ability for more complex disguises.", "prerequisites": "", "level_requirement": null}, "analyst": {"title": "Analyst", "body": "You have been taught to carefully consider your own assumptions, making it much less likely you assign false motives to other creatures. When using Sense Motive to detect deception or discern a secret message, as long as your expertise die roll result is not a 1, you don’t think a truthful statement contains deceptions or infer false information from a secret message even if you fail your check by 5 or more.", "prerequisites": "Sense Motive", "level_requirement": null}, "cautious expertise": {"title": "Cautious Expertise", "body": "Choose a skill you have selected with the skill expertise class feature. When you take 20 (see page 133) with this skill, you can roll your expertise die twice and take the better result.\r\nYou can choose this talent up to three times, choosing a different skill selected with the skill expertise class feature each time.", "prerequisites": "", "level_requirement": null}, "convincing liar": {"title": "Convincing Liar", "body": "When you attempt a Bluff check, you can choose not to roll your expertise die until later. After you determine what the check’s result would be, you can choose to either roll your expertise die and add the result to the total or forgo the expertise die and reroll the check (see page 243). At 9th level, you can spend 1 Resolve Point to reroll the check and add the result of your expertise die.", "prerequisites": "Bluff", "level_requirement": null}, "cultural savant": {"title": "Cultural Savant", "body": "As long as you have enough time, you can take 20 on Culture checks to recall knowledge, even if you don’t have access to a computer terminal or other means of research.", "prerequisites": "Culture", "level_requirement": null}, "cunning disguise": {"title": "Cunning Disguise", "body": "When you attempt an initial Disguise check, you can forgo rolling your expertise die. Instead, the first time a creature would pierce your disguise with a Perception check, treat its result as if it had rolled a natural 1 on its Perception check. This benefit applies only once per disguise. At 9th level, this ability also applies against the second creature who pierces your disguise.", "prerequisites": "Disguise", "level_requirement": null}, "engineering adept": {"title": "Engineering Adept", "body": "When you attempt an Engineering check to disable or repair a device, you can forgo rolling your expertise die to instead halve the time it takes to make the attempt.", "prerequisites": "Engineering", "level_requirement": null}, "expert forger": {"title": "Expert Forger", "body": "You have a database of electronic seals and predesigned templates that allow you forge an official document in a matter of moments. When you attempt a Computers check to create a forgery, as long as you have access to a computer, you can forgo your expertise die to attempt the check as a full action (rather than the normal required time of 1d4 minutes).", "prerequisites": "Computers", "level_requirement": null}, "fast hack": {"title": "Fast Hack", "body": "When you attempt a Computers check to hack into a computer system, you can forgo rolling your expertise die to instead halve the time it takes to make the attempt (to a minimum of 1 round). At 9th level, if you successfully hack the system, you can also negate a single countermeasure protecting that computer system. You cannot use this talent to negate a countermeasure from the same computer again for 24 hours.", "prerequisites": "Computers", "level_requirement": null}, "inspired medic": {"title": "Inspired Medic", "body": "When you attempt a Medicine check, you can choose not to roll your expertise die until later. After you determine what the check’s result would be, you can choose to either roll your expertise die and add it to the total or forgo the expertise die and reroll the check (see page 243). At 9th level, you can spend 1 Resolve Point to both reroll the check and add the result of your expertise die.", "prerequisites": "Medicine", "level_requirement": null}, "keen observer": {"title": "Keen Observer", "body": "Whenever you interact with a creature under a mental effect for at least 1 minute, the GM attempts an automatic secret Sense Motive check for you without your expertise die. On a success, you learn about the mental effect. If you specifically request a Sense Motive check to sense mental effects, you can attempt a Sense Motive check as normal, including your expertise die, in addition to this automatic check.", "prerequisites": "Sense Motive", "level_requirement": null}, "menacing gaze": {"title": "Menacing Gaze", "body": "When you attempt an Intimidate check to demoralize foes, you can forgo your expertise die to attempt to briefly demoralize a small group as a full action. You attempt an Intimidate check against foes within 60 feet, no two of which can be more than 20 feet apart. The DC of this check is equal to the highest DC to demoralize any one of the foes. If you are successful, the targets gain the shaken condition (see page 277) for 1 round (even if your result exceeded the DC by 5 or more). Once you use this ability against a creature, it is immune to this talent for 24 hours.", "prerequisites": "Intimidate", "level_requirement": null}, "rattling presence": {"title": "Rattling Presence", "body": "When you attempt an Intimidate check to demoralize an opponent, you can forgo rolling your expertise die to automatically increase the duration of the shaken condition by 1 round on a successful check. At 9th level, you instead increase the duration by 2 rounds on a success when using this talent.", "prerequisites": "Intimidate", "level_requirement": null}, "skilled linguist": {"title": "Skilled Linguist", "body": "You can speak and read a number of bonus languages equal to your ranks in Culture. Additionally, when you attempt a Culture check to decipher writing, you can forgo your expertise die to attempt the check as a full action (rather than the normal 1 minute) per approximately 250 words of writing or fewer.", "prerequisites": "Culture", "level_requirement": null}, "slick customer": {"title": "Slick Customer", "body": "When you attempt a Diplomacy check, you can choose not to roll your expertise die until later. After you determine what the check’s result would be, you can choose to either roll your expertise die and add it to the total or forgo the expertise die and reroll the check (see page 243). At 9th level, you can spend 1 Resolve Point to both reroll the check and add the result of your expertise die.", "prerequisites": "Diplomacy", "level_requirement": null}, "student of technology": {"title": "Student of Technology", "body": "As long as you have the time to do so, you can take 20 (see page 133) on Engineering checks to identify creatures and technology, even if you do not have access to a computer terminal or other means of research. If the creature or technology was created by a group or individual you are familiar with (normally including any major corporation or military), on a successful check you also identify what group created the object identified.", "prerequisites": "Engineering", "level_requirement": null}, "surgeon": {"title": "Surgeon", "body": "You can use Medicine to treat deadly wounds on a patient once each day in addition to the normal allowances for the medical equipment you are using. Because performing this level of advanced medicine is difficult and time consuming, the DC for this additional treatment increases by 5 and the skill check takes 1 hour.", "prerequisites": "Medicine", "level_requirement": null}, "well informed": {"title": "Well Informed", "body": "You keep yourself as up to date as possible about the events and major figures of any region you are in. Once you have been in a settlement or region for at least 24 hours, when you attempt a Diplomacy check to gather information, you can forgo your expertise die to attempt the check as a swift action (rather than the normal 1d4 hours).", "prerequisites": "Diplomacy", "level_requirement": null}, "weapon specialization": {"title": "Weapon Specialization", "body": "You know how to get the full damage out of a _weapon_ type your class doesn’t normally use.", "prerequisites": "Character level 3rd, proficiency with selected weapon type.", "level_requirement": 3}, "true expertise": {"title": "True Expertise", "body": "You gain total mastery over one of your envoy improvisations and can use it with but a thought. When you gain this ability, choose one improvisation you know that has an effect when you spend 1 Resolve Point.\r\n\r\nAs long as you have at least 1 Resolve Point remaining, you can gain the improvisation’s effect without spending the Resolve Point. This ability has no benefit if the improvisation requires more than 1 Resolve Point.\r\n\r\nIn addition, when you roll your expertise die, you can add 2d8 rather than 1d8+4 to the result of your skill check. If, for some reason, your bonus gained from expertise isn’t 1d8+4, you can’t use this option.", "prerequisites": "", "level_requirement": 20}, "visual data processor": {"title": "Visual Data Processor", "body": "You notice even the smallest shifts in movement, temperature, and vibration, gaining the _insight bonus_ from your _bypass_ class feature to _Perception_ skill checks.", "prerequisites": "", "level_requirement": 2}, "ultraclocking": {"title": "Ultraclocking", "body": "If you have a drone, you can grant the effects of haste to your drone for 1 minute as a move action. If you have an exocortex, you can gain the effects of haste for 1 minute as a move action. Once you or your drone has used this ability, you cannot use it again until you spend 1 Resolve Point to regain Stamina Points from a 10-minute rest. You must have the overclocking and hyperclocking mechanic tricks to learn this trick.", "prerequisites": "", "level_requirement": 14}, "mod tinkerer": {"title": "Mod Tinkerer", "body": "You can spend 24 hours of uninterrupted work to exchange all your drone or exocortex mods at any time, even if you haven’t gained a level. Any other drone features (such as its chassis or bonus feats) can still be exchanged only when you gain a level.", "prerequisites": "", "level_requirement": 14}, "energy shield": {"title": "Energy Shield", "body": "Your _drone_ gains an energy shield that provides it with a number of temporary _Hit Points_ equal to your mechanic level. This shield remains active until all of its temporary _Hit Points_ are depleted. The _drone_ can replenish the shield’s _Hit Points_ to full by spending 1 _Resolve Point_ when you rest to regain _Stamina Points_. You can select this mod a second time to double the energy shield’s temporary _Hit Points_.", "prerequisites": null, "level_requirement": 2}, "saboteur": {"title": "Saboteur", "body": "Whenever you use the Engineering skill to sabotage or disable a device, you can roll twice and take the better result. In addition, if you have the appropriate tools (including your custom rig), performing these tasks takes half the normal amount of time, to a minimum of 1 move action.", "prerequisites": "", "level_requirement": 14}, "superior overcharge": {"title": "Superior Overcharge", "body": "The additional damage of the overcharge mechanic trick increases to 4d6. You must have the overcharge and improved overcharge mechanic tricks to learn this trick. You can select this trick multiple times. Each time you do after the first, increase the damage by 1d6 (to a maximum of 7d6 if you select it all four times).", "prerequisites": "", "level_requirement": 14}, "hack directory": {"title": "Hack Directory", "body": "Whenever you attempt to hack a system and fail the check, you immediately become aware of any countermeasures that were activated due to your failure. You can then select one of these countermeasures and attempt another Computers check (with the same DC as the original). If you succeed at this second check, you can prevent that countermeasure from activating, as if you had not attempted to access the system at all. Any other countermeasures have their normal effect.", "prerequisites": "", "level_requirement": 2}, "distracting hack": {"title": "Distracting Hack", "body": "You can hack a computer within 30 feet of a foe to distract that foe, such as with a sudden noise or an image. You must be able to access the computer (whether it is your own computer or you are within range to access one manually or via remote hack). This functions as a feint action except that it uses your Computers skill instead of Bluff, so you can apply the benefits of Improved Feint and Greater Feint if you have them.", "prerequisites": "", "level_requirement": 2}, "neural shunt": {"title": "Neural Shunt", "body": "Once per day, as a reaction when you fail a saving throw against a mind-affecting effect, you can shunt that effect into your exocortex instead. When you do so, you are not affected by the mind-affecting effect, but for the normal duration of that effect, you lose the Skill Focus feat granted by your exocortex’s memory module and cannot use any of the exocortex’s abilities in any way (including any proficiencies and mods it grants you). When a mind-affecting effect is shunted into the exocortex, spells such as dispel magic or break enchantment can be cast on you to end the effect as if you were affected by it. Once the duration of the mind- affecting effect has ended, your exocortex resumes its normal functions. You must have an exocortex to learn this trick.", "prerequisites": "", "level_requirement": 2}, "overcharge": {"title": "Overcharge", "body": "As a standard action, you can use your custom rig to overcharge and attack with a ranged energy weapon or a melee weapon with the powered special property (see page 181) that you’re holding. If you hit, you deal 1d6 additional damage of the same type the weapon normally deals. This attack uses three times as many charges from the battery or power cell as normal and can’t be used if the weapon doesn’t have enough charges. This trick has no effect on a weapon without a battery or power cell. You can instead use this ability as a move action on a touched powered weapon that is unattended or attended by an ally to grant the same effect to that weapon’s next attack before the beginning of your next turn.", "prerequisites": "", "level_requirement": 2}, "nightvision processor": {"title": "Nightvision Processor", "body": "Your visual data processor allows you to see better in conditions of poor lighting, granting you low-light vision and darkvision to a range of 60 feet. You must have the visual data processor mechanic trick to learn this trick.", "prerequisites": "", "level_requirement": 2}, "overclocking": {"title": "Overclocking", "body": "You have augmented the performance of your AI for maximum response timing. You gain a +2 insight bonus to initiative checks, and either you (if you have an exocortex) or your drone (if you have a drone) gains a +2 insight bonus to Reflex saves.", "prerequisites": "", "level_requirement": 2}, "overload weapon": {"title": "Overload Weapon", "body": "As a full action or as a move action by spending 1 Resolve Point, you can cause a powered weapon (either a ranged energy weapon or a melee weapon with the powered special property) in your possession to explode. You can use the weapon as if it were a grenade of the weapon’s item level or lower dealing the weapon’s normal damage type, except the weapon has a range increment of only 10 feet unless it is a thrown weapon. If someone tries to attack with the weapon, it explodes as a grenade would instead, centered on the user, and the user doesn’t receive a Reflex save to negate the grenade’s effect (if any). Once you’ve primed a weapon to explode in this way, it’s difficult to reverse the effect, requiring 8 hours of work and a successful Engineering check (DC = 15 + your Engineering bonus); failing the check by 5 or more detonates the weapon. Once detonated, the weapon is destroyed, just like a grenade.", "prerequisites": "", "level_requirement": 2}, "portable power": {"title": "Portable Power", "body": "You can use your custom rig to supply limited power for up to 1 minute to a computer or starship system that lacks power. If this system is part of a much larger network, this trick does not supply power to the entire network, just to a limited point of access (typically a terminal), which might greatly limit functionality. Once you have used portable power on a system, you cannot do so again on that system for 24 hours.", "prerequisites": "", "level_requirement": 2}, "quick patch": {"title": "Quick Patch", "body": "When you attempt to patch a system on a starship, you reduce the number of actions required to do so by one. This does not reduce the time needed to patch a glitching system, but you can patch two systems with one action.", "prerequisites": "", "level_requirement": 2}, "quick repair": {"title": "Quick Repair", "body": "When you attempt to repair an item, you can do so in half the time normally required (to a minimum of a full action).", "prerequisites": "", "level_requirement": 2}, "ghost intrusion": {"title": "Ghost Intrusion", "body": "Whenever you use the Computers skill to access a system and you fail to overcome its defenses by 4 or less, you do not trigger any countermeasures and there is no log of your attempt. If you fail by 5 or more, any countermeasures take effect against you as normal.", "prerequisites": "", "level_requirement": 8}, "repair drone": {"title": "Repair Drone", "body": "When you spend 10 minutes to repair your drone, you repair 25% of its maximum Hit Points instead of 10%. You must have a drone to learn this trick.", "prerequisites": "", "level_requirement": 2}, "boost shield": {"title": "Boost Shield", "body": "Your energy shield grants you a number of temporary Hit Points equal to your Intelligence modifier + double your mechanic level. In addition, if you have already used your shield, you can spend 1 Resolve Point to use it again without having to regain Stamina Points first. This replenishes your shield’s temporary Hit Points to full. You must have the energy shield mechanic trick to learn this trick.", "prerequisites": "", "level_requirement": 8}, "improved overcharge": {"title": "Improved Overcharge", "body": "The additional damage of the overcharge mechanic trick increases to 2d6. You must have the overcharge mechanic trick to learn this trick", "prerequisites": "", "level_requirement": 8}, "drone meld": {"title": "Drone Meld", "body": "Drone Meld (Ex)\r\nAs a full action while in contact with your drone, you can reconfigure it into a mechanical drone suit (or a backpack-like apparatus, for the Tiny hover drone) that you can wear. While in this form, the drone can’t take any actions or use any of its abilities, but you gain either the drone’s flight system mods if you have a hover drone, reactive camouflage (and an invisibility field if your drone has it) if you have a stealth drone, or reductive plating if you have a combat drone. You can end the meld and return the drone to its normal form as a full action. Though it normally acts on your turn just after you, the drone can take no actions on that turn other than transforming back.", "prerequisites": "", "level_requirement": 8}, "holographic projector": {"title": "Holographic Projector", "body": "Your custom rig can project holographic images as a standard action as often as you like, as per 2nd-level holographic image except it can create speech and has a range of only 120 feet.", "prerequisites": "", "level_requirement": 8}, "engineer’s eye": {"title": "Engineer’s Eye", "body": "When you are within 10 feet of a trapped or malfunctioning machine or computer, you receive a free Computers, Engineering, or Perception check (as decided by the GM) to notice the trap or defect, whether or not you are actively looking. In addition, due to your intimate knowledge of your ship, you receive one of these checks whenever you board your ship to notice if anything is wrong with the ship’s systems.", "prerequisites": "", "level_requirement": 8}, "hyperclocking": {"title": "Hyperclocking", "body": "You further improve the response time of your AI. If you have a drone, your drone gains a +1 insight bonus to AC. In addition, if your drone is subjected to an attack that normally allows a Reflex save for half damage, it takes no damage if it succeeds at its saving throw. If you have an exocortex, you gain a +1 insight bonus to AC. In addition, whenever you fail a Reflex saving throw, you can spend 1 Resolve Point to reroll the saving throw (see page 243) and take the higher result. You must have the overclocking mechanic trick to learn this trick.", "prerequisites": "", "level_requirement": 8}, "invisibility bypass processor": {"title": "Invisibility Bypass Processor", "body": "Your visual data processor now allows you to see invisible creatures as per see invisibility. You must have the visual data processor mechanic trick to learn this trick.", "prerequisites": "", "level_requirement": 8}, "resistant energy": {"title": "Resistant Energy", "body": "Even when your energy shield is inactive, the ambient energy protects you from a particular type of energy attack. Choose acid, cold, electricity, fire, or sonic. You gain resistance 5 against that energy type. You must have the energy shield mechanic trick to learn this trick.", "prerequisites": "", "level_requirement": 8}, "extra mod": {"title": "Extra Mod", "body": "If you have a drone, your drone gains an additional basic mod. If you have an exocortex, you gain an additional basic mod. It can’t be a basic mod taken a second time as an advanced mod. You can rebuild this extra mod when you gain a mechanic level as with any other mod, but you can’t rebuild this mod to convert it into the advanced version of the mod.", "prerequisites": "", "level_requirement": 14}, "scoutbot": {"title": "Scoutbot", "body": "You’re always crafting rudimentary bots in your spare time, and can use them to scout. It takes you 10 minutes and 1 Resolve Point to create a scoutbot. A scoutbot is a Small technological construct, its EAC and KAC are equal to 10 + your mechanic level, and it has 1 Hit Point per mechanic level you have (and no Stamina Points). It has a land speed of 30 feet, and you can control its movements with your custom rig as a move action. It has a camera that streams visual and auditory data back to your rig. The scoutbot uses your saving throw bonuses if necessary. It is untrained in all skills and has a +0 bonus in all of them, though you can use your own Perception skill when examining the feed from its stream. Once created, the scoutbot lasts for 1 minute per mechanic level you have before falling apart unless otherwise destroyed.", "prerequisites": "", "level_requirement": 8}, "improved resistant energy": {"title": "Improved Resistant Energy", "body": "Choose an additional energy type from resistant energy. You gain resistance 15 against both this and your original energy type. You must have the energy shield and resistant energy mechanic tricks to learn this trick.", "prerequisites": "", "level_requirement": 14}, "invisibility-hampering projector": {"title": "Invisibility-Hampering Projector", "body": "As a move action, you can use your custom rig’s holographic projector to project a holographic image in a direct overlay over an invisible creature within 120 feet, and your custom rig’s computer moves the image to follow the invisible creature, effectively negating the creature’s invisibility as long as it remains within 120 feet of you. If it moves beyond that range, it breaks the effect until you use this ability again. You must have the holographic projector, invisibility bypass processor, and visual data processor mechanic tricks to learn this trick.", "prerequisites": "", "level_requirement": 14}, "tool arm": {"title": "Tool Arm", "body": "Select one technological item from Chapter 7: Equipment of no more than light bulk and an item level no higher than your mechanic level. Your drone is equipped with a robotic arm with that item attached and the proper programming to use the item, although it cannot use a tool that requires skill checks unless it also has ranks in the relevant skill (or you have ranks in the relevant skill and the drone is under your direct control).", "prerequisites": "", "level_requirement": 1}, "speed": {"title": "Speed", "body": "Your drone’s land speed increases by 10 feet.", "prerequisites": "", "level_requirement": 1}, "resistance": {"title": "Resistance", "body": "Your drone gains resistance to an energy type of your choice— acid, cold, electricity, fire, or sonic—equal to your mechanic level, to a maximum of 10. You can select this mod multiple times. Its effects do not stack; each time you select this mod, it must apply to a different energy type from the list above.", "prerequisites": "", "level_requirement": 1}, "enhanced senses": {"title": "Enhanced Senses", "body": "You can sense your surroundings without needing to see them. You gain _blindsense_ with a range of 60 feet. You must have _darkvision_ and _low-light vision_, or the _nightvision_ exploit, to learn this exploit.", "prerequisites": null, "level_requirement": 6}, "climbing claws": {"title": "Climbing Claws", "body": "Your drone gains a climb speed equal to half its land speed. This mod can be applied to only combat and stealth drones.", "prerequisites": "", "level_requirement": 1}, "melee weapon arm": {"title": "Melee Weapon Arm", "body": "Your drone is equipped with a robotic arm to which you can affix a one-handed melee weapon, allowing your drone to wield that weapon and attack with it. This weapon cannot be disarmed. Wielding a two-handed melee weapon requires two melee weapon arms. If you do not already have a weapon to equip, you must purchase it separately. Swapping out a weapon in a melee weapon arm requires use of your custom rig and 1 hour of work. You can select this mod multiple times, each time adding an additional melee weapon arm to the drone.", "prerequisites": "", "level_requirement": 1}, "jump jets": {"title": "Jump Jets", "body": "Your drone is equipped with powerful miniature jets. It can use these jets to jump up to 30 feet as a move action (either vertically, horizontally, or in any combination that does not exceed 30 feet). If applied to a hover drone, these jets instead allow your drone to increase its fly speed by 30 feet for 1 round. Once used, these jets must cool down for 1 minute before they can be used again.", "prerequisites": "", "level_requirement": 1}, "camera": {"title": "Camera", "body": "Your drone has a camera that you can see through using your custom rig as long as your drone is within range. The camera has ordinary sight, and is capable of seeing whatever an ordinary human could see. The camera can also record up to 1 hour of footage, which can be downloaded and viewed using your custom rig.", "prerequisites": "", "level_requirement": 1}, "manipulator arms": {"title": "Manipulator Arms", "body": "Your drone is equipped with two robotic arms with simple hands. They can perform most functions that your arms can perform (such as opening doors, typing on a keypad, wielding a weapon, or attempting skill checks that require manual dexterity), but attacks made with them take a –4 penalty.", "prerequisites": "", "level_requirement": 1}, "hydrojets": {"title": "Hydrojets", "body": "Your drone is equipped with miniature marine jet engines, granting it a swim speed equal to half its land speed. This mod can be applied to only combat drones and stealth drones.", "prerequisites": "", "level_requirement": 1}, "hardened ai": {"title": "Hardened AI", "body": "Your drone’s AI is secured against outside influence. Any attempt to hack your drone takes a –4 penalty, and your drone receives a +4 insight bonus to saving throws against spells or effects that attempt to take control of the drone or otherwise dictate its actions.", "prerequisites": "", "level_requirement": 1}, "riding saddle": {"title": "Riding Saddle", "body": "Your drone is equipped with a seat and programming to carry a rider as a combat-trained mount. If you ride your drone, it must be at least your size or larger. To carry another rider, the drone must be at least one size larger than the rider. You can direct your drone mount in battle without attempting Survival checks.", "prerequisites": "", "level_requirement": 1}, "skill subroutines": {"title": "Skill Subroutines", "body": "Choose another skill from the skill unit list. This is a class skill for your drone, which gains a number of ranks in that skill equal to your mechanic level. Your drone also increases its Intelligence score by 2. At 11th level, you can choose this mod a second time as an advanced mod. If you do, choose an additional skill to become a class skill for your drone (this skill doesn’t have to be on the skill unit list). Your drone gains ranks in the skill equal to your mechanic level. Your drone also increases its Intelligence score again by 2.", "prerequisites": "", "level_requirement": 1}, "smuggler’s compartment": {"title": "Smuggler’s Compartment", "body": "Your drone has a secret compartment that can hold a single item of light bulk or smaller. A successful Perception check (DC = 15 + your mechanic level) is needed to notice or find the compartment. Accessing this compartment is a move action.", "prerequisites": "", "level_requirement": 1}, "extra ammo": {"title": "Extra Ammo", "body": "One of your drone’s weapon mounts can hold two additional batteries, magazines, or other type of ammunition in addition to its usual weapon and ammunition capacity. Your drone must have the weapon mount mod before selecting this mod. You can select this mod more than once, up to the number of weapon mounts the drone has.", "prerequisites": "", "level_requirement": 1}, "enhanced armor": {"title": "Enhanced Armor", "body": "Your drone gains a +2 bonus to its AC. At 11th level, you can choose this mod a second time as an advanced mod.", "prerequisites": "", "level_requirement": 1}, "armor slot": {"title": "Armor Slot", "body": "Your drone gains an armor upgrade slot for an armor upgrade (see page 204). If you do not already have an armor upgrade to install, you must purchase one separately. You can install the armor upgrade only if your drone has enough open upgrade slots to meet the upgrade’s requirements. You can select this mod up to four times, each time adding an additional slot.", "prerequisites": "", "level_requirement": 1}, "weapon proficiency": {"title": "Weapon Proficiency", "body": "Your drone gains one of the following feats as a bonus feat (it must meet all the prerequisites of the chosen feat): Advanced Melee Weapon Proficiency, Basic Melee Weapon Proficiency, Heavy Weapon Proficiency, Longarm Proficiency, Small Arm Proficiency, or Special Weapon Proficiency. You can select this mod multiple times; each time, your drone gains another of the available proficiency feats as a bonus feat.", "prerequisites": "", "level_requirement": 1}, "weapon mount": {"title": "Weapon Mount", "body": "You can affix a small arm or another one-handed ranged weapon on your drone, allowing it to wield that weapon and attack with it. This weapon cannot be disarmed. Mounting a longarm, a heavy weapon, or another two-handed ranged weapon requires two weapon mounts. A weapon mount can hold up to two batteries, two magazines, or two of another type of ammunition for the affixed weapon, provided this ammunition is of light bulk or less. Multiple weapon mounts used to affix a single two-handed weapon count as a single weapon mount for the purpose of how much ammunition it can hold. The drone reloads these batteries or magazines automatically, which takes the usual amount of time for the weapon. Spent batteries or magazines are stored within the drone. You can replace all of a weapon mount’s batteries or magazines as a move action. You must purchase separately or already have the weapon and ammunition for use with a weapon mount. You can replace the weapon with any other weapon that meets the criteria for your mount (for example, if you have two weapon mounts, you could replace a longarm with a heavy weapon). Swapping out a weapon in a weapon mount requires use of your custom rig and 1 hour of work. You can select this mod multiple times, each time adding an additional weapon mount to the drone.", "prerequisites": "", "level_requirement": 1}, "cargo rack": {"title": "Cargo Rack", "body": "Your drone is outfitted with cargo space. The drone’s Strength score counts as 4 higher for the purpose of how determining much bulk it can carry, but all of this extra bulk must be stored gear and cargo, not mounted weapons, armor mods, or the like. This does not affect the drone’s actual Strength score in any way, merely how much it can carry. Due to its size, a drone might still be unable to carry awkward or unwieldy items.", "prerequisites": "", "level_requirement": 1}, "shock wave": {"title": "Shock Wave", "body": "Whenever your drone is reduced to fewer than 10 HP, it immediately shuts down and unleashes a shock wave of electricity as a reaction (even if it is deactivated or destroyed by the attack). This deals 1d6 electricity damage per level to every creature within 10 feet (except the drone). An affected creature can attempt a Reflex save to take half damage (DC = 10 + half your mechanic level + your Intelligence modifier).", "prerequisites": "", "level_requirement": 11}, "reductive plating": {"title": "Reductive Plating", "body": "Your drone gains damage reduction 1/—. This increases to DR 2/— at 7th level and increases by 1 again at 13th level and every 3 levels thereafter.", "prerequisites": "", "level_requirement": 11}, "reactive camouflage": {"title": "Reactive Camouflage", "body": "Your drone is equipped with a thin coating that can change color to match the drone’s surroundings. Whenever your drone stays stationary for 1 round, it gains a +10 bonus to Stealth checks (this bonus doesn’t stack with the invisibility spell or similar effects). If your drone takes any action, it loses this bonus until it once again spends 1 round remaining still.", "prerequisites": "", "level_requirement": 11}, "flight system": {"title": "Flight System", "body": "Your drone gains a fly speed equal to half its land speed with average maneuverability for up to 10 minutes per day. This duration need not be continuous, but it must be used in 1-minute increments. You can select this mod a second time; in this case, the drone’s fly speed increases to its full land speed, and there is no limit on the amount of time it can fly.", "prerequisites": "", "level_requirement": 11}, "medical subroutine": {"title": "Medical Subroutine", "body": "Your drone is equipped with first aid capabilities. If you are reduced to 0 Hit Points, your drone can attempt to administer emergency medical treatment to you, even despite you being unconscious. On subsequent rounds on your turn, your drone takes as many move actions as necessary to return to your side, followed by a standard action to administer first aid. Once it has done so, you can spend 2 Resolve Points to recover a number of Hit Points equal to your mechanic level. Your drone cannot use this mod on anyone but you nor use it if you are dead or have fewer than 2 RP remaining. You can’t benefit from this treatment more than once every 24 hours. Your drone must have the manipulator arms and skill subroutines (with the Medicine skill) mods to select this mod.", "prerequisites": "", "level_requirement": 11}, "invisibility field": {"title": "Invisibility Field", "body": "Once per day as a standard action, your drone can turn invisible for 10 minutes, as per the invisibility spell. If it makes an attack during this time, the invisibility ends. Your drone can spend 2 Resolve Points to use this ability again on the same day. Your drone must have the reactive camouflage mod to select this.", "prerequisites": "", "level_requirement": 11}, "greater resistance": {"title": "Greater Resistance", "body": "Choose one type of energy for which your drone already has the resistance mod. Increase your drone’s resistance to that energy type by 5. You can select this mod multiple times. Its effects do not stack. Each time you select this mod, it applies to a different energy type for which your drone has the resistance mod.", "prerequisites": "", "level_requirement": 11}, "echolocators": {"title": "Echolocators", "body": "Your drone uses basic echolocation to notice unseen foes. The drone gains the blindsense (sound) ability (see page 262).", "prerequisites": "", "level_requirement": 11}, "excavator": {"title": "Excavator", "body": "Your drone gains a burrow speed equal to half its land speed. It can use this speed to move through clay, dirt, earth, and sand. It does not leave a hole behind, nor is its passage marked on the surface.", "prerequisites": "", "level_requirement": 11}, "skill unit": {"title": "Skill Unit", "body": "Choose one of the following skills: Acrobatics, Athletics, Computers, Engineering, Perception, or Stealth. This is a class skill for your drone, and it gains a number of ranks in the chosen skill equal to your class level. Your drone can use this skill when not under your direct control. You can change your drone’s skill unit whenever you rebuild your drone from scratch. Additionally, whenever you are directly controlling your drone, it can use any of your skill ranks if you wish, assuming it has the appropriate tools to do so (a drone without manipulator arms cannot use Engineering to disable a device, for example).", "prerequisites": "Mechanic, Level 1", "level_requirement": null}, "upgraded power core": {"title": "Upgraded Power Core", "body": "Your drone gains a pool of Resolve Points equal to 1 per 2 levels it has (minimum 1). Your drone can spend 1 Resolve Point to make a full attack without requiring your direct control and at only the normal –4 penalty for a full attack instead of the –6 penalty. Your drone regains Resolve Points after a full 8-hour rest as normal.", "prerequisites": "Mechanic, Level 10", "level_requirement": null}, "true ai": {"title": "True AI", "body": "Your drone’s AI can act with complete autonomy. Each round on your turn, your drone can take a full suite of actions (either a full action or else a move action, a standard action, and a swift action) without requiring your direct control, and it makes full attacks without your direct control with the normal –4 penalty. You don’t need to issue commands to your drone for it to take actions. You must still directly control the drone for it to use your skill ranks.", "prerequisites": "Mechanic, Level 20", "level_requirement": null}, "limited ai": {"title": "Limited AI", "body": "Each round on your turn, after you have acted, your drone can take either a move action or a standard action to attack (your drone doesn’t make a separate initiative roll). You must be able to issue simple commands to your drone, but you don’t have to spend actions to issue these commands. To receive these commands, your drone must be able to see or hear you or be within range of your custom rig. If you become unconscious or otherwise unresponsive, or if your drone is ever out of range, your drone cannot take any actions until you are again able to command it or it is once more within range.", "prerequisites": "Mechanic, Level 1", "level_requirement": null}, "master control": {"title": "Master Control", "body": "As a move action, you can directly control your drone. This allows the drone to take both a move action and any standard action this turn (one from your control, and one from its limited AI). If you also take a swift action, your drone can take a swift action as well, or it can combine its actions into a full action. Your drone must be able to see or hear you, or be within range of your custom rig, for you to directly control your drone.", "prerequisites": "Mechanic, Level 1", "level_requirement": null}, "expert ai": {"title": "Expert AI", "body": "Your drone’s AI has grown more sophisticated, giving it a more robust combat routine when not under your direct control. Each round on your turn, the drone can take a move action, take a standard action to attack, or make a full attack (this last option allows it to shoot more than once if it has the necessary weapons to do so). The drone takes a –6 penalty to full attacks made without your direct control instead of the normal –4 penalty. Like limited AI, you must still be conscious and within range.", "prerequisites": "Mechanic, Level 7", "level_requirement": null}, "exocortex mods": {"title": "Exocortex Mods", "body": "Your exocortex allows you to apply any one of the following drone mods to yourself as if you were a drone with that mod installed: armor slot, cargo rack, climbing claws, enhanced senses, hydrojets, jump jets, resistance, smuggler’s compartment, speed, or weapon proficiency (gaining proficiency in advanced melee or heavy weapons). At 11th level, you can apply an additional mod, and your options expand to include echolocators, excavator, flight system, greater resistance, invisibility field, and reactive camouflage. At 14th and 17th levels, you can apply an additional mod. Each time you gain a level, you can switch any of your mods for different mods, but you must always choose at least one mod from the 7th-level list.", "prerequisites": "", "level_requirement": 7}, "twin tracking": {"title": "Twin Tracking", "body": "You can designate two targets for your exocortex to track, increasing your base attack bonus against each. You can designate both targets with a single move action, but you must be able to see them both at that time.", "prerequisites": "", "level_requirement": 10}, "multitasking (ex)": {"title": "Multitasking (Ex)", "body": "You can designate three targets for your exocortex to track (and designate them all as a single move action). In addition, the range of your exocortex’s wireless hack increases to 40 feet. Your exocortex can also engage in combat tracking and hack a nearby computer at the same time, but the computer counts as one of the exocortex’s designated targets (allowing you to track only two targets at the same time while wirelessly hacking the computer). Lastly, you can access your exocortex’s memory module in combat, even while it is engaged in combat tracking.", "prerequisites": "", "level_requirement": 15}, "quad tracking": {"title": "Quad Tracking", "body": "Your exocortex can track four targets simultaneously, and hacking a nearby computer doesn’t count against that limit.", "prerequisites": "", "level_requirement": 20}, "combat tracking": {"title": "Combat Tracking", "body": "Your exocortex provides you with enhanced combat ability, granting you proficiency with heavy armor and longarms. At 3rd level, you gain weapon specialization in longarms just as if your class granted proficiency. As a move action during combat, you can designate a foe for your exocortex to track. As long as that target is in sight, the exocortex feeds you telemetry, vulnerabilities, and combat tactics, allowing you to make attacks against that target as if your base attack bonus from your mechanic levels were equal to your mechanic level. Designating another target causes you to immediately lose this bonus against the previous target.", "prerequisites": "", "level_requirement": 1}, "memory module": {"title": "Memory Module", "body": "You can use your exocortex’s memory module to enhance your own knowledge. Once per day, as a reaction while not in combat, you can reroll a failed skill check (see page 243) to recall knowledge (see page 143). In addition, your exocortex grants you the Skill Focus feat as a bonus feat. You can’t use your exocortex’s memory module while combat tracking is activated. Every time you gain a mechanic level, you can rebuild your exocortex’s memory module, replacing the exocortex’s bonus Skill Focus feat with Skill Focus in a different skill.", "prerequisites": "", "level_requirement": 1}, "wireless hack": {"title": "Wireless Hack", "body": "Instead of combat tracking, your exocortex can access another computer system within 20 feet, allowing it to attempt a Computers check against that computer each round, using your skill bonus. This counts as a standard action for the purpose of the Computers skill. You must remain within 20 feet of the computer system for the entire time your exocortex is interacting with the computer. If the task requires multiple actions (or even rounds) to accomplish, you can spend your actions to work in concert with your exocortex, counting both your action and the exocortex’s effective standard action toward the total time required. If you don’t have the remote hack class feature, you must be adjacent to the computer to attempt your checks", "prerequisites": "", "level_requirement": 5}, "artificial intelligence": {"title": "Artificial Intelligence", "body": "You construct an artificial intelligence (or AI), a sophisticated program of self-motivated code that you can access for help in a variety of endeavors. This AI is the product of your own genius, far more advanced and complicated than any available for sale to consumers (though it falls short of being truly self-aware), and only you know the secrets of its creation and operation. Your AI can take one of two forms: a _drone_ or an _exocortex_. You must pick one of these forms upon taking your first level of mechanic, and once this choice is made, it cannot be changed.\r\n\r\n### _Drone_\r\nYou begin play with a powerful robotic _drone_ to house your AI. You build and control this _drone_, which accompanies you on your adventures and is capable of combat, espionage, and other specialized tasks. As you gain levels, your drone advances in sophistication and gain additional abilities. While the value of your _drone_ is immense, only you, with your extensive knowledge of its quirks and security measures, can ever hope to operate or repair it.\r\n\r\n### _Exocortex_\r\nYou begin play with an _exocortex_, an artificial processor that interacts with and augments your biological brain’s cognitive functions, which can aid you in a variety of tasks, from combat to digital infiltration. Your _exocortex_ is implanted within your physical body or brain, similar to a piece of cybernetic hardware, allowing your AI to access your mind and feed you information. As you gain levels, your _exocortex_ advances in sophistication and processing power.  Only you can access or interact with your _exocortex_.", "prerequisites": "", "level_requirement": 1}, "bypass": {"title": "Bypass", "body": "You are skilled at getting inside computer systems and electronic devices. At 1st level, you gain a +1 insight bonus to _Computers_ and _Engineering_ skill checks. At 5th level, every 4 levels thereafter, and at 20th level, this bonus increases by 1.", "prerequisites": "", "level_requirement": 1}, "custom rig": {"title": "Custom Rig", "body": "You have created a customized toolkit you can use to hack systems and items. Your custom rig can be configured to take up an upgrade slot on your armor or can be installed as a cybernetic augmentation system in your brain (though it can be combined with a _datajack_ for the same price as installing a _datajack_ normally), your eyes, or an arm. For more information, see _augmentations_.  Alternatively, you can configure it to be a handheld device, meaning that you must retrieve it and hold it to use it effectively. While using this rig, you always count as having the appropriate tool or basic kit for any _Computers_ or _Engineering_ skill check you attempt. Some _mechanic tricks_ and _drone mods_ require the use of a custom rig. In addition, you can use your custom rig as a Mk I _comm unit_. Finally, if you have a _drone_, you can use your custom rig to communicate over an encrypted channel with your drone to issue commands to its AI or directly control it at a range of 2,500 feet.\r\n\r\nIf your custom rig is damaged, destroyed, lost, or stolen, you can kitbash a new one from any engineering kit, hacking kit, or other technological toolkit, reconfiguring the materials into a new custom rig with 1 hour of work. You can have only one custom rig at a time. If you create a new custom rig, your old one functions as a normal toolkit of whatever type you made it from and can no longer be used with your mechanic tricks.", "prerequisites": "", "level_requirement": 1}, "mechanic trick": {"title": "Mechanic Trick", "body": "As you gain experience, you learn tricks that allow you to perform wonders of engineering, aid in electronic infiltrations, and optimize gear. While some of these are things you learn, others are small cybernetic enhancements you make to yourself (none of which have a price or count against your augmentation limits). Some tricks require the use of a custom rig or other gear.\r\n\r\nYou learn your first mechanic trick at 2nd level, and you learn an additional mechanic trick at 4th level and every 2 levels thereafter. If a mechanic trick allows an opponent a saving throw to resist its effects, the DC is equal to 10 + half your mechanic level + your _Intelligence_ modifier. If a mechanic trick requires an opponent to attempt a skill check, the DC is equal to 10 + 1-1/2 × your class level + your _Intelligence_ modifier.\r\n\r\nUnless otherwise specified, you can’t learn _mechanic tricks_ more than once.", "prerequisites": "", "level_requirement": 2}, "overload": {"title": "Overload", "body": "As a standard action, you can cause a short in an electronic device, including most ranged energy weapons, melee weapons with the powered special property, or a single armor upgrade. This makes the device nonfunctional for 1 round. Overload doesn’t cause a locked door, safe, or other device to open, but it prevents anyone from opening it for 1 round. You must be adjacent to the device to use this ability. If you have a drone, you can instead use this ability on an electronic device adjacent to your drone. If you have an exocortex with the wireless hack ability, you can instead use this ability on any electronic device within range of your exocortex’s wireless hack. If you use overload on an item or armor upgrade in someone’s possession, the owner can attempt a Reflex saving throw to negate the effect (DC = 10 + half your mechanic level + your Intelligence modifier). Overload doesn’t affect androids, cybernetics, drones, powered armor, robots, or creatures with the technological subtype (all of which have shielding against this sort of attack), or items larger than Medium. Once a device has been successfully overloaded, a residual static charge prevents that device from being overloaded again for 1 minute.", "prerequisites": "", "level_requirement": 3}, "remote hack": {"title": "Remote Hack", "body": "You can use your custom rig to attempt Computers and Engineering skill checks at a range of 20 feet. At 7th level and every 2 levels thereafter, this range increases by 10 feet. A target of this ability (or a creature attending or observing your target) can attempt a Perception or Sense Motive check (DC = 10 + 1-1/2 × your mechanic level + your Intelligence modifier) to determine that you are the origin of this activity.", "prerequisites": "", "level_requirement": 5}, "expert rig": {"title": "Expert Rig", "body": "Your custom rig has improved. Whenever you use your custom rig to successfully hack into a computer, you can also disable one countermeasure installed in the system (except firewalls). In addition, your custom rig can now be used as any engineering or hacking specialty kit of item level 6th or lower, and it has the features of a computer with a tier equal to half your level with the artificial personality, hardened, or security I upgrade module. It also has an audio/video recorder. You can add extra modules or countermeasures to your custom rig at the normal prices. See page 213 for more information on computers.\r\n\r\nYou can also use your custom rig to communicate over an encrypted channel with your ship, allowing you to access your ship’s downloaded data sets and transponder (see page 430) at a range of 5 miles. If you have a drone, you can issue commands to or directly control your drone at the same range.", "prerequisites": "", "level_requirement": 7}, "miracle worker": {"title": "Miracle Worker", "body": "As a move action, you can repair damage to a starship’s systems or modify a suit of armor or weapon to function more efficiently. To use this ability, you must be able to handle the item affected without impediment. You can use this ability once per day at 7th level, plus one additional time per day for every 4 mechanic levels you have beyond 7th. The exact effect of this ability depends on the object or system you are modifying.\r\n\r\n* Armor: You grant a +2 enhancement bonus to a suit of armor’s EAC and KAC for 1 minute.\r\n* Weapon: You grant a +2 enhancement bonus to a weapon’s attack and damage rolls for 1 minute.\r\n* Damaged Ship: You restore a number of Hull Points equal to the starship's base frame HP increment. If this raises the ship’s HP over a multiple of its Critical Threshold, you can repair critical damage to one system per multiple, reducing its severity by one step. For example, if your starship’s Critical Threshold is 8 and you restore 10 HP, reducing the damage to the hull from 17 HP to 7 HP, you could restore one system from wrecked to glitching. Using this ability during starship combat is your action for the turn, and you can do it only during the engineering phase. See page 292 for more on ship construction and page 320 for more on damage to ships.", "prerequisites": "", "level_requirement": 7}, "override": {"title": "Override", "body": "Your overload class feature now affects androids, drones, robots, and creatures with the technological subtype, which must succeed at a Will saving throw (DC = 10 + half your mechanic level + your Intelligence modifier) or be dazed for 1 round. If the target fails its saving throw by 10 or more, it is not dazed and you can dictate its actions for 1 round, though these actions can’t be obviously self-destructive. Once a creature has attempted a saving throw against this attack (regardless of the result), it is immune to this attack for 24 hours.", "prerequisites": "", "level_requirement": 9}, "coordinated assault": {"title": "Coordinated Assault", "body": "If you have a drone, whenever both you and your drone make attacks against the same target, you each receive a +1 circumstance bonus to your attack rolls. If you have an exocortex instead, whenever you and your exocortex are both attempting to hack a system, you each receive a +1 circumstance bonus to the checks to gain access. In either case, these bonuses increase to +2 at 17th level.", "prerequisites": "", "level_requirement": 11}, "advanced rig": {"title": "Advanced Rig", "body": "Your custom rig’s computer functions gain a bonus firewall countermeasure (see page 217). This firewall has no additional cost, does not count against the maximum number of countermeasures your custom rig can have, and can block off a module or group of modules already protected by a firewall.\r\n\r\nIn addition, you can use your custom rig to communicate over an encrypted channel with your ship, allowing you to access the ship’s sensors, control its security systems, and prepare its engines for takeoff (as well as use the encrypted communications functions of your expert rig) at a range of 50 miles. If you have a drone, you can issue commands to or directly control your drone over an encrypted channel at the same range.", "prerequisites": "", "level_requirement": 13}, "control net": {"title": "Control Net", "body": "You are capable of operating multiple AIs, one in a drone and one in an exocortex. You must divide up your mechanic level between these different AIs, and each gains abilities based on the number of levels you assign to it. Every time you gain a level in mechanic, you can change the distribution of levels between these AIs using your custom rig after 24 hours of uninterrupted work. While each AI can act independently to the limits of its ability, you can control them as normal (although you can directly control only one AI at a time). If the number of levels assigned to your exocortex is less than your mechanic level, your exocortex grants a smaller increase to your base attack bonus when using combat tracking (see page 79), as noted in the table below. You gain additional exocortex abilities, such as wireless hack and multitasking, based upon the level you assign to it as normal.\r\n\r\n\r\nLEVELS ASSIGNED | INCREASE TO BASE ATTACK BONUS\r\n:---:|:---:\r\n1-4 | +1\r\n5–8 | +2\r\n9-12 | +3\r\n13–16 | +4\r\n17–20 | +5", "prerequisites": "", "level_requirement": 17}, "ghost in the machine": {"title": "Ghost in the Machine", "body": "When using your override class feature to affect an android, drone, robot, or creature with the technological subtype, a target that fails its saving throw by any amount is not dazed, and you can instead dictate its actions for the next round. These actions can’t be obviously self-destructive. Once a creature has attempted a saving throw against this attack (regardless of the result), it is immune to this attack for 24 hours unless you spend 1 Resolve Point. You can continue to spend Resolve Points in this manner each round to make the creature susceptible to override again.", "prerequisites": "", "level_requirement": 19}, "superior rig": {"title": "Superior Rig", "body": "Your custom rig’s computer functions now gain bonus lockout and wipe countermeasures. You can use your custom rig normally even when its lockout is active (you have special authorization no one else can access under any circumstances), and while any wiped data cannot be recovered by anyone else (as if the data module were destroyed), you can automatically recover it with 8 hours of work. These countermeasures have no additional cost and do not count against the maximum number of countermeasures your custom rig can have.\r\n\r\nAdditionally, you can use your custom rig to communicate over an encrypted channel with your ship at a range encompassing a planet and its close orbit, allowing you to remotely pilot your starship from point to point on the same planet or to and from orbit (as well as use the encrypted communications functions of your expert and advanced rig at the same range). If you have a drone, you can issue commands to or directly control your drone over an encrypted channel at the same range.", "prerequisites": "", "level_requirement": 19}, "tech master": {"title": "Tech Master", "body": "You are a master of technology. You can spend 1 Resolve Point to craft any technological weapon, armor, or item at a rate of 1 minute per item level or spend 1 Resolve Point to convert any existing technological armor or weapon into another suit of armor or another weapon of equal or lesser value at a rate of 1 minute per item level. This uses the normal crafting rules presented on page 235, but the item being converted counts as its full value in crafting components. You cannot convert a one- handed weapon into a two-handed weapon. When converting an item into a cheaper item, any excess value is lost and cannot be reclaimed by converting the item back.", "prerequisites": "", "level_requirement": 20}, "glean spell": {"title": "Glean Spell", "body": "Once per day, you can delve into the Akashic Record to cast a\r\nspell from either the mystic or technomancer spell list as if it were on your list of spells known. The spell consumes a spell slot 1 level higher than the level of the spell.", "prerequisites": "", "level_requirement": 18}, "greater emotionsense": {"title": "Greater Emotionsense", "body": "Your emotionsense is far more discerning, as if you had blindsight (emotion); see page 262.", "prerequisites": "", "level_requirement": 12}, "channel life": {"title": "Channel Life", "body": "If you use healing channel on a creature that has died\r\nwithin 1 round, you can bring it back to life as per a 5th- level mystic cure spell.", "prerequisites": "", "level_requirement": 15}, "mental anguish": {"title": "Mental Anguish", "body": "As a standard action, you can tweak the pain centers in the brain of a foe within 60 feet, causing it to suffer intense agony. The target must succeed at a Will save or be nauseated for 1 round. Regardless of the save, the creature becomes immune to this ability for 24 hours. This is a mind- affecting pain effect.", "prerequisites": "", "level_requirement": 9}, "inexplicable commands": {"title": "Inexplicable Commands", "body": "When one of your mind-affecting charm or compulsion spells or spell-like abilities ends, the target loses all memory that it was magically controlled or influenced. That creature still remembers the actions it took, but may be confused by them.", "prerequisites": "", "level_requirement": 1}, "starlight form": {"title": "Starlight Form", "body": "You can transform yourself into blazing starlight as a standard action. Your body sheds normal light in a 30-foot radius, and you gain the benefits of concealment (20% miss chance). At 7th level, a creature that ends its turn adjacent to your starlight form must succeed at a Fortitude save or be blinded for 1 round. You can maintain your starlight form for a number of minutes per day equal to your mystic level; this duration does not need to be continuous, but it must be used in 1-minute increments. You can forgo the ability's concealment and blinding aspects to instead simply shed light, though this still counts against the ability’s duration for the day.", "prerequisites": "", "level_requirement": 3}, "channel bond": {"title": "Channel Bond", "body": "When you use healing channel as a standard action, you can heal an ally linked by your telepathic bond class feature as if you were touching that ally, as long as the ally is within 120 feet. When you use healing channel as a full action, it heals all allies linked by your telepathic bond class feature within 120 feet (as well as all other allies within 30 feet).", "prerequisites": "", "level_requirement": 12}, "starry bond": {"title": "Starry Bond", "body": "You can share the good fortune of your stargazer class feature with your allies. Whenever an ally linked by your telepathic bond class feature fails an ability check, attack roll, saving throw, or skill check, you can spend 1 Resolve Point as a reaction to enable your ally to reroll the failed check (see page 243). This ability otherwise functions as the stargazer class feature.", "prerequisites": "", "level_requirement": 12}, "meteor shower": {"title": "Meteor Shower", "body": "You can spend 1 Resolve Point as a full action to call down a rain of meteorites in a 10-foot-radius vertical cylinder, 40 feet high, at a range of up to 250 feet. The meteorites deal 12d6 damage to every creature in the area (Reflex half). Half the damage is bludgeoning damage; the other half is fire damage. If you are outdoors and can see stars, the meteorites instead deal 12d10 damage.", "prerequisites": "", "level_requirement": 15}, "interplanetary teleport": {"title": "Interplanetary Teleport", "body": "At 18th level, once per day, you can spend 1 Resolve Point as a full action to use interplanetary teleport as a spell-like ability. If you have been to a location in another star system before, you can spend 2 Resolve Points to use interplanetary teleport to travel there, even though it exceeds the spell’s normal range.", "prerequisites": "", "level_requirement": 18}, "akashic knowledge": {"title": "Akashic Knowledge", "body": "You gain the channel skill ability at 1st level (instead of 2nd level). Each day when you recover your spell slots, you can tap into the Akashic Record, enabling you to choose one Profession skill and add that to your list of associated skills for the channel skill class feature.", "prerequisites": "", "level_requirement": 1}, "access akashic record": {"title": "Access Akashic Record", "body": "You can access the Akashic Record to augment your skills.\r\nYou can spend 1 Resolve Point to attempt a skill check as if you had ranks in that skill equal to your mystic level.", "prerequisites": "", "level_requirement": 3}, "mind probe": {"title": "Mind Probe", "body": "You can use mind probe as a spell-like ability a number of\r\ntimes per day equal to your mystic level, lasting for 1 round. A creature that successfully saves against your mind probe is immune to further uses of this ability for 24 hours.", "prerequisites": "", "level_requirement": 9}, "telepathic memories": {"title": "Telepathic Memories", "body": "You can share memories at will with allies linked by your telepathic bond class feature. As a full action, you or a linked ally can send a memory of up to 1 minute to as many others in the bond as they choose. Sending a relevant memory counts as a successful aid another attempt for a skill check, even if you wouldn’t otherwise be able to use aid another (to a limit of one such memory per skill check).", "prerequisites": "", "level_requirement": 12}, "memory palace": {"title": "Memory Palace", "body": "You assemble an extradimensional library to house mental constructs representing your accumulated knowledge. This memory palace has a single shimmering entrance. You can access your memory palace once per day; when you do, the entrance appears within close range. If any creatures or objects that were not part of the memory palace when it was created remain inside it, the entrance remains where it first appeared. Only those you designate can enter the memory palace, and the entrance closes and becomes invisible behind you when you enter. Anyone inside can open the entrance and exit the memory palace at will. The only way to enter and exit the memory palace is via the entrance; even plane shift and similar magic do not access it.\r\n\r\nYou can create any floor plan you desire for your memory palace, up to a number of 10-foot cubes equal to your mystic level. Inside, the atmosphere is clean, fresh, and warm; outside conditions don’t affect the memory palace, nor do conditions inside it pass beyond. There is no furniture other than bookcases, computers, and a few desks and sofas. A number of unseen servants (as per the spell of the same name) equal to half your mystic level serve as librarians. The library keeps the same layout each time you access it, though you can alter its appearance each time you gain a level or by spending 15 minutes concentrating—you don’t need to be inside it to alter it.\r\n\r\nWhen you gain this ability, choose one skill that can be used with the recall knowledge task. Consulting your memory palace gives anyone who studies within—including you—a +4 enhancement bonus to skill checks to recall knowledge of that type, and creatures inside the memory palace can attempt checks of that type untrained. At 16th level, and at each level thereafter, choose another skill that can be used with the recall knowledge task to which your memory palace’s skill bonus applies.", "prerequisites": "", "level_requirement": 15}, "empathy": {"title": "Empathy", "body": "As a full action, you can attempt a Sense Motive check to read the emotions of a particular creature (DC = 20 or 10 + its Bluff modifier, whichever is higher). If you succeed, you learn its general disposition and attitude toward creatures within 30 feet of it, and you gain a +2 circumstance bonus to Bluff, Diplomacy, Intimidate, and Sense Motive checks against that creature for 1 hour. Whether you succeed or fail, after opening your mind to read emotions, you take a –2 penalty to saving throws against mind-affecting effects for 1 minute.", "prerequisites": "", "level_requirement": 1}, "greater mindlink": {"title": "Greater Mindlink", "body": "You can use your mindlink ability on the same creature as many times per day as you wish, and the communication can be both ways, though the maximum of 10 minutes of communication per round still applies.", "prerequisites": "", "level_requirement": 3}, "emotionsense": {"title": "Emotionsense", "body": "You can detect and locate creatures within 60 feet that have emotions, as if you had blindsense (emotion); see page 262. A creature can keep its emotions calm to avoid detection by this ability by succeeding at a Bluff check with a DC equal to 10 + your Sense Motive modifier, but a creature under the influence of an emotion effect cannot try to avoid detection. Creatures under the effects of nondetection or similar effects automatically avoid detection by this ability. Unless otherwise stated, constructs and creatures with Intelligence scores of 2 or lower don’t have emotions and can’t be sensed this way.", "prerequisites": "", "level_requirement": 6}, "discern lies": {"title": "Discern Lies", "body": "You can use discern lies as a spell-like ability a number of times per day equal to your mystic level, each time targeting a single creature. This effect lasts 1 round. Once a creature successfully saves against this ability, it becomes immune to further uses of this ability for 24 hours.", "prerequisites": "", "level_requirement": 9}, "retrocognition": {"title": "Retrocognition", "body": "You can use retrocognition as a spell-like ability at will. When doing so, you take a –2 penalty to saving throws against mind-affecting effects for as long as you concentrate on retrocognition and an equal amount of time afterward. You can spend 1 Resolve Point to negate this penalty.", "prerequisites": "", "level_requirement": 15}, "empathic mastery": {"title": "Empathic Mastery", "body": "You can spend 1 Resolve Point to use psychic surgery as a spell-like ability. If you are incapacitated by an effect that psychic surgery could remove and have at least 1 Resolve Point remaining, you can spend 1 Resolve Point to use this ability on yourself, even without being able to take any actions.", "prerequisites": "", "level_requirement": 18}, "healing channel": {"title": "Healing Channel", "body": "You can heal yourself and your allies. You can spend 1 Resolve Point to channel this energy. Healing yourself with channeled energy is a move action, healing an ally you touch is a standard action, and healing all allies within 30 feet is a full action. This energy restores 2d8 Hit Points and increases by 2d8 at 3rd level and every 3 levels thereafter.", "prerequisites": "", "level_requirement": 1}, "lifelink": {"title": "Lifelink", "body": "At the start of each turn, you can choose an ally within 30 feet who has taken Hit Point damage and transfer her wounds to yourself, dealing an amount of damage up to your mystic level to your Hit Points (bypassing any Stamina Points you may have) and healing the ally’s Hit Points an equal amount. This doesn’t require any action on your part. You can’t prevent or reduce the damage you take from lifelink.", "prerequisites": "", "level_requirement": 3}, "connection": {"title": "Connection", "body": "You have a mysterious connection with some force that grants you magical powers. The exact nature of your connection can vary widely, and even mystics who share the same connection may interpret it differently. You must pick one connection upon taking your first level of mystic—once made, this choice can’t be changed. Connections you can choose from begin on page 85.\r\n\r\nMany mystics serve as priests of various gods, and while you can theoretically choose any type of connection with any entity or concept, deities rarely grant connections that don’t fit within their ethos (for example, Weydan, the god of freedom, is unlikely to look kindly on overlords). As such, each connection lists the deities and philosophies commonly associated with it.\r\n\r\n### Connection Power\r\nAt 1st level, 3rd level, and every 3 levels thereafter, you gain a connection power unique to your connection. If a connection power allows a saving throw to resist its effects, the DC is equal to 10 + half your mystic level + your Wisdom modifier. If the power requires an enemy to attempt a skill check, the DC is equal to 10 + 1-1/2 × your mystic level + your Wisdom modifier.\r\n\r\n### Connection Spell\r\nYour connection grants you additional spells known, one for each level of mystic spell you can cast, starting at 1st level and at any level when you normally gain access to a new spell level. These spells are in addition to the spells known listed on Table 4–6: Mystic Spells Known. These spells can’t be exchanged for different spells at higher levels (except in specific cases; see below). The spell level of each spell is listed in your connection’s entry.\r\n\r\nIf your connection lists a single variable-level spell (see page 330) for all spell levels at the start of its spells entry, you gain that variable-level spell when you first get your connection spell for each level. The next time you gain a connection spell, add the next higher level of the variable-level spell to your list of spells known. You immediately lose the lower-level version of that variable-level spell and replace it with the listed connection spell for that lower level.", "prerequisites": "", "level_requirement": 1}, "healer’s bond": {"title": "Healer’s Bond", "body": "As a standard action, you can form a bond with up to three allies, allowing you to constantly sense their condition as per the status spell. This bond lasts until dispelled or until you create a new healer’s bond, which immediately ends the previous one. At 11th level, when you gain the telepathic bond class feature, you also gain the effects of status on all creatures linked by your telepathic bond.", "prerequisites": "", "level_requirement": 3}, "steal life": {"title": "Steal Life", "body": "As a standard action, you can spend 1 Resolve Point to steal part of a creature’s life force and transfer it to yourself or others. You must touch the target (requiring a successful melee attack against its EAC), which deals 1d6 damage for every 2 mystic levels you have (maximum 10d6). Choose an ally within 30 feet; that ally recovers an amount of Hit Points equal to the damage dealt (to a maximum of the foe’s remaining Hit Points). Alternatively, you can heal yourself instead, but you restore only a number of Hit Points equal to half the damage dealt. If this heals the recipient (you or your ally) up to maximum Hit Points, any excess persists for 1 hour as temporary Hit Points. If your attack misses, you don’t lose the Resolve Point.", "prerequisites": "", "level_requirement": 9}, "deny death": {"title": "Deny Death", "body": "You are immune to death effects and negative levels. If you\r\nwould normally die from damage, as long as you have at least 1 Resolve Point remaining, you can immediately spend all of your remaining Resolve Points to instead stay alive. If your Hit Points would have been reduced to 0, you now have 1 Hit Point instead. Once you use this ability, you can’t regain Resolve Points again until you rest for 8 hours, even if you have another means to do so.", "prerequisites": "", "level_requirement": 18}, "share pain": {"title": "Share Pain", "body": "Whenever a foe deals damage to you, you can spend 1Resolve Point as a reaction to shift some of the pain back onto that foe. Unless the foe succeeds at a Will save, reduce the damage you take from the attack by your mystic level (to a maximum of the attack’s damage), and the foe takes an equal amount of damage. This is a mind-affecting pain effect.", "prerequisites": "", "level_requirement": 1}, "backlash": {"title": "Backlash", "body": "Whenever a foe succeeds at a Will save against one of your spells and completely negates the effect, that foe takes 1 nonlethal damage for each mystic level you have. This is a mind-affecting pain effect.", "prerequisites": "", "level_requirement": 3}, "sow doubt": {"title": "Sow Doubt", "body": "As a standard action, you can spend 1 Resolve Point to create uncertainty in the mind of a foe within 30 feet. You choose whether the target becomes flat-footed, becomes off-target, takes a –2 penalty to saving throws, or takes a –2 penalty to skill checks. The effect lasts for a number of rounds equal to half your mystic level, unless the target succeeds at a Will save to reduce the duration to just 1 round. A creature can be affected only by one sow doubt effect. If you use this ability on the same creature again, the new effect replaces the old effect. This is a mind-affecting effect.", "prerequisites": "", "level_requirement": 6}, "mindbreaking link": {"title": "Mindbreaking Link", "body": "Whenever you or an ally linked by your telepathic bond class feature scores a critical hit against a foe, you can spend 1 Resolve Point as a reaction to confuse that foe. The foe must succeed at a Will save or become confused for 1 round. Whether or not it succeeds at this save, the target is affected by your sow doubt ability for 1 round. This is a mind-affecting effect.", "prerequisites": "", "level_requirement": 12}, "mindkiller": {"title": "Mindkiller", "body": "As a standard action, you can mold the subconscious fear of a foe within 60 feet into a psychic image of the most disturbing creature imaginable to the target. Only the target can see the mindkiller, and if the target succeeds at a Will save to recognize the image as unreal, the mindkiller has no effect. If the target fails this Will save, the mindkiller touches the target, which must then succeed at a Fortitude save or die from fear. On a successful Fortitude save, the target instead takes 3d6 damage. Once a creature succeeds at either save against this ability, it becomes immune to this ability for 24 hours. This is a mind-affecting fear effect.", "prerequisites": "", "level_requirement": 15}, "explode head": {"title": "Explode Head", "body": "You can spend 1 Resolve Point as a standard action to psychically assault the brain of a foe within 60 feet, causing incredible pressure to build in its head. If the target has 20 Hit Points or fewer, its head explodes, instantly killing the target and spreading debris in a 10-foot radius. Each creature in the area must succeed at a Reflex saving throw or take 2d6 slashing damage from the flying debris. A target with more than 20 Hit Points takes 1d6 damage per mystic level you have (maximum 20d6), but can attempt a Fortitude save to take only half damage. If this damage would reduce the target to 0 HP, the target’s head explodes as described above. This ability works only on a creature that has a head and would die from the loss of a head.", "prerequisites": "", "level_requirement": 18}, "forced amity": {"title": "Forced Amity", "body": "You can spend 1 Resolve Point as a standard action to shunt positive emotions and thoughts through your connection, forcing a humanoid creature to become friendly to you for a time. This functions as charm person.", "prerequisites": "", "level_requirement": 3}, "echoes of obedience": {"title": "Echoes of Obedience", "body": "Even creatures that resist your dominance can’t shake the lingering echoes of your mind. When a creature succeeds at a saving throw against one of your mind-affecting charm or compulsion spells or spell-like abilities and negates the effect, it takes a –1 penalty to AC, attack rolls, and skill checks until the beginning of your next turn. This is a mind-affecting effect.", "prerequisites": "", "level_requirement": 6}, "greater forced amity": {"title": "Greater Forced Amity", "body": "Your forced amity ability functions as charm monster.", "prerequisites": "", "level_requirement": 9}, "jealous overlord": {"title": "Jealous Overlord", "body": "When an ally linked by your telepathic bond class feature is subject to mind-affecting effect that issues commands, as a reaction you can issue a countermand allowing the linked ally to act normally. When you do, attempt an opposed Charisma check against the originator of the mind-affecting effect; if you succeed, your ally can act normally.", "prerequisites": "", "level_requirement": 12}, "forceful commands": {"title": "Forceful Commands", "body": "When you use a mind-affecting charm or compulsion spell or spell-like ability against a target benefiting from an active spell that protects against your attack, you automatically become aware of the presence of such defenses, and can spend 1 Resolve Point as part of casting the spell to attempt a caster level check to dispel the highest-level such spell, as if you had cast dispel magic.", "prerequisites": "", "level_requirement": 15}, "absolute control": {"title": "Absolute Control", "body": "When you issue a command to a dominated creature that would force it to act against its nature, you can spend 1 Resolve Point to deny it a new saving throw against your domination. The dominated creature still won’t carry out an obviously self-destructive order.", "prerequisites": "", "level_requirement": 18}, "walk the void": {"title": "Walk the Void", "body": "You are immune to the harmful environmental effects of outer space and vacuum. You also gain a fly speed of 20 feet while in space. In addition, whenever you can see the stars, you can determine your precise location. Finally, add Piloting to your list of class skills.", "prerequisites": "", "level_requirement": 1}, "stargazer": {"title": "Stargazer", "body": "You can study the stars to gain a bit of good luck. Twice per day, if you are outdoors and can see the stars, you can reroll a failed ability check, attack roll, saving throw, or skill check (see page 243).", "prerequisites": "", "level_requirement": 6}, "starflight": {"title": "Starflight", "body": "While in starlight form, you gain the ability to fly as per the flight spell (spell level 3rd or lower).", "prerequisites": "", "level_requirement": 9}, "peer into the future": {"title": "Peer into the Future", "body": "Once per day, you can spend 10 minutes in uninterrupted\r\nmeditation to receive visions of possible futures. At any point over the next 24 hours, you can declare that you are using the benefit of this ability before rolling one initiative check, saving throw, or skill check. You gain a +4 insight bonus to that check. At 11th level, you can use this ability twice per day, though you can’t use it again until after you’ve used your first bonus.", "prerequisites": "", "level_requirement": 6}, "speak with animals": {"title": "Speak with Animals", "body": "You can communicate with any creature of the animal type,\r\nthough this doesn’t make it friendly. If an animal is friendly toward you, it may do you favors. This ability allows you to use Intimidate to bully animals, and you can use any other language-dependent effect against animals.", "prerequisites": "", "level_requirement": 1}, "grasping vines": {"title": "Grasping Vines", "body": "You can spend 1 Resolve Point as a standard action to cause an area within 100 feet to sprout writhing vines in a 20-foot- radius spread. The target surface must be solid but does not need to be capable of sustaining plants normally. The vines have a reach of 5 feet and attempt to wrap around creatures in the area of effect or those that enter the area; such a creature must succeed at a Reflex save or gain the entangled condition. Creatures that successfully save can move as normal, but those that remain in the area must attempt a new save at the end of your turn each round. Creatures moving into the area must attempt a save immediately; failure ends their movement and they become entangled. An entangled creature can break free as a move action with a successful Acrobatics check or DC 15 Strength check. The vines last for a number of rounds equal to your mystic level, and the entire area is difficult terrain while the effect lasts. At 11th level, the vines can reach 10 feet and sprout thorns that deal 1d6 piercing damage each round to creatures in the area.", "prerequisites": "", "level_requirement": 3}, "animal adaptation": {"title": "Animal Adaptation", "body": "As a standard action, you can modify your body. Choose one of the following to gain the noted benefit: elongated legs (increase your land speed by 10 feet), fins and webbed digits (granting you a swim speed equal to half your land speed), suckers on wrists and feet (granting you a climb speed equal to half your land speed), or vertical-slit pupils (granting you darkvision 60 feet). This ability lasts for a number of minutes per day equal to your mystic level; this duration doesn’t need to be continuous, but it must be used in 1-minute increments. Your base form and size are largely unchanged, but some of your body parts are altered. Armor and gear you are wearing adjusts to your new shape for the duration of this ability. You can have only one of these adaptations active at a time; choosing a new adaptation is a standard action and the new choice replaces the old. At 12th level, the climb and swim speeds granted by your adaptation are equal to your land speed, and you add wings (granting you a fly speed of 30 feet with average maneuverability) to the list of possible adaptations.", "prerequisites": "", "level_requirement": 6}, "reactive resistance": {"title": "Reactive Resistance", "body": "The first time each day you would take energy damage, you immediately gain resistance 10 to that energy type for the remainder of the day. (If you are damaged by more than one energy type simultaneously, choose which type you resist.)", "prerequisites": "", "level_requirement": 9}, "share resistance": {"title": "Share Resistance", "body": "As a standard action, you can spend 1 Resolve Point to grant allies linked by your telepathic bond class feature resistance 5 to the same energy type that you can resist through your reactive resistance class feature for 1 minute. You can’t use this ability if your reactive resistance class feature has not yet been activated for the day.", "prerequisites": "", "level_requirement": 12}, "plant transport": {"title": "Plant Transport", "body": "Once per day as a full action, you can enter any living plant equal to your size or larger and exit from another plant of the same kind in the same solar system, regardless of the distance separating the two. The destination plant does not need to be familiar to you. If you are uncertain of the location of a particular kind of destination plant, you merely designate direction and distance and this ability moves you as close as possible to the desired location. If a particular destination plant is desired but the plant is not living, this ability fails and you are ejected from the entry plant. You cannot travel through plant creatures. You can bring along objects as long as their bulk doesn’t exceed your Strength score. You can also bring up to five willing Medium or smaller creatures (each carrying no more bulk than their Strength scores) with you, provided they are linked to you with joined hands.", "prerequisites": "", "level_requirement": 15}, "guided rebirth": {"title": "Guided Rebirth", "body": "As long as you have at least 1 Resolve Point remaining, you can spend all your remaining Resolve Points as a full action to surround yourself with an organic cocoon. While enclosed in the cocoon, you are considered helpless. Eight hours later, you emerge having changed your type to animal, humanoid (of any subtype), or your original type, gaining superficial physical characteristics as appropriate. This change does not alter your ability scores, Hit Points, Stamina Points, saving throws, skill points, class skills, or proficiencies. Each time you make this transformation, you are cleansed of all poisons and diseases, are restored to full Hit Points and Stamina Points, and heal all ability damage. You must select a type other than your current type every time you make the transformation. You can use this ability once per day. Once you use this ability, you can’t regain Resolve Points until you rest for 8 hours, even if you have another means to do so.", "prerequisites": "", "level_requirement": 18}, "connection power": {"title": "Connection Power", "body": "At 1st level, 3rd level, and every 3 levels thereafter, you gain a connection power unique to your connection. If a connection power allows a saving throw to resist its effects, the DC is equal to 10 + half your mystic level + your Wisdom modifier. If the power requires an enemy to attempt a skill check, the DC is equal to 10 + 1-1/2 × your mystic level + your Wisdom modifier.", "prerequisites": "", "level_requirement": 1}, "connection spell": {"title": "Connection Spell", "body": "Your connection grants you additional spells known, one for each level of mystic spell you can cast, starting at 1st level and at any level when you normally gain access to a new spell level. These spells are in addition to the spells known listed on Table 4–6: Mystic Spells Known. These spells can’t be exchanged for different spells at higher levels (except in specific cases; see below). The spell level of each spell is listed in your connection’s entry.\r\n\r\nIf your connection lists a single variable-level spell (see page 330) for all spell levels at the start of its spells entry, you gain that variable-level spell when you first get your connection spell for each level. The next time you gain a connection spell, add the next higher level of the variable-level spell to your list of spells known. You immediately lose the lower-level version of that variable-level spell and replace it with the listed connection spell for that lower level.", "prerequisites": "", "level_requirement": 1}, "healing touch": {"title": "Healing Touch", "body": "Once per day, you can spend 10 minutes to magically heal an ally up to 5 Hit Points per mystic level.", "prerequisites": "", "level_requirement": 1}, "channel skill": {"title": "Channel Skill", "body": "You draw strange feelings, instincts, knowledge, and urges from your connection, augmenting your prowess in certain tasks. Each connection has two skills associated with it. You gain a +1 insight bonus to skill checks with your connection’s associated skills. This bonus increases by 1 at 5th level and every 3 levels thereafter.", "prerequisites": "", "level_requirement": 2}, "mindlink": {"title": "Mindlink", "body": "You can form a mental link with creatures you touch, communicating information rapidly through it. You can use mindlink at will as a spell-like ability, though only once per day on any given individual.", "prerequisites": null, "level_requirement": 2}, "telepathic bond": {"title": "Telepathic Bond", "body": "As a standard action, you can form a telepathic link with up to six other willing creatures, allowing you to communicate telepathically at great distances. This functions as telepathic bond, except the duration is permanent. You can have only one telepathic bond active in this way at any given time; creating a new telepathic bond immediately ends the previous one.", "prerequisites": "", "level_requirement": 11}, "transcendence": {"title": "Transcendence", "body": "You are close to becoming one with your connection. You can cast each of your connection spells once per day without consuming a spell slot. In addition, you learn how to temporarily transcend your physical form. Once per day, you can spend 1 Resolve Point to project your consciousness outside of your physical body in the form of an intangible psychic image of yourself. This counts as a 6th-level illusion effect and lasts for a number of rounds equal to your mystic level. While your consciousness is projected, your physical body is considered blind, deaf, and helpless, but you can return to your body as a swift action. You control your psychic image as though it was your own body, and your senses perceive only what the image can see and hear. You move with a fly speed of 60 feet and perfect maneuverability. You can pass through solid objects as though you were incorporeal, but you can’t go farther into a solid object than your space (5 feet for a Medium creature). You can’t directly affect physical objects. Your projected consciousness is immune to most attacks or effects, whether or not they affect incorporeal creatures, but mind- affecting effects have their full effect on you.\r\n\r\nYou can cast any mystic spell or spell-like ability with a range of touch or greater from your projected consciousness. The spells affect other targets normally. You can’t cast any spells on your projected consciousness except for illusion spells. You need not maintain line of effect to your projected consciousness, but if you cross into another plane, even momentarily (including via Drift travel), your mind immediately returns to your physical body.", "prerequisites": "", "level_requirement": 19}, "enlightenment": {"title": "Enlightenment", "body": "You achieve enlightenment, becoming a living incarnation of your connection. You no longer age, nor do you die of old age. Once per day as a move action, you can enter a state of total communion with your connection that lasts for 1 minute. During this time, you gain a +4 insight bonus to attack rolls, saving throws, and skill checks, and you gain 20 temporary Resolve Points that you can use only on connection powers. Any unspent temporary Resolve Points disappear at the end of this minute. In addition, once per week, you can cast miracle as a spell-like ability.", "prerequisites": "", "level_requirement": 20}, "operative's edge": {"title": "Operative's Edge", "body": "Your diverse training as an operative grants you a +1 insight bonus to initiative checks and to skill checks. This bonus increases by 1 at 3rd level and every 4 levels thereafter.", "prerequisites": null, "level_requirement": 1}, "specialization": {"title": "Specialization", "body": "Your specialization represents your primary area of expertise. Pick one _operative specialization_ upon taking your 1st level of the operative class. Once made, this choice cannot be changed.  Your specialization grants you the _Skill Focus_ feat in your specialization’s associated skills, and you gain a free skill rank in each of those skills at each _operative_ level (this does not allow you to exceed the maximum number of skill ranks in a single skill).", "prerequisites": null, "level_requirement": 1}, "specialization exploit": {"title": "Specialization Exploit", "body": "You gain your specialization’s listed exploit as a bonus operative exploit, even if you don’t meet the prerequisites.", "prerequisites": "", "level_requirement": 5}, "specialization skill mastery": {"title": "Specialization Skill Mastery", "body": "You become so confident in certain skills that you can use them reliably even under adverse conditions. When attempting a skill check with a skill in which you have the Skill Focus feat, you can take 10 even if stress or distractions would normally prevent you from doing so.", "prerequisites": "", "level_requirement": 7}, "specialization power": {"title": "Specialization Power", "body": "You gain a special power depending on the specialization you chose at 1st level.", "prerequisites": "", "level_requirement": 11}, "trick attack": {"title": "Trick Attack", "body": "You can trick or startle a foe and then attack when she drops her guard. As a full action, you can move up to your speed. Whether or not you moved, you can then make an attack with a melee weapon with the operative special property or with any small arm. Just before making your attack, attempt a Bluff, Intimidate, or Stealth check (or a check associated with your specialization; see page 94) with a DC equal to 20 + your target’s CR. If you succeed at the check, you deal 1d4 additional damage and the target is flat-footed. This damage increases to 1d8 at 3rd level, to 3d8 at 5th level, and by an additional 1d8 every 2 levels thereafter. You can’t use this ability with a weapon that has the unwieldy special property or that requires a full action to make a single attack.", "prerequisites": "", "level_requirement": 1}, "evasion": {"title": "Evasion", "body": "If you succeed at a Reflex save against an effect that normally has a partial effect on a successful save, you instead suffer no effect. You gain this benefit only when unencumbered and wearing light armor or no armor, and you lose the benefit when you are helpless or otherwise unable to move.", "prerequisites": "", "level_requirement": 2}, "operative exploit": {"title": "Operative Exploit", "body": "As you gain experience, you learn special tricks called operative exploits. You learn your first operative exploit at 2nd level, and you learn an additional exploit every 2 levels thereafter. If an operative exploit allows a saving throw to resist its effects, the DC is equal to 10 + half your operative level + your Dexterity modifier. If it requires an enemy to attempt a skill check, the DC is equal to 10 + 1-1/2 × your operative level + your Dexterity modifier. The list of operative exploits appears on page 95. You cannot learn the same exploit more than once unless it specially says otherwise.", "prerequisites": "", "level_requirement": 2}, "quick movement": {"title": "Quick Movement", "body": "As long as you are unencumbered and wearing light armor or no armor, your land speed increases by 10 feet. At 9th level, your land speed instead increases by 20 feet, and at 15th level, your land speed instead increases by 30 feet.", "prerequisites": "", "level_requirement": 3}, "debilitating trick": {"title": "Debilitating Trick", "body": "When you hit an enemy with a trick attack, you can make the creature flat-footed or off-target until the beginning of your next turn. You might learn exploits that grant you additional options for your debilitating trick, but you can select only one option each time you hit with a trick attack.", "prerequisites": "", "level_requirement": 4}, "uncanny agility": {"title": "Uncanny Agility", "body": "You are immune to the flat-footed condition, and your opponent doesn’t gain any bonuses to attack rolls against you from flanking you or attacking you when you’re prone. Furthermore, covering fire and harrying fire don’t provide any advantage against you.", "prerequisites": "", "level_requirement": 7}, "triple attack": {"title": "Triple Attack", "body": "When making a full attack using only melee weapons with the operative special property or small arms, you can make up to three attacks instead of two.", "prerequisites": "", "level_requirement": 8}, "quad attack": {"title": "Quad Attack", "body": "When making a full attack using only melee weapons with the operative special property or small arms, you can make up to four attacks instead of two.", "prerequisites": "", "level_requirement": 13}, "double debilitation": {"title": "Double Debilitation", "body": "When you hit an enemy with a trick attack, you can apply two of the effects from your debilitating trick.", "prerequisites": "", "level_requirement": 17}, "supreme operative": {"title": "Supreme Operative", "body": "Whenever you attempt a skill check with your specialization’s associated skills, you can roll twice and take the higher result. Once per day as a move action, you can temporarily trade out one of your operative exploits for another operative exploit requiring the same level or lower. This trade lasts 24 hours. If the exploit you trade away is a prerequisite for any of your other abilities, you lose all abilities that require it as a prerequisite for the duration.", "prerequisites": "", "level_requirement": 20}, "alien archive": {"title": "Alien Archive", "body": "Your vast experience makes identifying new creatures easier for you. Double your operative’s edge bonus to your skill checks when identifying a creature and its abilities. If you successfully identify a creature, you gain a +2 enhancement bonus to your skill check when you make a trick attack against that creature.", "prerequisites": null, "level_requirement": 2}, "combat trick": {"title": "Combat Trick", "body": "You gain a bonus combat feat. You must meet all of that feat’s prerequisites.", "prerequisites": "", "level_requirement": 2}, "field treatment": {"title": "Field Treatment", "body": "You can take 1 minute to tend your wounds and spend 1 Resolve Point to recover a number of Hit Points equal to three times your operative level.", "prerequisites": "", "level_requirement": 2}, "holographic clone": {"title": "Holographic Clone", "body": "You can create holographic duplicates or psychic projections of yourself that conceal your true location. Once per day as a standard action, you can create 1d4 images of yourself that last for 1 minute per operative level. This ability otherwise functions as mirror image. You can use this exploit an additional time per day at 6th level, and again at 10th level.", "prerequisites": "", "level_requirement": 2}, "inoculation": {"title": "Inoculation", "body": "You’ve trained to resist various chemical and biological weapons, toxins, and pathogens you come across in the course of your missions. You add your operative’s edge bonus to Fortitude saves against poison and disease.", "prerequisites": "", "level_requirement": 2}, "nightvision": {"title": "Nightvision", "body": "You can see in the dark as if you had low-light vision and darkvision with a range of 60 feet.", "prerequisites": "", "level_requirement": 2}, "quick disguise": {"title": "Quick Disguise", "body": "Once per day as a standard action, you can quickly change your appearance. This functions as disguise self and lasts for 1 minute per operative level. You can use this exploit an additional time per day at 6th level, and again at 10th level.", "prerequisites": "", "level_requirement": 2}, "uncanny mobility": {"title": "Uncanny Mobility", "body": "When you make a trick attack, if you choose the target of your attack before you move, your movement doesn’t provoke attacks of opportunity from that target. When you use your standard action to move, you can choose one creature; you don’t provoke attacks of opportunity from that creature for this movement.", "prerequisites": "", "level_requirement": 2}, "uncanny pilot": {"title": "Uncanny Pilot", "body": "When you attack while you’re driving a vehicle, you halve the vehicle’s penalty to your attack roll (to a minimum of no penalty if the vehicle normally imposes a –1 penalty). When you’re in a chase, you gain a +2 bonus to skill checks you attempt when taking the evade or trick pilot actions.", "prerequisites": "", "level_requirement": 2}, "bleeding shot": {"title": "Bleeding Shot", "body": "For your debilitating trick, you can afflict your target with an amount of bleed damage equal to your operative level.", "prerequisites": "", "level_requirement": 6}, "debilitating sniper": {"title": "Debilitating Sniper", "body": "You can use trick attack with sniper weapons. You do not add trick attack damage to your attack, but the target is still flat- footed, and you can use debilitating tricks.", "prerequisites": "", "level_requirement": 6}, "hampering shot": {"title": "Hampering Shot", "body": "For your debilitating trick, you can reduce your target’s speeds by half and prevent it from using the guarded step action until the beginning of your next turn.", "prerequisites": "", "level_requirement": 6}, "improved quick movement": {"title": "Improved Quick Movement", "body": "You can move even faster than other operatives. You gain double the benefits of your quick movement ability, up to a maximum additional increase of +20 feet. You must have quick movement to learn this exploit.", "prerequisites": "", "level_requirement": 6}, "interfering shot": {"title": "Interfering Shot", "body": "For your debilitating trick, you can prevent your target from using reactions (see page 244) until the end of your next turn.", "prerequisites": "", "level_requirement": 6}, "mentalist’s bane": {"title": "Mentalist’s Bane", "body": "If you fail your Will saving throw against a mind-affecting effect with a duration of 1 round or more, you can attempt another saving throw against the effect 1 round later at the same DC. You get only one extra chance to save per effect.\r\n\r\nIf you succeed at a saving throw against a charm or compulsion effect, you can prevent the effect’s originator from knowing you succeeded. You gain basic knowledge of what the mental effect would have made you do or feel, and you can attempt a Bluff check to pretend you are under that effect. If the mental effect would provide a link between you and the originator (like the dominate person spell), you can choose to allow the link without the control.", "prerequisites": "", "level_requirement": 6}, "speed hacker": {"title": "Speed Hacker", "body": "You can disable mechanical devices with Engineering and computer systems with Computers in half the usual time. In the rare cases when disabling a system or device would normally be a full action, you can do it as a standard action, and if it would normally be a standard action, you can do it as a move action.", "prerequisites": "", "level_requirement": 6}, "staggering shot": {"title": "Staggering Shot", "body": "For your debilitating trick, you can attempt to stagger your target. The target must succeed at a Fortitude save or be staggered until the beginning of your next turn. Once you’ve used this ability to attempt to stagger a creature, that creature is immune to your staggering shot for 24 hours.", "prerequisites": "", "level_requirement": 6}, "stalwart": {"title": "Stalwart", "body": "If you succeed at a Fortitude save against an effect that normally requires multiples successful saves to cure (such as a disease or poison), that effect immediately ends and is cured with a single successful save.", "prerequisites": "", "level_requirement": 6}, "sure-footed": {"title": "Sure-Footed", "body": "You move at your full speed when moving over difficult terrain, and without penalty when using Acrobatics or Stealth at your full speed.", "prerequisites": "", "level_requirement": 6}, "uncanny shooter": {"title": "Uncanny Shooter", "body": "Your ranged attacks with small arms do not provoke attacks of opportunity.", "prerequisites": "", "level_requirement": 6}, "cloaking field": {"title": "Cloaking Field", "body": "You can bend light around yourself and muffle any minor sounds you make, allowing you to nearly vanish when not moving. Even when you move, you appear only as an outline with blurry features. This cloaking field doesn’t make you invisible, but it does make it easier to sneak around. Activating the cloaking field is a move action. While the cloaking field is active, you can use Stealth to hide, even while being directly observed and with no place to hide. Attacking doesn’t end the cloaking field, but it does end that particular attempt to hide. If you remain perfectly still for at least 1 round, you gain a +10 bonus to Stealth checks (which doesn’t stack with invisibility) until you move.\r\n\r\nYour cloaking field lasts for up to 10 rounds before it becomes inactive. While inactive, the cloaking field recharges automatically at the rate of 1 round of cloaking per minute.", "prerequisites": "", "level_requirement": 10}, "deactivating shot": {"title": "Deactivating Shot", "body": "For your debilitating trick, you can attempt to temporarily suppress one magic item or deactivate one weapon, piece of equipment, or armor upgrade worn or carried by the target. Roll 1d20 + your operative level; the DC is equal to 10 + the item level. If you succeed, you deactivate the device (or suppress the item’s magical properties) until the beginning of your next turn. The device’s owner can spend a move action and attempt an Engineering check (for technological devices) or a Mysticism check (for magic items) against your operative exploit DC to try to reactivate the device.\r\n\r\nYou can instead use this debilitating trick to temporarily deactivate a construct that has either the magical subtype (such as a golem) or the technological subtype (such as a robot). You don’t need to attempt a check, but the creature can attempt a Fortitude save to negate the debilitating effect. If it fails, it’s stunned until the beginning of your next turn. Once you’ve used this ability to attempt to deactivate a construct, that creature is immune to your deactivating shot for 24 hours.", "prerequisites": "", "level_requirement": 10}, "elusive hacker": {"title": "Elusive Hacker", "body": "Your hacking skills make your code incredibly difficult for countermeasures to pin down. Whenever you would trigger a system’s countermeasure while hacking the system, there is a 50% chance that you manage to elude the countermeasure and it doesn’t trigger. You still haven’t disarmed the countermeasure, and it might trigger in the future.", "prerequisites": "", "level_requirement": 10}, "ever vigilant": {"title": "Ever Vigilant", "body": "You’ve been on enough solo missions to know that you can’t let your guard down, even while sleeping. You take no penalties to Perception checks for being asleep, though you still can’t succeed at purely visual Perception checks while asleep. You can always act on the surprise round, though if you choose to do so when you would otherwise be surprised, you use your initiative result or the initiative result of the first creature that would have surprised you – 1, whichever is lower.", "prerequisites": "", "level_requirement": 10}, "glimpse the truth": {"title": "Glimpse the Truth", "body": "By picking up on subtle clues and hidden traces in your immediate surroundings, you can see things as they really are. As a full action, you can spend 1 Resolve Point to gain the effects of true seeing for 1 round with a range of 60 feet.", "prerequisites": "", "level_requirement": 10}, "holographic distraction": {"title": "Holographic Distraction", "body": "As a standard action, you can spend 1 Resolve Point to create a single holographic duplicate or psychic projection of yourself that moves away from you for 1 round per operative level. The double climbs walls, jumps across pits, or simply passes through obstacles, moving at twice your speed in one direction indicated by you when the ability is activated. Its course cannot be changed. Those who interact with the double can attempt a Will save to recognize that it is not real. You must have the holographic clone exploit to learn this exploit.", "prerequisites": "", "level_requirement": 10}, "improved evasion": {"title": "Improved Evasion", "body": "When you fail a Reflex save against an effect that has a partial effect on a successful save, you take the partial effect instead of the full effect. You must have evasion to learn this exploit.", "prerequisites": "", "level_requirement": 10}, "improved uncanny mobility": {"title": "Improved Uncanny Mobility", "body": "When you use the trick attack action or take a standard action to move up to your speed, your movement doesn’t provoke attacks of opportunity. You still provoke attacks of opportunity normally when making ranged attacks or casting spells. You must have the uncanny mobility exploit to learn this exploit.", "prerequisites": "", "level_requirement": 10}, "master of disguise": {"title": "Master of Disguise", "body": "You can take on the appearances of other creatures and even specific individuals. This functions as the quick disguise exploit, but the duration increases to 10 minutes per operative level. Alternatively, for 1 minute per operative level, you can take on the appearance of a specific individual that you have seen before. If you have heard the individual talk and can speak her language, you can also modulate your speech to match hers. This disguise is so convincing that creatures familiar with the individual must succeed at a Will saving throw before they can attempt a Perception check to pierce the disguise. You must have the quick disguise exploit to learn this exploit.", "prerequisites": "", "level_requirement": 10}, "stunning shot (ex)": {"title": "Stunning Shot (Ex)", "body": "For your debilitating trick, you can try to stun your target. The target must succeed at a Fortitude save or be stunned until the start of your next turn. Once you’ve used this ability to try to stun a creature, it’s immune to your stunning shot for 24 hours. You must have the staggering shot exploit to learn this exploit.", "prerequisites": "", "level_requirement": 10}, "versatile movement": {"title": "Versatile Movement", "body": "You gain a climb speed and a swim speed equal to your land speed. This speed is not increased by the quick movement class feature or improved quick movement exploit.", "prerequisites": "", "level_requirement": 10}, "efficient cloaking field": {"title": "Efficient Cloaking Field", "body": "Your cloaking field lasts for up to 100 rounds (10 minutes), and it recharges at the rate of 2 rounds of cloaking per minute while inactive. You can spend 1 Resolve Point as a move action to recharge 20 rounds immediately, and you can do this even while the cloaking field is active. You must have the cloaking field exploit to learn this exploit.", "prerequisites": "", "level_requirement": 14}, "knockout shot": {"title": "Knockout Shot", "body": "For your debilitating trick, you can attempt to knock the target out in one blow. The target must succeed at a Fortitude save or fall unconscious for 1 minute. Once you’ve used this ability to attempt to knock a creature out, that creature is immune to your knockout shot for 24 hours. You must have the staggering shot and stunning shot exploits to learn this exploit.", "prerequisites": "", "level_requirement": 14}, "multiattack mastery": {"title": "Multiattack Mastery", "body": "When you use triple attack or quad attack to attack the same target with all of your attacks, after your full attack is complete, if at least two of your attacks hit, you can apply a debilitating trick to the target.", "prerequisites": "", "level_requirement": 14}, "uncanny senses": {"title": "Uncanny Senses", "body": "Your enhanced senses grow even more discerning. Your blindsense becomes blindsight with a range of 60 feet. If you have darkvision, its range increases by 30 feet. You must have the enhanced senses exploit to learn this exploit.", "prerequisites": "", "level_requirement": 14}, "skill adept": {"title": "Skill Adept", "body": "As part of the process that led you to become a solarian, you gained additional insight and training. Choose two additional skills and add them to your list of class skills.", "prerequisites": "", "level_requirement": 1}, "solar manifestation": {"title": "Solar Manifestation", "body": "At 1st level, you gain a physical manifestation of your stellar power. The base form of your solar manifestation, when not actively in use, is a mote of stellar energy slightly smaller than your fist that hovers near your head. Beyond the solar mote, your manifestation can take one of two additional forms: armor or a weapon. You must pick one solar manifestation (either armor or a weapon) upon taking your first level of solarian. You also choose whether your solar manifestation (in any form) either glows brightly with one color common to stars (including blue, red, white, or yellow) or is the perfect darkness of a black hole. A glowing solar manifestation, regardless of its form, sheds dim light in a 20-foot radius. You can shut off the light or darkness as a standard action in order to blend in or assist in stealth, but whenever you enter a stellar mode (see page 102), the glow or darkness returns immediately. Once made, these choices cannot be changed.\r\n\r\nOnly you can interact with your solar manifestation, whether in mote, armor, or weapon form. No other creature or effect can affect your solar manifestation in any way, including disarming or sundering it.\r\n\r\n### Solar Armor\r\nYou can form your solar mote into a suit of armor made out of stellar energy that outlines your body. This armor appears to be made out of glowing light or solid darkness, as determined by the appearance of your solar manifestation, but it can take whatever general shape you choose, whether glowing armored plates of solidified stellar energy, a form-fitting suit of crackling energy, or an aura of stellar plasma. Your solar armor’s general design has no impact on its function and doesn’t give the armor any special abilities. Once you’ve selected the general design, you can’t change it until you gain a new solarian level.\r\n\r\nYour solar armor grants you a +1 enhancement bonus to both your Kinetic Armor Class and your Energy Armor Class. This bonus increases to +2 at 10th level. It is compatible with light armor, but it gives you no benefit if you’re wearing heavy armor.At 5th level, you also gain energy resistance 5 while your solararmor is active. You can choose either cold resistance or fireresistance when you activate the armor, and can switch energytypes as a move action. This energy resistance increases by 5 at10th level and every 5 levels thereafter.\r\n\r\nForming or dismissing solar armor is a move action.\r\n\r\n### Solar Weapon\r\nYou can seize your solar mote in one hand to form a melee weapon out of stellar energy. This weapon appears to be made out of glowing light or solid darkness, as determined by the appearance of your solar manifestation, but it can be whatever general shape you choose. Normal melee weapons like axes, swords, and spears are most common, but other shapes, such as a large rune of stellar energy, a mass of writhing energy tendrils, or an energized fist that fits over your own hand, are possible as well. Your solar weapon’s general design has no impact on its function, and doesn’t give the weapon any special abilities such as reach. Once you’ve selected the general design, you can’t change it until you gain a new solarian level.\r\n\r\nYour solar weapon functions as a one-handed kinetic advanced melee weapon, and you’re automatically proficient with it. At 1st level, choose whether your solar weapon deals bludgeoning, piercing, or slashing damage. You can change the damage type each time you gain a new solarian level. Your solar weapon deals damage equal to 1d6 + your Strength modifier. This damage increases by 1d6 at 6th level, 9th level, 12th level, and every level thereafter. Solarian weapon crystals (see page 170) can increase your solar weapon’s damage.\r\n\r\nForming or dismissing a solar weapon is a move action that takes the same amount of effort as drawing or sheathing a weapon (and can be combined with a move as a single move action or used with the Quick Draw feat). Your solar weapon is automatically dismissed if it ever leaves your hand.", "prerequisites": "", "level_requirement": 1}, "stellar mode": {"title": "Stellar Mode", "body": "The stellar forces you call on are attuned to either photons (representing the power of stars to emit heat, light, and plasma) or gravitons (representing the power of stars to attract and imprison objects through gravity). The ultimate expression of photon power is the supernova, when all of a star’s energy is exerted outward, while the ultimate expression of graviton power is the black hole, where gravity is so strong that nothing, not even light, can escape it. The balance between these two opposing cosmic forces is the source of your power, and your stellar mode represents the strength of your connection with one or both of these forces—a relationship that shifts from one moment to the next as you use your stellar revelations.\r\n\r\nWhen in battle, you enter a state of metaphysical alignment with cosmic forces. At the start of your first turn in combat, if you are conscious, you must choose one of three stellar modes: graviton, photon, or unattuned (see below).\r\n\r\nAt the start of each subsequent turn of combat, you must choose to either stay in your current stellar mode or to become unattuned. If you choose to stay in your mode, you gain another attunement point for that mode. As long as you have 1 or 2 attunement points in a mode, you are attuned to that mode. Once you reach 3 attunement points in a mode, you become fully attuned to that mode. Some of your stellar revelations are zenith revelations, which can be used only when you’re fully attuned to one mode or the other. When you are fully attuned, you cannot gain more points in your mode, but you stay fully attuned until combat ends, your stellar mode ends, or you become unattuned. If you choose to become unattuned, you lose all attunement points you’ve accrued so far. At the start of your next turn, you can enter a new stellar mode or stay unattuned.\r\n\r\nAt the end of combat, your stellar mode ends. If you fall unconscious during an encounter, you become unattuned. If you regain consciousness while still under threat, you can enter a stellar mode on your first turn after regaining consciousness, as if it were the first round of combat; if combat ends before you regain consciousness, your stellar mode ends. If you are not in a stellar mode, for any reason, you are considered unattuned for the purposes of your stellar revelations.\r\n\r\nWhen you’re not in combat, you can’t enter a stellar mode. This ability manifests only in high-stakes situations, when your training takes over and connects your mind to the universe. There needs to be some risk to you for your stellar mode to activate, so you must be facing a significant enemy (see page 242). If there’s any doubt about whether you’re in combat or able to access your stellar mode, the GM decides. This also means that your stellar mode might end before what was previously a dangerous battle is over, once all that remains are dregs that don’t pose a real threat to you.\r\n\r\n### Photon Mode\r\nWhen you enter photon mode, you gain 1 photon attunement point and become photon-attuned. Some of your stellar revelations are photon powers and get stronger if you’re photon-attuned. While photon-attuned, you gain a +1 insight bonus to damage rolls (including damage rolls for your stellar powers). This bonus increases by 1 for every 6 solarian levels you have.\r\n\r\n### Graviton Mode\r\nWhen you enter graviton mode, you gain 1 graviton attunement point and become graviton-attuned. Some of your stellar revelations are graviton powers and get stronger if you’re graviton-attuned. While graviton-attuned, you gain a +1 insight bonus to Reflex saves. This bonus increases by 1 for every 9 solarian levels you have.\r\n\r\n### Unattuned\r\nWhile unattuned, you gain no attunement points and you are neither photon-attuned nor graviton-attuned. You gain no benefits while unattuned.", "prerequisites": "", "level_requirement": 1}, "stellar revelation": {"title": "Stellar Revelation", "body": "As you gain experience, you uncover new secrets about the powers of energy, gravity, stars, and other fundamental sources of cosmic power that grant you the ability to channel these forces and manifest potent preternatural powers. At 1st level, you automatically learn the black hole and supernova stellar revelations. At 2nd level and every 2 levels thereafter, you learn an additional stellar revelation. You cannot select the same stellar revelation more than once unless it says otherwise. You can choose any stellar revelations you wish, but if you have more photon revelations than graviton revelations, or vice versa, it is more difficult to become fully attuned in either mode (see _Disproportionate Revelations_). The list of stellar revelations begins on _Stellar Revelations_.\r\n\r\nStellar revelations normally note what kind of action they require. If a stellar revelation does not note the kind of action it takes and it modifies some other action (such as an attack or skill check), it can be used as part of that action. If a stellar revelation allows a saving throw to resist its effects, the DC is equal to 10 + half your _solarian_ level + your _Charisma_ modifier. A revelation that says it lasts for 1 round or until you leave the associated mode lasts for whichever of these durations is longer. You can use stellar revelations both in and out of combat, but since you can’t enter a _stellar mode_ outside of battle, any revelation that lasts for 1 round or as long as you’re in a _stellar mode_ lasts only 1 round if you’re not in combat.", "prerequisites": "", "level_requirement": 1}, "sidereal influence": {"title": "Sidereal Influence", "body": "You can tap into stellar forces outside of battle, using the properties of gravitons or photons to affect your skill use. At 3rd level, choose two skills from the lists below, one from the graviton list and one from the photon list. At 11th level and again at 19th level, choose two more skills. Each time you pick skills, choose one from the graviton list and one from the photon list.\r\n\r\nTo use your sidereal influence, you must spend 1 minute in meditation, then choose either graviton skills or photon skills. When attempting a skill check with one of your selected skills of the chosen type (either graviton or photon), you can roll 1d6 and add the result as an insight bonus to your check. This ability lasts until you enter combat, fall unconscious, sleep, or meditate again to choose a different skill type. You can reactivate this ability by meditating again for 1 minute.\r\n\r\n* **Graviton Skills:** Bluff (Cha), Disguise (Cha), Mysticism (Wis), Sense Motive (Wis), Stealth (Dex)\r\n* **Photon Skills:** Culture (Int), Diplomacy (Cha), Intimidate (Cha), Medicine (Int), Survival (Wis)", "prerequisites": null, "level_requirement": 3}, "flashing strikes": {"title": "Flashing Strikes", "body": "Your mastery of melee combat allows you to make multiple attacks more accurately. When making a full attack entirely with melee weapons, you take a –3 penalty to each attack roll instead of the normal –4 penalty.", "prerequisites": "", "level_requirement": 7}, "zenith revelations": {"title": "Zenith Revelations", "body": "At 9th level and again at 17th level, you gain two powerful stellar revelations. Choose two revelations from the zenith revelations list: one graviton revelation and one photon revelation. The list of zenith revelations begins on page 107.\r\n\r\nZenith revelations are powerful stellar revelations that require you to be fully attuned in a stellar mode. After using a zenith revelation, your stellar mode immediately becomes unattuned.", "prerequisites": "", "level_requirement": 9}, "miniature star": {"title": "Miniature Star", "body": "When you’re fully photon-attuned, you can create a simulacrum of a star as a standard action. The star is a 10-foot-radius sphere that fills your square (or one square of your space, if you’re larger than Medium) and all squares within 5 feet of that space. Any creature that starts its turn in the same space as the star takes 1d6 fire damage for every 2 solarian levels you have, and any creature that starts its turn outside the star but within 5 feet of it takes half that damage. At 17th level, you can create your star simulacrum as a 15-foot-radius sphere that affects your square and all squares within 10 feet of that space (a total of 21 squares).\r\n\r\nCreatures can move through the star, but it exerts a gravitational pull, and any creature inside it or within 5 feet of it must spend twice as much movement for each square of movement that takes it away from the center of the star. The star remains for 1d4+1 rounds, and stays in place even if you later move. You are immune to all effects of your own miniature star.", "prerequisites": "Zenith Revelations", "level_requirement": null}, "ray of light": {"title": "Ray of Light", "body": "When you’re fully photon-attuned, as a move action, you can transform yourself into a ray of light and move at light speed to any space you can see within long range. Any barrier that would block, reflect, or scatter light prevents you from moving through it. No creature can use a reaction to interfere with your movement or make attacks of opportunity against you unless it’s capable of reacting faster than the speed of light. At 17th level, you can touch one willing or unconscious creature to convert it to light and bring it with you as part of the same action.", "prerequisites": "Zenith Revelations", "level_requirement": null}, "solar acceleration": {"title": "Solar Acceleration", "body": "When you’re fully photon-attuned, you can make a full attack as a standard action. In addition, you and up to six allies within 30 feet are affected by haste (see page 358) for 1 minute after you use this revelation. At 17th level, the extra speed from the haste effect increases to 60 feet (to a maximum of three times the creature’s normal speed).", "prerequisites": "Zenith Revelations", "level_requirement": null}, "starquake": {"title": "Starquake", "body": "When you’re fully graviton-attuned, you can create a violent ripple of movement to knock down your foes. As a move action, you can move up to your speed along the ground without provoking attacks of opportunity. Each creature you are adjacent to at any point during that movement takes 1d8 bludgeoning damage and must succeed at a Reflex save or be knocked prone. The affected creatures don’t need to be standing on solid ground to fall prone, and any that were in the air (but still adjacent to you) fall to the ground on a failed save. The damage increases by 1d8 for every 3 solarian levels you have beyond 7th. At 17th level, you can move up to twice your speed along the ground with this revelation.", "prerequisites": "Zenith Revelations", "level_requirement": null}, "time dilation": {"title": "Time Dilation", "body": "When you’re fully graviton-attuned, you can make time pass more slowly for your enemies. As a standard action, you can project a gravitational wave in a 30-foot cone. You choose which creatures in the cone are affected and which ones aren’t. Each target must succeed at a Fortitude save or by affected by slow (see page 377) for a number of rounds equal to your solarian level. At 17th level, even targets that succeed at their saving throws are affected by slow for 1 round.", "prerequisites": "Zenith Revelation", "level_requirement": null}, "wormholes": {"title": "Wormholes", "body": "When you’re fully graviton-attuned, you can create two linked wormholes as a standard action. One wormhole must be adjacent to you, and the other appears anywhere in line of sight within medium range (100 feet + 10 feet per solarian level). Each wormhole is 5 feet across and appears at an intersection between two squares. You and any Large or smaller creatures you mentally designate (you can designate “all creatures,” “all lashuntas,” or similar categories) can travel between the wormholes. This is considered extradimensional travel. Entering a wormhole instantly transports a creature to a square adjacent to the other wormhole’s intersection, where the creature can continue its movement. The wormholes remain for 1 round for every 2 solarian levels you have. At 17th level, you can create three wormholes using this ability, and upon entering the wormhole, a creature can decide which of the other two wormholes to exit.", "prerequisites": "Zenith Revelation", "level_requirement": null}, "solarian's onslaught": {"title": "Solarian's Onslaught", "body": "When making a full attack, you can make up to three attacks instead of two attacks. You take a –6 penalty to these attacks instead of a –4 penalty. If you have the flashing strikes class feature, you instead take a –5 penalty to these attacks as long as they are all melee attacks.", "prerequisites": null, "level_requirement": 13}, "stellar paragon": {"title": "Stellar Paragon", "body": "You are the spiritual kin of the stars themselves. As a move action, you can raise or lower light levels within 30 feet of yourself by one step. When you enter a stellar mode, you gain 2 attunement points of the corresponding type immediately and are considered attuned, and when you keep your current stellar mode at the start of your turn, you can gain 2 attunement points instead of 1, allowing you to become fully attuned after 2 rounds.\r\n\r\nIn addition, you can spend 1 Resolve Point to gain enough attunement points to be fully attuned on the first round of combat (but not after using a zenith revelation), or spend 1 Resolve Point at the start of your turn in combat to exchange all of your attunement points in one stellar mode for an equal number of attunement points in the other mode. For example, you can switch from being fully attuned in graviton mode to being fully attuned in photon mode.", "prerequisites": "", "level_requirement": 20}, "black hole": {"title": "Black Hole", "body": "When you’re fully graviton-attuned, as a standard action, you can pull any number of creatures within 20 feet of you closer. You choose which creatures are affected and which ones aren’t. Each target must succeed at a Fortitude save or be pulled 10 feet toward you. The range of this revelation and the distance pulled increase by 5 feet at 5th level and every 4 levels thereafter. Solid objects do not block this ability, but any creature that runs into a solid object ceases moving closer to you. Creatures moved by this ability do not provoke attacks of opportunity from this movement. After you use this revelation, you immediately become unattuned. Black hole functions as a zenith revelation for the purposes of abilities that reference them.", "prerequisites": "", "level_requirement": 1}, "supernova": {"title": "Supernova", "body": "When you’re fully photon-attuned, as a standard action, you can deal 1d6 fire damage plus 1d6 additional fire damage per solarian level to all creatures within 10 feet of you. A creature that succeeds at a Reflex save takes half damage. At 9th level, you can increase the radius to 15 feet, and at 17th level, you can increase the radius to 20 feet. After you use this revelation, you immediately become unattuned. Supernova functions as a zenith revelation for the purposes of abilities that reference them.", "prerequisites": "", "level_requirement": 1}, "dark matter": {"title": "Dark Matter", "body": "As a move action, you can draw on the properties of dark matter to increase your density, allowing you to resist physical damage. You gain damage reduction 1/—. This increases to DR 2/— at 6th level and increases by 1 again every 3 solarian levels thereafter. This benefit lasts for 1 round or until you leave graviton mode.\r\n\r\nWhen you are attuned or fully attuned, your DR from dark matter is equal to half your solarian level.", "prerequisites": "", "level_requirement": 2}, "flare": {"title": "Flare", "body": "As a move action, you can shed light in a 30-foot radius for 1 minute. You choose dim, normal, or bright light each time you activate this revelation. As a standard action, you can create a flash of brilliant light, forcing one creature within 30 feet to succeed at a Reflex save or be blinded for 1 round. Once you’ve targeted a creature with flare, you can’t target it with this revelation again for 10 minutes. Blind or sightless creatures are not affected by this use of this revelation.\r\n\r\nWhen you create a flash of light as a standard action and you are attuned or fully attuned, you can instead choose to make all enemies within range dazzled for 1 round (no save).", "prerequisites": "", "level_requirement": 2}, "gravity anchor": {"title": "Gravity Anchor", "body": "As a move action, you can form a gravitational bond between yourself and either the surface you’re standing on or the objects you are holding. This grants you a +4 bonus to your AC against bull rush, reposition, and trip combat maneuvers if you choose the surface underfoot, or against disarm combat maneuvers if you choose objects. The bonus lasts for 1 round or until you leave graviton mode. You can have only one gravity anchor active at a time.\r\n\r\nWhen you are attuned or fully attuned, you can activate this revelation as a reaction when targeted by a bull rush, disarm, reposition, or trip combat maneuver, in which case it defends against only that attack.", "prerequisites": "", "level_requirement": 2}, "gravity boost": {"title": "Gravity Boost", "body": "You can increase or reduce the gravitational attraction between yourself and the terrain around you. You can add a bonus equal to one-third your solarian level (minimum +1) to Athletics checks to climb, jump, or swim as part of the action you take to attempt the skill check. In addition, as a reaction when you are falling, you can reduce the falling damage you take by half. At 6th level, you can move along vertical surfaces and even upside down along ceilings for 1 round. This functions as spider climb, but it leaves your hands free and you can also run. You must end your movement on a surface that can support you normally. If you end your movement while you are standing on a vertical surface or ceiling, you fall unless you succeed at an Athletics check to climb to remain in position.\r\n\r\nWhen you are attuned or fully attuned, the bonus you gain from this revelation to checks to climb, jump, or swim doubles.", "prerequisites": "", "level_requirement": 2}, "gravity hold": {"title": "Gravity Hold", "body": "This revelation allows you to move objects at a distance as per psychokinetic hand (see page 370).\r\n\r\nWhen you are attuned or fully attuned, you can use the psychokinetic hand ability of your gravity hold to immobilize, lift, or move a Medium or smaller creature. The creature can attempt a Fortitude save to negate the effect. While under this effect, the target creature cannot move, but can take any other normal actions. This ability follows all of the restrictions of the spell other than the weight limit, but you can’t lift a creature higher than 5 feet off the ground. When you spend a standard action concentrating to maintain the gravity hold, the target can attempt a new save to end the effect. Once a creature successfully saves against this ability, it becomes immune to further uses of this revelation for 24 hours.", "prerequisites": "", "level_requirement": 2}, "plasma sheath": {"title": "Plasma Sheath", "body": "As a move action, you can cause all of your melee attacks to deal fire damage instead of their normal damage type. (The attacks are still made against the target’s EAC or KAC as normal for the weapon.) This benefit lasts for 1 round or until you leave photon mode.\r\n\r\nWhen you are attuned or fully attuned, your attacks with plasma sheath deal additional fire damage equal to half your level.", "prerequisites": "", "level_requirement": 2}, "radiation": {"title": "Radiation", "body": "As a standard action, you can emit an aura of low-level radiation. Creatures within 5 feet of you must succeed at a Fortitude save or be sickened. A sickened creature recovers as soon as it moves out of your aura, and a creature that succeeds at its saving throw is immune to your radiation for 24 hours. This is a poison effect (see page 415). The radiation lasts for 1 round or until you leave photon mode.\r\n\r\nWhen you are attuned or fully attuned, the size of your aura increases to 10 feet.", "prerequisites": "", "level_requirement": 2}, "stellar rush": {"title": "Stellar Rush", "body": "As a standard action, you can wreathe yourself in stellar fire and make a charge without the penalties (see page 248).\r\n\r\nWhen you are attuned or fully attuned, you can substitute a bull rush for the melee attack at the end of the charge. Whether or not you succeed at the bull rush, the target takes 2d6 fire damage (Reflex half). This damage increases by 1d6 at 6th level and every 2 levels thereafter.", "prerequisites": "", "level_requirement": 2}, "astrologic sense": {"title": "Astrologic Sense", "body": "You can sense the movement of all objects influencing you to gain insight into upcoming events. Once per day as a full action, you can try to determine whether a particular action of yours will bring good or bad results for you in the immediate future. This functions as augury (see page 340) with your effective caster level equal to your solarian level. You can spend 1 Resolve Point to use this revelation again on the same day, but you still can’t use it more than once per hour.\r\n\r\nWhen you are attuned or fully attuned, you can see 1 hour into the future (instead of half an hour as is normal for augury) when you use this revelation.", "prerequisites": "", "level_requirement": 6}, "blazing orbit": {"title": "Blazing Orbit", "body": "As a move action, you can move up to your speed, gaining concealment against any attack made against you during the move, and you can leave a trail of flames in every square you pass through. The flames last for 1 round and deal 2d6 fire damage to anyone who moves into them. You can’t move through another creature’s space during this movement. If you use blazing orbit again, any flames you previously created with it go out. The damage from the flames increases by 1d6 at 8th level and every 2 levels thereafter.\r\n\r\nWhen you are attuned or fully attuned, any creature damaged by the flames also gains the burning condition (1d6 fire damage; see page 273).", "prerequisites": "", "level_requirement": 6}, "corona": {"title": "Corona", "body": "As a standard action, you can surround your body with an envelope of fiery plasma. You gain cold resistance 10, and any adjacent creature that hits you with a natural weapon or a melee weapon takes 2d6 fire damage. The corona lasts for 1 round or until you leave photon mode. At 12th level, the damage increases to 3d6 and the cold resistance increases to 15. At 18th level, the damage increases to 4d6 and the cold resistance increases to 20.\r\n\r\nWhen you are attuned or fully attuned, any creature that starts its turn adjacent to you while your corona is in effect takes fire damage equal to half your solarian level.", "prerequisites": "", "level_requirement": 6}, "crush": {"title": "Crush", "body": "As a standard action, you can increase the effects of gravity on the internal organs or workings of a target within 30 feet, causing it to have difficulty maintaining its normal functionality. The target must succeed at a Fortitude save or become staggered for 1 round. This revelation also affects constructs. You can maintain this effect as a move action each round, but the target can attempt a new saving throw each round to end the effect. Once a creature succeeds at this save or the effect ends, you can’t target that creature with crush again for 24 hours.\r\n\r\nWhen you are attuned or fully attuned, you can spend 1 Resolve Point to also stun the target for 1 round. Maintaining crush on subsequent rounds extends the staggered effect, but not the stunned effect.", "prerequisites": "", "level_requirement": 6}, "defy gravity": {"title": "Defy Gravity", "body": "As a move action, you can fly up to your speed. You must end this movement on solid ground or you fall. At 12th level or higher, you don’t have to land if you immediately follow your flight with another move action to use defy gravity. On your last move action of the turn, you still have to land or fall.\r\n\r\nWhen you are attuned or fully attuned, your fly speed from this revelation increases by 10 feet.", "prerequisites": "", "level_requirement": 6}, "glow of life": {"title": "Glow of Life", "body": "As a move action, you can spend 1 Resolve Point to recover a number of Hit Points equal to twice your solarian level. Once you use this revelation, you can’t use it again until the next time you regain Stamina Points after a 10-minute rest.\r\n\r\nWhen you are attuned or fully attuned, increase the amount you heal with this revelation to three times your solarian level.", "prerequisites": "", "level_requirement": 6}, "gravity surge": {"title": "Gravity Surge", "body": "As a full action, you can perform a disarm or trip combat maneuver against a target within 30 feet. Use your Charisma modifier on your attack roll instead of your Strength modifier, and you gain a +4 bonus to this attack roll that doesn’t stack with the bonus from the Improved Combat Maneuver feat.\r\n\r\nWhen you are attuned or fully attuned, if you disarm a target with gravity surge and have a hand free, the dropped item flies toward you and you can snatch it from the air. If you trip a target with gravity surge, you can pull the target up to 10 feet closer to you.", "prerequisites": "", "level_requirement": 6}, "hypnotic glow": {"title": "Hypnotic Glow", "body": "As a standard action, you can convince one living creature that you are to be trusted. This functions as charm person (see page 342), but with a duration of 1 round per solarian level you have. When the effect ends, if you are out of line of sight and the target is not engaged in an activity it wouldn’t have begun without being charmed, the target does not realize it was charmed or has acted unusually unless someone else points it out. You can’t use this revelation again while you currently have a creature charmed via this ability, and once you’ve attempted to charm a creature, whether or not the attempt was successful, you can’t charm the same creature again for 24 hours. Your influence over the creature ends once the duration has expired, and at that time the target likely ceases doing anything you’ve requested of it. At 9th level, hypnotic glow functions as charm monster (see page 342).\r\n\r\nWhen you are attuned or fully attuned and you successfully charm a creature using this ability, you can also command it to approach, flee, or halt on its next turn, as per the command spell (no save; see page 343).", "prerequisites": "", "level_requirement": 6}, "reflection": {"title": "Reflection", "body": "You can reflect ranged attacks back at your enemies. If you took the total defense action on your last turn, or if you were fighting defensively and spend 1 Resolve Point, as a reaction you can redirect a ranged attack that misses you. Select a new target within 30 feet and make a ranged attack roll with a –4 penalty. If your attack hits, the new target is damaged as if it had been the intended target of the original ranged attack.\r\n\r\nWhen you are attuned or fully attuned, you don't take a –4 penalty to your redirected attack roll.", "prerequisites": "", "level_requirement": 6}, "soul furnace": {"title": "Soul Furnace", "body": "You can stoke the internal energy of your entire physiology, allowing you to boost your life processes. As a move action, you can spend 1 Resolve Point. If you are suffering from an affliction (a curse, disease, drug or poison), you can immediately attempt an additional saving throw at the affliction’s normal save DC. If you succeed at this saving throw, the affliction ends (regardless of how many successful saving throws it normally takes to end the affliction). Once you have used this revelation, you can’t use it again until the next time you regain Stamina Points after a 10-minute rest.\r\n\r\nWhen you are attuned or fully attuned, you can also use this revelation to end any one of the following conditions you have: bleeding, blinded, burning, cowering, dazzled, exhausted, fatigued, frightened, panicked, shaken, or sickened.", "prerequisites": "", "level_requirement": 10}, "stealth warp": {"title": "Stealth Warp", "body": "You can bend light, sound, and even vibrations around your body, making you harder to notice. As a move action, you can grant yourself a +4 bonus to Stealth checks. This lasts for 1 round or until you leave graviton mode.\r\n\r\nWhen you are attuned or fully attuned, you can use this revelation to reduce your sensory output so much that you can attempt a Stealth check even when you’re directly observed and lack cover or a distraction. You are not invisible, simply difficult to see clearly, and if a creature was observing you prior to your Stealth check, it remains aware of your location until you successfully reach cover or concealment. Your stealth warp ends if you make an attack or cause another creature to attempt a saving throw, or at the beginning of your next turn unless you immediately take another move action to use this revelation.", "prerequisites": "", "level_requirement": 10}, "gravity shield": {"title": "Gravity Shield", "body": "As a move action, you can create a minor shield of compressed gravity waves, granting you a +1 circumstance bonus to your AC. The shield lasts for 1 round or until you leave graviton mode.\r\nWhen you are attuned or fully attuned, as a move action, you can create a disk of massive gravitational energies that is capable of deflecting incoming attacks. Choose one edge of your space. The shield extends along three continuous edges in a straight line centered on the chosen edge. The shield provides cover against attacks coming from its far side, but not against attacks originating from the side you’re on. If you move, you can reposition your shield as part of your move action, moving it to a different edge of your space. You must use one of your hands to direct and maintain an active gravity shield. You cannot use this version of the gravity shield at the same time you use this revelation to gain a circumstance bonus to your AC. This gravity shield also lasts 1 round or until you leave graviton mode.", "prerequisites": "", "level_requirement": 14}, "sunbolt": {"title": "Sunbolt", "body": "As a standard action, you can fire a bolt of concentrated solar energy at one target within long range (400 feet + 40 feet per solarian level you have) as a ranged attack targeting the foe’s EAC. If you hit, you deal 9d6 fire damage. If you have a solarian crystal (see Solarian Weapon Crystals on page 170) that changes the type of damage dealt by a solar weapon, you can use it to change the type of damage you deal with your sunbolt. Once you have used this revelation, you can’t use it again until the next time you regain Stamina Points after a 10-minute rest.\r\n\r\nWhen you are attuned or fully attuned, you gain a +2 bonus to your ranged attack roll to use this revelation.", "prerequisites": "", "level_requirement": 14}, "ultimate graviton": {"title": "Ultimate Graviton", "body": "As your ability to manipulate powers of gravity expands, the range of any graviton revelation (but not zenith revelation) you have with a range doubles. Any graviton revelation (but not zenith revelation) you have that targets a single creature can now simultaneously target two creatures, who must be within 20 feet of each other. You also increase the power of any of the following gravity revelations you have.\r\n\r\n* **Defy Gravity:** Your fly speed increases by 20 feet.\r\n* **Gravity Anchor:** As a move action, you can gain both types of gravity anchor simultaneously.\r\n* **Gravity Boost:** Your bonus applies to all Acrobatics checks, and you take no damage from any fall.\r\n* **Reflection:** If you successfully redirect an attack as a reaction, you can continue to reflect additional attacks until the beginning of your next turn. You have a cumulative –2 penalty to your redirect attack roll on each reflection attempt after the first. If any reflected attack misses, you can’t make further redirect attempts until you use this revelation again.", "prerequisites": "", "level_requirement": 16}, "ultimate photon": {"title": "Ultimate Photon", "body": "Your ability to manipulate powers of light and energy expand greatly. The radius of any photon revelation (but not zenith revelation) you have with a radius expands by 10 feet. Any photon revelation (but not zenith revelation) that lasts for 1 round or until you leave photon mode now lasts for 1d4 rounds if you are not in photon mode. You also increase the power of any of the following photon revelations you have.\r\n\r\n* **Astrologic Sense:** You can see twice as far into the future as normal.\r\n* **Glow of Life:** You can use this revelation as a swift action, rather than a move action.\r\n* **Hypnotic Glow:** The charm’s duration doubles.\r\n* **Stellar Rush:** You gain a +2 bonus to your EAC until the beginning of your next turn.", "prerequisites": "", "level_requirement": 16}, "primary fighting style": {"title": "Primary Fighting Style", "body": "You have a preferred fighting style that represents the type of soldier you are. Each fighting style is composed of various style techniques that you learn as you gain experience. You must pick one fighting style upon taking your first soldier level, and once made, this choice cannot be changed. Descriptions of the fighting styles you can choose from appear on pages 112–115.", "prerequisites": "", "level_requirement": 1}, "primary style technique": {"title": "Primary Style Technique", "body": "At 1st level and every 4 levels thereafter, you gain a style technique unique to your primary fighting style.", "prerequisites": "", "level_requirement": 1}, "combat feat": {"title": "Combat Feat", "body": "At 2nd level and every 2 levels thereafter, you gain a bonus feat in addition to those gained from normal advancement. These bonus feats must be selected from those listed as combat feats.\r\nWhenever you gain a new bonus feat, you can also choose to replace one of the bonus feats you have already learned with a different bonus feat. The feat you replace can’t be one that was used as a prerequisite for another feat or other ability. You can change only one feat at any given level, and you must choose whether or not to swap the feat at the time you gain the new bonus feat.", "prerequisites": "", "level_requirement": 2}, "gear boost": {"title": "Gear Boost", "body": "At 3rd level and every 4 levels thereafter, you learn a trick called a gear boost that make you better with a particular type of weapon or armor. Choose from the gear boosts listed below. Some gear boosts require you to reach a certain soldier level to select them; this level is indicated in parentheses after the boost’s name.", "prerequisites": "", "level_requirement": 3}, "brutal blast": {"title": "Brutal Blast", "body": "You gain a +2 insight bonus to damage rolls with weapons that have the blast special property (such as a scattergun). This extra damage applies only to creatures within 10 feet of you; creatures farther away take the normal amount of damage. This bonus increases by 1 for every 4 soldier levels you have.", "prerequisites": "", "level_requirement": null}, "bullet barrage": {"title": "Bullet Barrage", "body": "You gain a +1 insight bonus to damage rolls for weapons in the projectile category. This bonus increases by 1 for every 4 soldier levels you have.", "prerequisites": "", "level_requirement": null}, "flash freeze": {"title": "Flash Freeze", "body": "When you hit a creature with a weapon in the cryo category, that creature’s speeds are reduced by 10 feet for 1 round, to a minimum of 10 feet.", "prerequisites": "", "level_requirement": 7}, "heavy onslaught": {"title": "Heavy Onslaught", "body": "Your attacks with heavy weapons bypass part of the target’s damage reduction. If your heavy weapon does not already overcome the target’s damage reduction, treat the target’s damage reduction as though it were 5 lower. At 15th level, treat the target’s damage reduction as 10 lower.", "prerequisites": "", "level_requirement": 11}, "laser accuracy": {"title": "Laser Accuracy", "body": "You gain a +1 insight bonus to attack rolls with weapons in the laser category.", "prerequisites": "", "level_requirement": null}, "melee striker": {"title": "Melee Striker", "body": "Add an additional bonus equal to half your Strength bonus to damage rolls with melee weapons.", "prerequisites": "", "level_requirement": null}, "powerful explosive": {"title": "Powerful Explosive", "body": "When you attack with a weapon with the explode special property and a radius of 10 feet or greater, you can increase the radius of the explosion by 5 feet.", "prerequisites": "", "level_requirement": 7}, "sonic resonance": {"title": "Sonic Resonance", "body": "When you hit a creature within 30 feet of you using a weapon in the sonic category, the sonic energy continues to resonate within that creature, giving it the flat-footed condition for 1 round. If you hit multiple creatures at the same time (such as with an automatic, blast, or explode weapon), only the creature nearest to you or to the center of the explosion (your choice if multiple creatures are equidistant) is affected.", "prerequisites": "", "level_requirement": 7}, "armored advantage": {"title": "Armored Advantage", "body": "When you are wearing armor, you gain a +1 insight bonus to your Kinetic Armor Class.", "prerequisites": "", "level_requirement": null}, "anchoring arcana": {"title": "Anchoring Arcana", "body": "As a full action, you can make a single attack with a magic weapon against a single foe. If the attack is a ranged attack, the target must be within the first range increment. Even if the attack normally affects an area or multiple targets, it affects only your selected target. If your attack hits, you can spend 1 Resolve Point to force the target to attempt a Will saving throw (DC = 10 + half your soldier level + your key ability score modifier). If the target fails its save, it can’t voluntarily move from its current space for 1d4 rounds. This has no effect on involuntary movement, but it does prevent the creature from teleporting or moving to another plane. Once you’ve struck a foe with this attack, whether it succeeds at or fails its saving throw, it is immune to this ability for 24 hours.", "prerequisites": "", "level_requirement": 7}, "electric arc": {"title": "Electric Arc", "body": "When you hit a target with a weapon in the shock category, electricity arcs out from your original target to deal electricity damage to a secondary subject within 10 feet of the original target. This damage is equal to the weapon’s level. The secondary subject must be the creature nearest to the original target (your choice if multiple creatures are equidistant).\r\n\r\nThis gear boost does not function for weapons that have the explode or blast special property. If you use this gear boost with a weapon with the arc critical hit effect (see page 182), your secondary subject for electric arc must be the same as your secondary subject for the arc critical effect.", "prerequisites": "", "level_requirement": 7}, "plasma immolation": {"title": "Plasma Immolation", "body": "You are expert at setting things on fire with plasma. If your attack roll with a weapon in the plasma category is a 19 (the d20 shows a 19), and the attack hits your target, the target gains the burning condition. The condition deals 1d4 fire damage if the weapon has an item level of 1st-6th, 1d8 if its item level is 7th-14th, and 2d8 if its item level is 15th or higher.", "prerequisites": "", "level_requirement": 7}, "secondary fighting style": {"title": "Secondary Fighting Style", "body": "You choose another fighting style. Once you choose this second style, it cannot be changed.", "prerequisites": "", "level_requirement": 9}, "secondary style technique": {"title": "Secondary Style Technique", "body": "At 9th level and every 4 levels thereafter, you gain a style technique unique to your secondary fighting style. For the purposes of these style techniques, treat your soldier level as equal to your soldier level – 8.", "prerequisites": "", "level_requirement": 9}, "soldier's onslaught": {"title": "Soldier's Onslaught", "body": "When you make a full attack, you can make up to three attacks instead of two attacks. You take a –6 penalty to these attacks instead of a –4 penalty.", "prerequisites": null, "level_requirement": 11}, "kill shot": {"title": "Kill Shot", "body": "As a standard action, you can make a single attack against an enemy. If the attack hits and does not kill your enemy, you can expend 1 Resolve Point to force the creature to succeed at a Fortitude save or die. Once you’ve used this ability on a creature (regardless of whether or not you forced it to attempt a Fortitude save), that creature is immune to your kill shot for 24 hours.", "prerequisites": "", "level_requirement": 20}, "rune of the eldritch knight": {"title": "Rune of the Eldritch Knight", "body": "You can imbue a weapon with a magic sigil, the rune of the eldritch knight, allowing the weapon to act as a magic weapon for the purposes of bypassing DR and affecting incorporeal creatures. This takes 10 minutes, and you can imbue only a single weapon at a time. If you imbue a new weapon with the rune of the eldritch knight, any previously imbued weapon loses this benefit. When calculating the Hit Points and hardness of a weapon imbued with the rune of the eldritch knight, treat its item level as 5 higher.", "prerequisites": null, "level_requirement": 1}, "secret of the magi": {"title": "Secret of the Magi", "body": "When you imbue a weapon with the rune of the eldritch knight, in addition to its normal benefits, the rune grants the weapon one of the following weapon fusions of your choice: ethereal, flaming, frost, merciful, or shock. The weapon can’t gain a fusion it already has, and this bonus fusion doesn’t count toward the maximum total level of fusions the weapon can have at once. The bonus fusion ends when the weapon ceases to be imbued with the rune of the eldritch knight. For more information on fusions, see page 191.", "prerequisites": "", "level_requirement": 5}, "power of legend": {"title": "Power of Legend", "body": "You can call on the link between you and the legendary heroes who wielded powerful magic weapons eons ago to overcome adversity. As a move action when wielding a magic weapon or a weapon imbued with the rune of the eldritch knight, you can spend 1 Resolve Point to end one of the following conditions affecting you: bleeding, burning, confused, exhausted, fatigued, flat-footed, off-target, shaken, or sickened. Alternatively, you can spend 1 Resolve Point to change the cowering condition to the frightened condition or change the frightened condition to the shaken condition. In this case, the new condition lasts for the same duration the original condition would have and can’t be further affected by this ability.", "prerequisites": "", "level_requirement": 9}, "secret of the archmagi": {"title": "Secret of the Archmagi", "body": "You can imbue two weapons with the rune of the eldritch knight. If you attempt to imbue a third weapon, the weapon infused first loses its rune and all benefits. In addition to the normal benefits, the runes grant the weapons one or more of the following weapon fusions (see page 191) of your choice: bane, corrosive, ethereal, flaming, frost, holy, merciful, shock, thundering, or unholy. You can grant no more than 10 total levels’ worth of fusions between the two weapons, and the bane fusion counts as a 10th-level fusion for this purpose.", "prerequisites": "", "level_requirement": 13}, "arcane attack": {"title": "Arcane Attack", "body": "As a standard action, you can spend 1 Resolve Point to use a weapon imbued with the rune of the eldritch knight to make an attack that strikes true. This attack ignores all cover and concealment, including total concealment (though you must at least be aware of a creature’s presence to target it with this attack). If the attack is a ranged attack, the target must be within the first range increment. The attack only affects your selected target, even if it normally affects an area or multiple targets. You still must make a normal attack roll, and if your attack misses, it has no effect.", "prerequisites": "", "level_requirement": 17}, "hammer fist": {"title": "Hammer Fist", "body": "You treat any unarmed attack you make while wearing heavy or powered armor as being made with a battleglove (see page 187) with an item level equal to or lower than your soldier level, and you calculate damage for these attacks as if you had the melee striker gear boost (see page 112). If you have the melee striker gear boost, you gain a +2 bonus to damage rolls with your unarmed attacks when using this ability. These unarmed attacks don’t benefit from other abilities that apply specifically to unarmed attacks (such as the Improved Unarmed Strike feat).", "prerequisites": "", "level_requirement": 1}, "enhanced tank": {"title": "Enhanced Tank", "body": "You gain the Powered Armored Proficiency feat and access to improved armor. This might be the result of your own engineering abilities, having earned the trust of contacts that can get you experimental equipment, or a powerful patron giving you gear not available to the general public to help you achieve mutual goals. You can add one more upgrade to your armor than its normal maximum number of upgrade slots. If you add this bonus upgrade to heavy armor, you can select an upgrade normally limited to powered armor. An upgrade placed in this bonus slot costs half the normal credit amount.", "prerequisites": "", "level_requirement": 5}, "smash through": {"title": "Smash Through", "body": "While you are wearing heavy armor or powered armor, you gain a +4 bonus to attack rolls to perform a bull rush combat maneuver (see page 246). If you successfully push the target back 10 feet or more, you can also damage the target with an unarmed attack (and can use your hammer fist ability when doing so).", "prerequisites": "", "level_requirement": 9}, "mobile army": {"title": "Mobile Army", "body": "You become a master of all weapons associated with your armor. You deal 1d6 additional damage with any attack from a weapon that is part of your armor, including unarmed attacks using the hammer fist ability and weapons that have been attached to your armor as an armor upgrade. The additional damage is of the same type as the weapon’s normal type. Also, while wearing heavy or powered armor, you gain a +2 bonus to your KAC against combat maneuvers.", "prerequisites": "", "level_requirement": 13}, "on the bounce": {"title": "On the Bounce", "body": "You learn to control your armor with such ease, you are actually more maneuverable in it than out of it. While wearing heavy armor or powered armor, you can move up to your speed when you make a full attack. You can move before or after all your attacks, but not both. If you have the Shot on the Run feat, you can divide your movement to move both before and after making a full attack as long as all the attacks are ranged attacks. If you have the Spring Attack feat, you can divide your movement to move both before and after making a full attack as long as all the attacks are melee attacks. If you have both feats, your attacks can be any combination of melee and ranged attacks.", "prerequisites": "", "level_requirement": 17}, "charge attack": {"title": "Charge Attack", "body": "As a standard action, you can make a charge without the charge penalties (see page 248), and you can substitute a bull rush for the melee attack at the end of the charge. When you gain the soldier’s onslaught class feature, you can make two attacks instead of one at the end of your charge, both with a –4 penalty.", "prerequisites": "", "level_requirement": 5}, "keep fighting": {"title": "Keep Fighting", "body": "As a move action, you can spend 1 Resolve Point to regain Stamina Points equal to 2d6 + your soldier level. You can’t use this ability again until after you regain Stamina Points from a 10-minute rest. The number of Stamina Points you regain increases by 1d6 at 10th level, 15th level, and 20th level.", "prerequisites": "", "level_requirement": 9}, "perfect opportunity": {"title": "Perfect Opportunity", "body": "When you hit a creature with an attack of opportunity, that creature can’t move out of the squares you threaten until the start of its next turn. In addition, when an enemy takes a guarded step (see page 247) out of a square you threaten, you can make an attack of opportunity against it with a –2 penalty to the attack roll. If the target provoked an attack of opportunity by moving, hitting with your attack of opportunity ends the target’s movement immediately, preventing it from carrying out the rest of its movement.", "prerequisites": "", "level_requirement": 13}, "against the odds": {"title": "Against the Odds", "body": "You gain a bonus to melee damage rolls equal to double the number of enemies within 10 feet of you. Enemies who don’t constitute a significant threat (those with a CR equal to your level – 4 or less, or as determined by the GM) don’t count when calculating this bonus.", "prerequisites": "", "level_requirement": 17}, "rapid response": {"title": "Rapid Response", "body": "You gain a +4 bonus to initiative checks and increase your land speed by 10 feet.", "prerequisites": "", "level_requirement": 1}, "heavy fire": {"title": "Heavy Fire", "body": "You can use your physical power to steady your weapon and make your attacks more dangerous. As a full action, you can make a single ranged attack that deals additional damage equal to your Strength bonus to all targets. You can use this ability in conjunction with the automatic, explode, or unwieldy special property (see pages 180–182).", "prerequisites": "", "level_requirement": 5}, "explosives acumen": {"title": "Explosives Acumen", "body": "You increase the DC to avoid attacks you make using weapons with the explode special property by 1. You reduce the amount of any damage you take from any weapon with the explode special property by an amount equal to your Strength bonus.", "prerequisites": "", "level_requirement": 13}, "debilitating attack": {"title": "Debilitating Attack", "body": "When you hit an enemy with a ranged attack or an attack with a weapon with the blast or explode special property, you can spend 1 Resolve Point to inflict a debilitating effect on that enemy for a number of rounds equal to your Strength bonus. You can choose to make the target deafened, flat- footed, or off-target (see pages 275–277), or to reduce its speeds by half (to a minimum of 10 feet). The target can negate this effect with a successful Fortitude save (DC = 10 + half your soldier level + your Strength modifier).", "prerequisites": "", "level_requirement": 9}, "grenade expert": {"title": "Grenade Expert", "body": "You increase the range increment of your thrown grenades by 5 × your Strength bonus. In addition, you’re able to salvage enough materials to create a grenade without paying for it. Creating a grenade takes 10 minutes. You can create any grenade whose item level is less than or equal to your soldier level, but this grenade is unstable and only you can use it effectively. If anyone else tries to use the grenade, it is a dud. You can have only one grenade created by this ability at one time (if you create a new grenade using this ability, the old grenade no longer works).", "prerequisites": "", "level_requirement": 1}, "impactful attack": {"title": "Impactful Attack", "body": "As a full action, you can make a ranged attack that knocks enemies back. Targets you hit are knocked back 5 feet from you. If you use a weapon with the explode special property, all targets that fail their saving throws are instead knocked back 5 feet from the center of the explosion. An enemy that you critically hit or that rolls a natural 1 on its saving throw is also knocked prone. You can’t make an impactful attack with an automatic weapon, but you can use this ability with a weapon that has the blast special property.", "prerequisites": "", "level_requirement": 17}, "rapid recovery": {"title": "Rapid Recovery", "body": "You can spend Resolve Points to ignore detrimental conditions. As a move action, you can spend 1 Resolve Point to suppress one of the following conditions for 10 minutes: exhausted, fatigued, frightened, nauseated, shaken, sickened, or staggered (see pages 276–277). After 10 minutes, if the condition’s duration hasn’t ended, the condition’s effects return. You can suppress only one condition at a time; if you are both fatigued and shaken, you can avoid the effects of only one of them, and if you are affected by two different instances of the same condition, you’re still affected by the second one.", "prerequisites": "", "level_requirement": 9}, "kinetic resistance": {"title": "Kinetic Resistance", "body": "D You gain DR 3/—. At 17th level, this DR increases to 5/—.", "prerequisites": "", "level_requirement": 13}, "impenetrable defense": {"title": "Impenetrable Defense", "body": "As a standard action, you can set up a strong defense for yourself and an adjacent ally. Until the start of your next turn, you gain three benefits: your damage reduction increases to DR 10/—; you and the chosen ally each gain a +4 bonus to AC; and if you use guard’s protection, you direct all the damage to yourself such that your ally takes none.", "prerequisites": "", "level_requirement": 17}, "guard’s protection": {"title": "Guard’s Protection", "body": "When an ally adjacent to you is damaged by an attack, you can use your reaction to intercede. You take half the damage, and your ally takes the other half. This has no effect on spells, and any conditions delivered by the attack apply to both of you. In addition, you are now proficient with powered armor.", "prerequisites": "", "level_requirement": 5}, "armor training": {"title": "Armor Training", "body": "You reduce the armor check penalty of armor you wear by 1 (to a minimum of 0) and increase the maximum Dexterity bonus allowed by your armor by 1.", "prerequisites": "", "level_requirement": 1}, "nimble fusillade": {"title": "Nimble Fusillade", "body": "When you make a full attack, you can also either take a guarded step or move up to half your speed. This movement can come before, between, or after your attacks, but it can’t be split up.", "prerequisites": "", "level_requirement": 5}, "duck and weave": {"title": "Duck and Weave", "body": "When you move or make a ranged attack, you can spend 1 Resolve Point to avoid provoking attacks of opportunity from that movement or ranged attack.", "prerequisites": "", "level_requirement": 9}, "elusive target": {"title": "Elusive Target", "body": "On any turn in which you move, you gain a +1 insight bonus\r\nto your AC until the start of your next turn.", "prerequisites": "", "level_requirement": 13}, "harrying shot": {"title": "Harrying Shot", "body": "As a full action, you can make one attack and give the benefit of harrying fire (see page 247) against any creature you hit with that attack. If you use a blast weapon or automatic weapon, the benefit applies against all targets hit. You can also take your nimble fusillade movement before or after this attack.", "prerequisites": "", "level_requirement": 17}, "opening volley": {"title": "Opening Volley", "body": "You gain Opening Volley as a bonus feat. If you already have this feat, choose a bonus combat feat instead. At 9th level, you can use Opening Volley on both your first and second turns in combat.", "prerequisites": "", "level_requirement": 1}, "focus fire": {"title": "Focus Fire", "body": "When you make a full attack with a ranged weapon, you can make both attacks with a –3 penalty instead of a –4 penalty as long as they both target the same creature. If your first attack kills or knocks out the target, you can instead make the second attack against a different creature at a –4 penalty. Once you have the soldier’s onslaught class feature (see page 112), you can use this ability with it, making three attacks against the same creature at a –5 penalty; if your first or second attack kills or knocks out your target, you can make your remaining attacks against a different creature at a –6 penalty.", "prerequisites": "", "level_requirement": 5}, "intense focus": {"title": "Intense Focus", "body": "When you make a ranged attack against a target with cover or concealment, you can spend 1 Resolve Point to negate its AC bonus from cover and reduce its concealment by one category (from total concealment to concealment or from concealment to no concealment). This benefit applies to all ranged attacks you make against that target this round. You can’t use intense focus more than once per round, nor can you use it against an enemy with total cover.", "prerequisites": "", "level_requirement": 9}, "focused damage": {"title": "Focused Damage", "body": "When you use focus fire, each attack against the first target deals 2d6 additional damage. Additional creatures you attack after killing or knocking out your first target don’t take this extra damage.", "prerequisites": "", "level_requirement": 13}, "prepared shot": {"title": "Prepared Shot", "body": "As a standard action, you can study a target before you attack. The target must be within line of sight of you and either flat-footed or unaware of your presence. On the first attack you make against that target on your next turn, you gain a +2 bonus to your attack roll. If your attack hits, the target is staggered for 1 round; if you score a critical hit, the target is instead stunned for 1 round. Once you make a prepared shot, you can’t use this ability again against the same target for 24 hours. You can’t make an attack on the same round you study the target, even if an ability would let you attack without spending a standard or full action.", "prerequisites": "", "level_requirement": 17}, "sniper’s aim": {"title": "Sniper’s Aim", "body": "When you make a ranged attack against a target with cover, reduce the AC bonus from cover by 2. You can’t use sniper’s aim against an enemy with total cover.", "prerequisites": "", "level_requirement": 1}, "countertech": {"title": "Countertech", "body": "As a reaction when you take damage from an attack by a technological weapon or source within medium range that specifically targets you, you can expend an unused spell slot to disrupt the attack. With a spell slot of 1st to 5th level, you can counter an attack from a technological weapon whose item level is equal to or less than the level of the expended spell slot × 3, to a maximum of your caster level. 6th-level spell slots can counter any weapon with a level equal to or less than your caster level. For example, at 2nd level, you could expend a 1st-level spell slot to counter an attack from a 1st- or 2nd-level weapon. To successfully counter the attack, you must roll a countertech check (1d20 + your caster level) with a DC equal to 11 + the weapon’s level. If the countertech check succeeds, the attack deals half damage. If the countertech check fails, the attack deals normal damage. This magic hack only affects attacks that target you directly; you cannot use countertech against attacks that target an area or that target another person.", "prerequisites": "", "level_requirement": 2}, "empowered weapon": {"title": "Empowered Weapon", "body": "As a move action, you can expend an unused spell slot to reconfigure and enhance a weapon you’re wielding. Until the start of your next turn, your attacks with the enhanced weapon gain a bonus to attack rolls equal to the level of the spell slot you expended. In addition, your attacks with that weapon deal 1d6 additional damage per level of the expended spell slot. This damage is of the same type the weapon normally deals.", "prerequisites": "", "level_requirement": 2}, "energize spell": {"title": "Energize Spell", "body": "Once per day as a move action, you can use a battery or a weapon’s power cell to power your spellcasting, enabling you to cast one spell you know without using a spell slot. This expends 20 charges per spell level from the battery or power cell and requires you to touch the battery, power cell, or weapon. You must cast the spell before the start of your next turn, or the charges are wasted with no effect.", "prerequisites": "", "level_requirement": 2}, "fabricate tech": {"title": "Fabricate Tech", "body": "As a full action, you can expend an unused spell slot to temporarily construct a piece of technological gear from raw magic. You can create any single technological item with a level equal to or less than the level of the expended spell slot × 3, to a maximum of your caster level. The item appears in your hands or in an adjacent square. You can use fuse spells with this magic hack. The size of the item cannot exceed 10 bulk or Medium size, and the quality of the item is average. Treat this as a spell of the same level as the expended spell slot. For example, at 4th level, you could expend a 1st-level spell slot to fabricate an item of up to 3rd level, or you could expend a 2nd-level spell slot to fabricate an item of up to 4th level. The item persists for a number of minutes equal to your technomancer level. At the end of this duration, the item disappears. You can’t create armor, weapons, magic items, or items with limited uses or charges (such as batteries, drugs, or fuel) with this hack.", "prerequisites": "", "level_requirement": 2}, "harmful spells": {"title": "Harmful Spells", "body": "When you cast an instantaneous spell that deals damage, you can increase the spell’s damage by half your technomancer level. This increased damage applies to all creatures damaged by an area spell, but for spells that target multiple creatures with multiple rays or other attacks (such as magic missile), the increased damage applies only to a single ray or missile. This increased damage doesn’t apply to ongoing damage from the spell (such as bleed or burn). This magic hack doesn’t increase ability damage or other spell effects, only damage to Stamina Points or Hit Points.", "prerequisites": "", "level_requirement": 2}, "quick scan": {"title": "Quick Scan", "body": "As a standard action, you can get a general sense of what information is stored on drives or other digital storage media. You must pass your hand in the air near the data source, but don’t have to touch it or connect to it. The information you get is very general, such as “financial records,” “military records,” or “spells.” Getting detailed information requires interfacing with the data more directly. If you attempt a quick scan on a creature that stores its memories in a digital medium—to get a sense of the memories stored in a robot, for example—the target can attempt a Will save to negate the scan and prevent you from trying against it again for 24 hours.", "prerequisites": "", "level_requirement": 2}, "robot influence": {"title": "Robot Influence", "body": "You can affect constructs, robots, and other creatures that have the technological subtype with your mind-affecting spells, even if they’re mindless or normally immune to such effects. However, they receive a +2 bonus to their Will saves against your mind-affecting spells.", "prerequisites": "", "level_requirement": 2}, "selective targeting": {"title": "Selective Targeting", "body": "When you cast an instantaneous spell with an area effect, you can shape the spell so it doesn’t affect one of your allies. Choose one 5-foot square within the spell’s area to be unaffected by the spell. At 5th level, you can spend 1 Resolve Point to exclude any number of squares with this ability.", "prerequisites": "", "level_requirement": 2}, "spell countermeasures": {"title": "Spell Countermeasures", "body": "You gain a +2 bonus to saving throws against spells and other magical effects.", "prerequisites": "", "level_requirement": 2}, "technomantic proficiency": {"title": "Technomantic Proficiency", "body": "As a standard action, you can spend 1 Resolve Point to temporarily learn how to use a weapon in combat. Choose a single weapon; you gain proficiency with it (and any identical weapon) for a number of minutes equal to your class level. Each round you use the weapon reduces this magic hack’s duration by 1 minute. For example, at 4th level, you could gain proficiency with corona laser rifles for 4 minutes. If you fire such a weapon for 2 rounds, you remain proficient with it for 2 more minutes.", "prerequisites": "", "level_requirement": 2}, "charging jolt": {"title": "Charging Jolt", "body": "As a move action, you can expend an unused spell slot to refill charges in a weapon’s power cell. This requires you to touch the weapon or its power cell. The power cell regains 10 charges per spell level, up to its capacity. You can also use this ability to jump-start or short out an electronic device, allowing you to attempt an Engineering check to disable a device with a bonus equal to double the level of the spell you expended.", "prerequisites": "", "level_requirement": 5}, "debug spell": {"title": "Debug Spell", "body": "Any piece of code has bugs, but you can turn the bugs in your spellcode into features. After rolling damage for an instantaneous spell that deals Hit Point damage, you can spend 1 Resolve Point to reroll one die with a result of 1 (see page 243). At 11th level, you can reroll up to two dice with a result of 1, and at 17th level, you can reroll up to three dice with a result of 1. For example, if you were 17th level and cast disintegrate, you could spend 1 Resolve Point to reroll up to three dice that rolled 1s, after rolling and seeing how many 1s you rolled.", "prerequisites": "", "level_requirement": 5}, "distant spell": {"title": "Distant Spell", "body": "When you cast a spell with a range of close, medium, or long, you can spend 1 Resolve Point to double its range. Spells whose ranges are not defined by distance, as well as spells whose ranges are not close, medium, or long, do not benefit from this magic hack. If the spell affects an area, doubling its range doesn’t alter the size of its area.", "prerequisites": "", "level_requirement": 5}, "extended spell": {"title": "Extended Spell", "body": "When you cast a spell, you can spend 1 Resolve Point to double its duration. This has no effect on spells with a duration of concentration, instantaneous, 1 round or less, or permanent, nor can it increase a spell’s duration to more than 24 hours.", "prerequisites": "", "level_requirement": 5}, "fabricate arms": {"title": "Fabricate Arms", "body": "As a full action, you can expend an unused spell slot to temporarily construct a technological weapon or suit of armor out of raw magic. You can create one suit of armor or weapon with a level equal to or less than the level of the expended spell slot × 3, to a maximum of your caster level. The item appears in your hands, on your person, or in an adjacent square. You can use fuse spells with this magic hack. A weapon can’t be larger than two-handed, and the size of the item can’t exceed 10 bulk. The quality of the item is average for its type. Treat this as a spell of the same level as the expended spell slot. For example, at 10th level, you could expend a 3rd-level spell slot to fabricate a weapon of 9th level or lower, or expend a 4th- level spell slot to fabricate a suit of armor of 10th level or lower. The armor or weapon persists for a number of rounds equal to your technomancer level. At the end of this duration, the item disappears. You are proficient with (but not specialized in) any weapons you create with this ability. You can’t create magic items, weapons made from a special material, or weapons that are expended with use (such as arrows, grenades, or missiles) with this magic hack.", "prerequisites": "", "level_requirement": 5}, "magic negation": {"title": "Magic Negation", "body": "As a standard action, you can spend 1 RP to temporarily suppress magic, as if using dispel magic. Choose either an ongoing spell or a magic item within 30 feet of you. The magical effects of the spell or magic item are suppressed for 1d4 rounds, and then they return. If the spell’s level is higher than you can cast or the item’s caster level is greater than yours, you can’t suppress it. If you target a spell affecting a creature, the creature can attempt a Will save to stop you from suppressing the spell.", "prerequisites": "", "level_requirement": 5}, "spell grenade": {"title": "Spell Grenade", "body": "You can spend 1 Resolve Point to store a spell with a range of touch in a grenade, allowing you to affect a target within the grenade’s blast radius with the spell. Casting a spell with spell grenade uses the spell’s standard casting time, and throwing the spell grenade is a standard action. You must throw the grenade before the end of your next turn, or the spell is wasted. You are considered proficient with the grenade for this attack. Choose a single target within the grenade’s blast radius; that target is affected by the spell as if you had successfully touched it. The grenade goes off as normal, with all of its usual effects within its blast radius. If you miss the targeted intersection with the grenade, you must choose a target within the grenade’s new blast radius. If there are no suitable targets within the grenade’s blast radius, the spell is wasted. Spells whose ranges are not touch don't benefit from this magic hack.", "prerequisites": "", "level_requirement": 5}, "diviner’s tap": {"title": "Diviner’s Tap", "body": "You can hack a computer to set up magical surveillance. This takes 10 minutes and requires a successful Computers check against the device’s DC. If you fail, you can’t try again on the same device. On a success, your tap lasts for a number of days equal to your caster level. You can program your tap either to give you general information about user activity on the device or to receive a mental alarm when a user accesses or transmits data about a specific topic (getting an idea of the information found). For instance, a user might hold a video call to talk about your exploits. If you chose to receive general information, you might know that a video call took place but not the call’s topic. If you chose to have the tap receive an alarm when the topic is you, you’d get the gist of the conversation (but not a complete transcript). Setting up a new diviner’s tap ends the duration of any previous one still in effect.", "prerequisites": "", "level_requirement": 8}, "flash teleport": {"title": "Flash Teleport", "body": "As a move action, you can spend 1 Resolve Point to teleport up to 30 feet. You must have line of sight to your destination. This movement doesn’t provoke attacks of opportunity.", "prerequisites": "", "level_requirement": 8}, "mental mark": {"title": "Mental Mark", "body": "When an enemy fails a Will save against one of your technomancer spells, it takes a –2 penalty to saving throws and AC for 1 round. When an enemy succeeds at a Will save against one of your technomancer spells, it takes a –1 penalty to saving throws against your spells for 1 round. A creature can take only one penalty from a mental mark at a time.", "prerequisites": "", "level_requirement": 8}, "spellshot": {"title": "Spellshot", "body": "You can cast an area spell with a casting time of 1 standard action or less through a ranged weapon, allowing you to use the weapon’s range rather than the spell’s range. You must target a single creature with your attack, and the spell’s area is centered on that creature, or originates at the creature’s location for a cone or line effect (oriented in whichever direction you choose), even if the spell would normally be centered on or originate from a point. You can fire the weapon as part of the standard action to cast the spell. You must fire the weapon during the round that the casting is completed, or the spell is wasted. If the attack misses, the spell is wasted. Spells with an emanation effect that would be centered on you don’t benefit from this magic hack.", "prerequisites": "", "level_requirement": 8}, "tech countermeasures": {"title": "Tech Countermeasures", "body": "As a move action, you can spend 1 Resolve Point to make it more difficult for enemies to target you with technological weapons for 1 round. Until the start of your next turn, as a reaction just before an enemy attacks you with a technological weapon, you can force that enemy to roll the attack twice and take the lower result; if the weapon allows a Reflex save instead of requiring an attack roll, you instead gain the benefit of evasion (as the operative’s class feature; see page 93) against the attack. This magic hack has no effect on spells that target you or on weapons or attacks that are not technological in nature.", "prerequisites": "", "level_requirement": 8}, "widened spell": {"title": "Widened Spell", "body": "When you cast a spell with a burst, emanation, or spread, you can spend 2 Resolve Points to double its radius. For instance, a spell with a 30-foot burst would have a 60-foot burst instead. Spells that don’t have an area of one of these three types are not affected by this magic hack.", "prerequisites": "", "level_requirement": 8}, "countertech sentinel": {"title": "Countertech Sentinel", "body": "You can spend 1 Resolve Point to use your countertech magic hack to counter a direct attack against an ally within 15 feet. You can't use countertech sentinel against attacks that target an area. You must have the countertech magic hack to choose this magic hack.", "prerequisites": "", "level_requirement": 11}, "eternal spell": {"title": "Eternal Spell", "body": "Choose one 1st-level spell you know from the list of technomancer spells in the Starfinder Core Rulebook. You can cast it at will, as though it were a 0-level spell. It still counts as one of your 1st-level spells known, not one of your 0-level spells known. You can choose a 1st-level spell from a source other than the Core Rulebook with the GM’s permission.", "prerequisites": "", "level_requirement": 11}, "reboot mind": {"title": "Reboot Mind", "body": "You can free someone from magical mental control or conditions. As a standard action, you can spend 1 Resolve Point and touch a willing creature. This restarts the subject’s brain, ending all mind-affecting effects affecting it, as well as all conditions that could be removed by greater remove condition that were imparted on the creature by mind- affecting effects, but the subject becomes stunned until the end of its next turn. Once you reboot a mind, you can’t use this ability again for 24 hours.\r\n\r\nYou can attempt to reboot the mind of an ally who is unwilling due to the influence of a mind-affecting effect. In this case, the ally can attempt a new saving throw against the effect at the same DC. If she succeeds, the ally can allow her mind to be rebooted, but if she fails, you waste the expended Resolve Point and action.\r\n\r\nYou can use this ability to reboot your own mind. If you’re unable to take actions, you can reboot your mind without spending actions, but it must be the first thing you do on your turn, and you are stunned until the end of your next turn.", "prerequisites": "", "level_requirement": 11}, "seeking shot": {"title": "Seeking Shot", "body": "As a standard action, you can spend 1 Resolve Point to fire a single shot from a ranged weapon at a target known to you within range. The shot travels to the target, even around corners. Only an unavoidable obstacle or the limit of the weapon’s range prevents the shot from reaching the target. This ability negates cover and concealment modifiers, but otherwise the attack is rolled normally.", "prerequisites": "", "level_requirement": 11}, "phase shot": {"title": "Phase Shot", "body": "As a standard action, you can spend 1 Resolve Point to fire a single shot from a ranged weapon at a target known to you within range. The shot travels straight to the target, passing through any nonmagical barrier in its way, ignoring hardness and Hit Points (any magical barrier, such as a wall of force, stops the shot). This ability negates cover and concealment modifiers, but otherwise the attack is rolled normally.", "prerequisites": "", "level_requirement": 14}, "quickened spell": {"title": "Quickened Spell", "body": "You can cast a spell as a move action. You can spend 2 Resolve Points to cast a quickened 0-level spell or 4 Resolve Points to cast a quickened 1st-level spell. You can quicken only spells with a casting time of 1 full action or shorter. At 16th level, you can spend 6 Resolve Points to cast a quickened 2nd-level spell.", "prerequisites": "", "level_requirement": 14}, "rain of fire": {"title": "Rain of Fire", "body": "Once per day as a full action, you can spend 2 Resolve Points to shoot a ranged weapon at multiple targets within range; the maximum number of targets is equal to half your technomancer level or the number of shots in your weapon, whichever is lower. Each attack uses your highest attack bonus, and each enemy can be targeted only by a single shot.", "prerequisites": "", "level_requirement": 14}, "spell library": {"title": "Spell Library", "body": "You gain one extra spell known for each level of spell you can cast. You must choose the new spells when you gain this magic hack. If you gain access to a higher level of spell after choosing this hack, you gain one extra spell known for that spell level.", "prerequisites": "", "level_requirement": 14}, "spell cache": {"title": "Spell Cache", "body": "As the culmination of your early study of the fundamental forces of the galaxy, you have created a spell cache that allows you to store and access spells. Your spell cache could be a device such as a handheld computer or technological implant; an item such as a ring or staff; or a symbol such as a brand, tattoo, or other permanent modification to your body. While you don’t need your spell cache to cast your spells, once per day, you can activate your spell cache to cast any one spell you know and are capable of casting, even if you’ve expended all your spell slots for that spell’s level.\r\n\r\nIf your spell cache is damaged, it is restored to full Hit Points the next time you prepare spells. If the spell cache is lost or destroyed, you can replace it after 1 week with a special ritual that takes 8 hours to complete.", "prerequisites": "", "level_requirement": 1}, "magic hack": {"title": "Magic Hack", "body": "You have carefully studied the forces that define magic and can manipulate them. You learn your first magic hack at 2nd level, and you learn an additional magic hack every 3 levels thereafter. When casting a spell, you can apply no more than one magic hack that affects the attributes of a spell (such as distant spell or extended spell). If a magic hack allows a saving throw to resist its effects, the DC is equal to 10 + half your technomancer level + your Intelligence modifier. The list of magic hacks appears starting on page 120.", "prerequisites": "", "level_requirement": 2}, "spell focus": {"title": "Spell Focus", "body": "Through careful study, you have developed methods to make your spells harder to resist.", "prerequisites": "Ability to cast spells, character level 3rd.", "level_requirement": 3}, "techlore": {"title": "Techlore", "body": "You rewire your mind to give you greater insight into the nature of magic and technology. You gain a +1 insight bonus to Computers and Mysticism checks. This bonus increases by 1 at 6th level and every 3 levels thereafter.", "prerequisites": "", "level_requirement": 3}, "cache capacitor": {"title": "Cache Capacitor", "body": "You expand your spell cache into a cache capacitor. As part of regaining your spells each day, you can cast a single spell into your spell cache and have it affect you continuously for 24 hours. The cache capacitor can hold any of the following spells: detect radiation, disguise self, keen senses, or unseen servant. You must know a spell to store it in your cache capacitor. When you cast the spell into your cache capacitor, you expend the spell slot normally and make any decisions required for that spell, but the duration doesn’t expire for 24 hours. If the spell in your cache capacitor is dispelled or dismissed, you can spend 5 minutes of uninterrupted concentration to reestablish it, keeping the same decisions you made when you cast it, and gaining whatever duration the spell had remaining. You can’t exchange the stored spell for another spell until you again regains your spells.\r\n\r\nAt 12th level, your cache capacitor gains a second slot that can hold darkvision, lesser resistant armor, life bubble, or spider climb. At 18th level, your cache capacitor gains a third slot that can hold arcane sight, flight (spell level 3rd or lower), see invisibility,\r\nor tongues.", "prerequisites": "", "level_requirement": 6}, "resolve attunement": {"title": "Resolve Attunement", "body": "You recover Resolve Points when you use powerful magic. Each time you cast a 6th-level spell, you regain 1 Resolve Point, up to your normal maximum. This applies only to spells you cast using your normal 6th-level spell slots, not to those you cast using magic items or other methods such as fuse spells.", "prerequisites": "", "level_requirement": 19}, "fuse spells": {"title": "Fuse Spells", "body": "You can combine lower-level spell slots to cast higher-level spells. As part of casting a spell, you can spend 1 Resolve Point to exchange a number of unused spell slots for a single spell slot of a higher level; this expends the lower-level spell slots. Add up the levels of the expended slots to determine which higher level of spell you can cast (maximum 6th). For instance, you could exchange three 1st-level slots to cast a 3rd-level spell, or you could exchange two 3rd-level slots to cast a 6th-level spell. If you combine spell slots to cast a 6th-level spell, it doesn’t count as such for resolve attunement.\r\nFurthermore, you can spend 2 Resolve Points to combine two 6th-level spell slots to cast wish.", "prerequisites": "", "level_requirement": 20}, "penetrating attack": {"title": "Penetrating Attack", "body": "You know how to angle your attacks so that you penetrate your opponent’s defenses.", "prerequisites": "Base attack bonus +12.", "level_requirement": null}, "spell penetration": {"title": "Spell Penetration", "body": "Your spells break through spell resistance more easily than those of other spellcasters.", "prerequisites": "", "level_requirement": null}, "penetrating spell": {"title": "Penetrating Spell", "body": "You know how to cast spells so that they penetrate your opponent’s defenses.", "prerequisites": "Ability to cast 4th-level spells.", "level_requirement": null}, "sidestep": {"title": "Sidestep", "body": "You can reposition yourself after a foe’s missed swing.", "prerequisites": "Dex 15, Mobility or trick attack class feature.", "level_requirement": null}, "powered armored proficiency": {"title": "Powered Armored Proficiency", "body": "You know how to use powered armor.", "prerequisites": "Str 13, base attack bonus +5, proficiency in light and heavy armor.", "level_requirement": null}, "psychic power": {"title": "Psychic Power", "body": "You have a natural psychic ability.", "prerequisites": "Cha 13, Minor Psychic Power, character level 4th.", "level_requirement": null}, "sniper weapon proficiency": {"title": "Sniper Weapon Proficiency", "body": "You know how to use sniper weapons.", "prerequisites": "", "level_requirement": null}, "pull the pin": {"title": "Pull the Pin", "body": "You can activate a foe’s grenade.", "prerequisites": "Improved Combat Maneuver (disarm).", "level_requirement": null}, "quick draw": {"title": "Quick Draw", "body": "You can draw weapons faster than most.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "skill focus": {"title": "Skill Focus", "body": "You are particularly adept at a certain skill.\r\n\r\nD Benefit: \r\nD Special:", "prerequisites": "", "level_requirement": null}, "skill synergy": {"title": "Skill Synergy", "body": "You understand how two skills work well together.", "prerequisites": "", "level_requirement": null}, "special weapon proficiency": {"title": "Special Weapon Proficiency", "body": "You know how to use a special weapon.", "prerequisites": "Proficiency in basic melee weapons or small arms (see below).", "level_requirement": null}, "sky jockey": {"title": "Sky Jockey", "body": "You can get the most out of flying technology.", "prerequisites": "Piloting 5 ranks.", "level_requirement": null}, "slippery shooter": {"title": "Slippery Shooter", "body": "You leave fewer openings when making a ranged attack.", "prerequisites": "Dex 15, base attack bonus +6.", "level_requirement": null}, "step up and strike": {"title": "Step Up and Strike", "body": "When a foe tries to move away, you can follow and make an attack of opportunity.", "prerequisites": "Dex 13, Step Up, base attack bonus +6.", "level_requirement": null}, "heavy weapon proficiency": {"title": "Heavy Weapon Proficiency", "body": "You know how to use heavy weapons.", "prerequisites": "Str 13, proficiency in small arms and longarms.", "level_requirement": null}, "stand still": {"title": "Stand Still", "body": "You can stop foes that try to move past you.", "prerequisites": "", "level_requirement": null}, "spry cover": {"title": "Spry Cover", "body": "You can use covering fire to make it easier for your ally to move.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "step up": {"title": "Step Up", "body": "You can close the distance when a foe tries to move away.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "suppressive fire": {"title": "Suppressive Fire", "body": "You can use automatic weapons to create a cone of covering fire or harrying fire.", "prerequisites": "Base attack bonus +1, proficiency with heavy weapons.", "level_requirement": null}, "strike back": {"title": "Strike Back", "body": "You can strike at foes that attack you using their superior reach by targeting their limbs or weapons as they come at you.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "swimming master": {"title": "Swimming Master", "body": "You can swim as well as a fish.", "prerequisites": "Athletics 5 ranks.", "level_requirement": null}, "technomantic dabbler": {"title": "Technomantic Dabbler", "body": "You dabble with coding in the language of magic.", "prerequisites": "Intelligence 15, character level 5th, no levels in technomancer.", "level_requirement": null}, "toughness": {"title": "Toughness", "body": "You have enhanced physical resilience, and harsh conditions or long exertions don’t easily tire you.", "prerequisites": "", "level_requirement": null}, "versatile specialization": {"title": "Versatile Specialization", "body": "You know how to get full value out of weapon types your class doesn’t normally use.", "prerequisites": "Weapon Specialization, character level 3rd.", "level_requirement": null}, "unfriendly fire": {"title": "Unfriendly Fire", "body": "You can trick foes into firing at an unintended target.", "prerequisites": "Bluff 5 ranks.", "level_requirement": null}, "basic melee weapon proficiency": {"title": "Basic Melee Weapon Proficiency", "body": "You know how to use basic melee weapons.", "prerequisites": "", "level_requirement": null}, "amplified glitch": {"title": "Amplified Glitch", "body": "You can create sudden distractions with technological devices.", "prerequisites": "Computers 3 ranks, Intimidate 3 ranks.", "level_requirement": null}, "veiled threat": {"title": "Veiled Threat", "body": "You can be so subtle not even the people you threaten are entirely sure you threatened them.", "prerequisites": "Cha 15, Intimidate 1 rank.", "level_requirement": null}, "versatile focus": {"title": "Versatile Focus", "body": "Your accuracy applies to all weapons with which you are proficient.", "prerequisites": "Weapon Focus (any).", "level_requirement": null}, "antagonize": {"title": "Antagonize", "body": "You know how to make foes extremely angry with you.", "prerequisites": "Diplomacy 5 ranks, Intimidate 5 ranks.", "level_requirement": null}, "weapon focus": {"title": "Weapon Focus", "body": "You have increased training in a particular weapon type, making it easier to hit your target.", "prerequisites": "Proficiency with selected weapon type.", "level_requirement": null}, "adaptive fighting": {"title": "Adaptive Fighting", "body": "You can adjust your fighting style to match specific conditions during combat.", "prerequisites": "Three or more combat feats", "level_requirement": null}, "spring attack": {"title": "Spring Attack", "body": "You can deftly move up to a foe, strike, and withdraw before it can react.", "prerequisites": "ex 15, Mobility, base attack bonus +4.", "level_requirement": null}, "agile casting": {"title": "Agile Casting", "body": "You can move, cast a spell, and move again before foes react.", "prerequisites": "Key ability score 15, Dex 15, Mobility, caster level 4th.", "level_requirement": null}, "barricade": {"title": "Barricade", "body": "You are adept at creating quick, temporary cover.", "prerequisites": "Engineering 1 rank.", "level_requirement": null}, "blind-fight": {"title": "Blind-Fight", "body": "You are skilled at attacking opponents you can’t clearly see.", "prerequisites": "", "level_requirement": null}, "cleave": {"title": "Cleave", "body": "You can strike two adjacent foes with a single swing.", "prerequisites": "Str 13, base attack bonus +1.", "level_requirement": null}, "bodyguard": {"title": "Bodyguard", "body": "You can attempt to ward off attacks that target nearby allies.", "prerequisites": "", "level_requirement": null}, "climbing master": {"title": "Climbing Master", "body": "You can climb as well as a monkey or a spider.", "prerequisites": "Athletics 5 ranks.", "level_requirement": null}, "combat casting": {"title": "Combat Casting", "body": "You leave fewer openings when casting a spell.", "prerequisites": "Ability to cast 2nd-level spells.", "level_requirement": null}, "connection inkling": {"title": "Connection Inkling", "body": "You gain a hint of mystic power.", "prerequisites": "Wis 15, character level 5th, no levels in mystic.", "level_requirement": null}, "coordinated shot": {"title": "Coordinated Shot", "body": "You can maneuver a foe to be in the direct line of an ally’s fire.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "deadly aim": {"title": "Deadly Aim", "body": "Your can strike your enemies’ weak points and deal more damage. D Prerequisites: Base attack bonus +1.", "prerequisites": "", "level_requirement": null}, "deflect projectiles": {"title": "Deflect Projectiles", "body": "You can use your melee weapon to deflect attacks.", "prerequisites": "Base attack bonus +8.", "level_requirement": null}, "diehard": {"title": "Diehard", "body": "You are especially hard to kill. Your wounds quickly stabilize when you’re grievously wounded.", "prerequisites": "", "level_requirement": null}, "greater feint": {"title": "Greater Feint", "body": "You are skilled at fooling your opponents in combat.", "prerequisites": "Improved Feint, base attack bonus +6.", "level_requirement": null}, "dive for cover": {"title": "Dive for Cover", "body": "You know how to dive out of the area of an effect.", "prerequisites": "Base Reflex save bonus +2.", "level_requirement": null}, "diversion": {"title": "Diversion", "body": "You can draw attention to yourself, allowing your allies to slip away.", "prerequisites": "", "level_requirement": null}, "drag down": {"title": "Drag Down", "body": "You are skilled at bringing your opponent down with you when you are knocked prone.", "prerequisites": "", "level_requirement": null}, "grenade proficiency": {"title": "Grenade Proficiency", "body": "You know how to use grenades.", "prerequisites": "", "level_requirement": null}, "enhanced resistance": {"title": "Enhanced Resistance", "body": "You have trained your body to resist a particular type of damage.", "prerequisites": "Base attack bonus +4.", "level_requirement": null}, "extra resolve": {"title": "Extra Resolve", "body": "Your resolve is stronger than most.", "prerequisites": "Character level 5th.", "level_requirement": null}, "improved initiative": {"title": "Improved Initiative", "body": "Your quick reflexes allow you to react rapidly to danger.", "prerequisites": "", "level_requirement": null}, "far shot": {"title": "Far Shot", "body": "You remain accurate at longer ranges.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "harm undead": {"title": "Harm Undead", "body": "You can use your healing channel to harm undead.", "prerequisites": "Healing channel connection power, mystic level 1st.", "level_requirement": null}, "fast talk": {"title": "Fast Talk", "body": "You can baffle a foe with chatter to disguise the start of battle.", "prerequisites": "Bluff 5 ranks.", "level_requirement": null}, "fleet": {"title": "Fleet", "body": "You are faster than most.", "prerequisites": "", "level_requirement": null}, "fusillade": {"title": "Fusillade", "body": "You use your numerous limbs to lay down a hail of fire.", "prerequisites": "Base attack bonus +1, four or more arms.", "level_requirement": null}, "improved combat maneuver": {"title": "Improved Combat Maneuver", "body": "You are particularly skilled with a specific combat maneuver.", "prerequisites": "Base attack bonus +1.", "level_requirement": null}, "great cleave": {"title": "Great Cleave", "body": "You can strike many adjacent foes with a single blow.", "prerequisites": "Str 13, Cleave, base attack bonus +4.", "level_requirement": null}, "in harm’s way": {"title": "In Harm’s Way", "body": "You put yourself in danger’s path to save your allies.", "prerequisites": "Bodyguard", "level_requirement": null}, "great fortitude": {"title": "Great Fortitude", "body": "You are resistant to diseases, poisons, and other maladies.", "prerequisites": "", "level_requirement": null}, "improved iron will": {"title": "Improved Iron Will", "body": "Your clarity of thought allows you to resist mental attacks.", "prerequisites": "Iron Will, character level 5th.", "level_requirement": null}, "improved critical": {"title": "Improved Critical", "body": "Attacks with your chosen weapon are harder to shake off.", "prerequisites": "Base attack bonus +8.", "level_requirement": null}, "improved great fortitude": {"title": "Improved Great Fortitude", "body": "You are more resistant to diseases, poisons, and dangers.", "prerequisites": "Great Fortitude, character level 5th.", "level_requirement": null}, "improved stand still": {"title": "Improved Stand Still", "body": "You are particularly skilled at stopping foes in their tracks.", "prerequisites": "Stand Still.", "level_requirement": null}, "improved feint": {"title": "Improved Feint", "body": "You are skilled at fooling your opponents in combat.", "prerequisites": "", "level_requirement": null}, "improved lightning reflexes": {"title": "Improved Lightning Reflexes", "body": "You have a knack for avoiding the dangers all around you.", "prerequisites": "Lightning Reflexes, character level 5th.", "level_requirement": null}, "improved sidestep": {"title": "Improved Sidestep", "body": "You keep your mobility when sidestepping foes’ melee attacks.", "prerequisites": "Dex 17, Mobility or trick attack class feature, Sidestep.", "level_requirement": null}, "jet dash": {"title": "Jet Dash", "body": "You are swift of foot and can make enormous leaps.", "prerequisites": "", "level_requirement": null}, "improved unarmed strike": {"title": "Improved Unarmed Strike", "body": "You have trained to make your unarmed attacks lethal and strike with kicks, head-butts, and similar attacks.", "prerequisites": "", "level_requirement": null}, "iron will": {"title": "Iron Will", "body": "You are more resistant to mental effects.", "prerequisites": "", "level_requirement": null}, "lightning reflexes": {"title": "Lightning Reflexes", "body": "You have faster reflexes than normal.", "prerequisites": "", "level_requirement": null}, "kip up": {"title": "Kip Up", "body": "You can stand up from prone in a hurry.", "prerequisites": "Acrobatics 1 rank.", "level_requirement": null}, "longarm proficiency": {"title": "Longarm Proficiency", "body": "You know how to use longarms.", "prerequisites": "Proficiency in small arms.", "level_requirement": null}, "lunge": {"title": "Lunge", "body": "You can strike foes that would normally be out of reach.", "prerequisites": "Base attack bonus +6.", "level_requirement": null}, "major psychic power": {"title": "Major Psychic Power", "body": "You have a significant natural psychic ability.", "prerequisites": "Cha 15, Minor Psychic Power, Psychic Power, character level 7th.", "level_requirement": null}, "master crafter": {"title": "Master Crafter", "body": "You can construct things more quickly than most.", "prerequisites": "Computers, Engineering, Life Science, Mysticism, Physical Science, or appropriate Profession 5 ranks.", "level_requirement": null}, "spellbane": {"title": "Spellbane", "body": "Your mind and body are fortified against magic.", "prerequisites": "Unable to cast spells or use spell-like abilities.", "level_requirement": null}, "medical expert": {"title": "Medical Expert", "body": "You are an expert at medical science and caring for the ill.", "prerequisites": "Life Science 1 rank, Medicine 1 rank, Physical Science 1 rank.", "level_requirement": null}, "mobility": {"title": "Mobility", "body": "You can easily move past dangerous foes.", "prerequisites": "Dex 13.", "level_requirement": null}, "small arm proficiency": {"title": "Small Arm Proficiency", "body": "You know how to use small arms.", "prerequisites": "", "level_requirement": null}, "multi-weapon fighting": {"title": "Multi-Weapon Fighting", "body": "You know how to fight with several lighter weapons at once and how to take advantage of your multiple attacks.", "prerequisites": "", "level_requirement": null}, "reflect projectiles": {"title": "Reflect Projectiles", "body": "You can use your melee weapon to redirect attacks.", "prerequisites": "Deflect Projectiles, base attack bonus +16.", "level_requirement": null}, "advanced melee weapon proficiency": {"title": "Advanced Melee Weapon Proficiency", "body": "You know how to use advanced melee weapons.", "prerequisites": "Proficiency in basic melee weapons", "level_requirement": null}, "mystic strike": {"title": "Mystic Strike", "body": "Your magical power flows into your weapons.", "prerequisites": "Ability to cast spells.", "level_requirement": null}, "nimble moves": {"title": "Nimble Moves", "body": "Move across a single obstacle with ease.", "prerequisites": "Dex 15.", "level_requirement": null}, "greater spell penetration": {"title": "Greater Spell Penetration", "body": "Your spells break through spell resistance much more easily than most.", "prerequisites": "Spell Penetration.", "level_requirement": null}, "shot on the run": {"title": "Shot on the Run", "body": "You can move, fire a ranged weapon, and move again before your foes can react.", "prerequisites": "ex 15, Mobility, base attack bonus +4.", "level_requirement": null}, "heavy armor proficiency": {"title": "Heavy Armor Proficiency", "body": "You know how to use heavy armor.", "prerequisites": "Str 13, proficiency in light armor.", "level_requirement": null}, "parting shot": {"title": "Parting Shot", "body": "You are an expert skirmisher and are able to take a final shot as you retreat.", "prerequisites": "Dex 15, Mobility, Shot on the Run, base attack bonus +6. Benefit:", "level_requirement": null}, "light armor proficiency": {"title": "Light Armor Proficiency", "body": "You know how to use light armor.", "prerequisites": "", "level_requirement": null}, "minor psychic power": {"title": "Minor Psychic Power", "body": "You have a minor natural psychic ability.", "prerequisites": "Cha 11.", "level_requirement": null}, "wounding": {"title": "Wounding", "body": "The wounding fusion causes a weapon to deal exceptionally traumatic damage. The weapon gains the wound critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the wound effect.", "prerequisites": "", "level_requirement": 7}, "bane": {"title": "Bane", "body": "The bane fusion enhances the power of critical hits against certain foes. Against a designated foe, the bane weapon gains the stunned critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit against an appropriate foe, you can apply either the weapon’s normal critical hit effect or the stunned effect. When you add this fusion to a weapon (or create it as a fusion seal), you must select a single creature type (aberration, animal, construct, dragon, fey, humanoid, magical beast, ooze, outsider, plant, undead, or vermin) against which it will apply. If you select humanoid or outsider, you must also select one subtype. The stunned critical hit effect applies only against creatures of the selected type (and subtype, if selected). Once selected, the creature type and subtype can’t be changed.", "prerequisites": "", "level_requirement": 5}, "blasting": {"title": "Blasting", "body": "The blasting fusion allows a weapon to make a single attack as a blast (see the blast weapon special property on page 180) once per day as a full action. This attack has a maximum range of 30 feet and deals half the weapon’s normal damage. Only ranged weapons that don’t have the automatic, explode, line, or thrown weapon special property can benefit from the blasting fusion. Weapons that don’t require attack rolls to affect their targets also can’t benefit from the blasting fusion.", "prerequisites": "", "level_requirement": 2}, "bleeding": {"title": "Bleeding", "body": "The bleeding fusion weaves entropic energy into the weapon’s form. The weapon gains the bleed critical hit effect (see page 182). The amount of damage taken each round from this effect is equal to 1d6 per 5 levels of the weapon, rounded down. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the bleed effect. Only weapons that deal piercing or slashing damage can have this fusion.", "prerequisites": "", "level_requirement": 5}, "burst": {"title": "Burst", "body": "With the burst fusion, a weapon’s energy damage can form a small explosion that spills onto a second target. The weapon gains the arc critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the arc effect. The amount of damage dealt to the secondary target is equal to one-third the level of the weapon with the burst fusion (minimum 1). Only weapons that deal acid, cold, electricity, fire, or sonic damage can benefit from a burst fusion. If your weapon deals more than one type of energy damage, you select one of those types for the arc critical hit effect to apply to secondary targets when the fusion is added.", "prerequisites": "", "level_requirement": 2}, "called": {"title": "Called", "body": "A weapon with the called fusion can be teleported to its owner’s hand as a swift action, even if the weapon is in the possession of another creature. This ability has a maximum range of 100 feet, and effects that block teleportation prevent the return of a called weapon. A weapon with the called fusion must be in your possession for at least 24 hours for this ability to function.", "prerequisites": "", "level_requirement": 1}, "deafening": {"title": "Deafening", "body": "With the deafening fusion, a weapon releases a blast of low- frequency sonic energy on impact. The weapon gains the deafen critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the deafen effect. Only weapons that deal bludgeoning, piercing, slashing, or sonic damage can benefit from a deafening fusion.", "prerequisites": "", "level_requirement": 3}, "defiant": {"title": "Defiant", "body": "A weapon with the defiant fusion resists efforts to be removed from its wielder. If you are wielding it when you are knocked unconscious, panicked, or stunned, it stays in your hand. You also gain a bonus to your KAC against combat maneuvers to disarm the weapon equal to one-fifth the weapon’s level (minimum +1).", "prerequisites": "", "level_requirement": 1}, "dispelling": {"title": "Dispelling", "body": "A weapon with the dispelling fusion gathers spare wisps of latent magic during combat, which it can then unleash in a focused effort to dispel magic. The weapon gains dispelling as a critical hit effect in combat. This ability manifests only in high-stakes situations, so you must be in combat and facing a significant enemy (see page 242) for it to gain this critical hit effect. If there’s any doubt about whether you’re in combat or able to access the critical hit effect, the GM decides. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the dispelling effect. A target affected by the dispelling critical hit effect is the subject of a targeted dispel magic, as the spell, using the weapon’s item level as the dispel check’s caster level.", "prerequisites": "", "level_requirement": 3}, "disruptive": {"title": "Disruptive", "body": "The disruptive fusion imbues a weapon with powerful positive energy designed to disrupt the magical forces that allow undead to exist. The weapon ignores any DR and energy resistance of undead creatures. Only weapons that deal bludgeoning damage can benefit from this fusion.", "prerequisites": "", "level_requirement": 3}, "durable": {"title": "Durable", "body": "The durable fusion uses magical runes and reinforcements to significantly increase a weapon’s toughness. When determining a weapon’s hardness, Hit Points, and saving throws, treat its item level as being 5 higher. For more about calculating these values, see Breaking Objects on page 409.", "prerequisites": "", "level_requirement": 1}, "entangling": {"title": "Entangling", "body": "A weapon with the entangling fusion gains the entangle weapon special property (see page 181). Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an entangle attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is affected by the entangle condition. The entangle effect ends after 1d4 rounds if the target has not already escaped it. Only weapons that do bludgeoning, piercing, slashing, or cold damage can benefit from this fusion.", "prerequisites": "", "level_requirement": 2}, "frost": {"title": "Frost", "body": "The frost fusion imbues a weapon with the icy cold of a dead world far from its system’s sun. Half the weapon’s damage type is replaced with cold damage. You can activate or deactivate the frost fusion as a swift action. If the weapon already deals two types of damage, replace one of them with cold (you decide which damage type to replace each time you activate the frost fusion). You can add this fusion only to a weapon that does not already deal cold damage. This fusion never causes a weapon that normally targets KAC to target EAC.", "prerequisites": "", "level_requirement": 5}, "ghost killer": {"title": "Ghost Killer", "body": "Attacks from a weapon with this fusion deal full damage to incorporeal creatures. They also pass into the Ethereal Plane, allowing such attacks to affect ethereal creatures normally. Weapons with the ghost killer fusion can also score critical hits against incorporeal creatures. In addition, an incorporeal creature (though not an ethereal one) can pick up, move, or wield a ghost killer weapon.", "prerequisites": "", "level_requirement": 5}, "glammered": {"title": "Glammered", "body": "As a standard action, a weapon with the glamered fusion can be commanded to change its appearance to assume the form of another object of similar size. The weapon retains all its properties (including bulk) when disguised but does not radiate magic. Only true seeing or similar magic reveals the true nature of a glamered weapon while it is in disguise. After a glamered weapon is used to make an attack, this fusion is suppressed for 1 minute.", "prerequisites": "", "level_requirement": 1}, "holy": {"title": "Holy", "body": "A weapon with the holy fusion becomes blessed with divine energy from a good deity. Any attacks with the fused weapon are good-aligned. Damage from the weapon bypasses DR/good and ignores the energy resistance of evil dragons, evil outsiders, and evil undead. The holy fusion cannot be added to weapons that have the unholy fusion.", "prerequisites": "", "level_requirement": 2}, "illuminating": {"title": "Illuminating", "body": "The illuminating fusion causes a weapon to gain the bright weapon special property (see page 181). You can deactivate this fusion as a move action, in which case the weapon acts as if it does not have the bright property until it is reactivated (which also requires a move action).", "prerequisites": "", "level_requirement": 1}, "knockdown": {"title": "Knockdown", "body": "With the knockdown fusion, a weapon disrupts a target’s center of gravity. The weapon gains the knockdown critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the knockdown effect. Only weapons that deal bludgeoning damage can benefit from this fusion.", "prerequisites": "", "level_requirement": 6}, "ominous": {"title": "Ominous", "body": "A weapon with the ominous fusion trails a shadowy haze behind it and moans a menacing dirge in battle. The weapon gains intimidation as a critical hit effect. If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the intimidation effect. A target affected by the intimidation critical hit effect is shaken for 1d4 rounds (Fortitude save negates). A creature that gains the shaken condition from a weapon with the ominous fusion can’t gain that condition again from the same weapon for 24 hours.", "prerequisites": "", "level_requirement": 1}, "returning": {"title": "Returning", "body": "You can add this fusion only to a weapon that has the thrown weapon special property. A returning weapon flies through the air back to you after you make a thrown ranged attack with it. It returns to you just before your next turn (and is therefore ready to use again in that turn). Catching the weapon when it comes back takes no action. If you can’t catch it, or if you have moved since throwing it, the weapon drops to the ground in the square from which you threw it.", "prerequisites": "", "level_requirement": 1}, "seeking": {"title": "Seeking", "body": "The seeking fusion causes an attack from a weapon to veer toward its target. This negates any miss chance caused by the target having concealment, though it has no effect on miss chances from other sources (and does not offset the miss chance from a target having total concealment).", "prerequisites": "", "level_requirement": 3}, "shock": {"title": "Shock", "body": "The shock fusion weaves the electrical energy of the universe into the weapon’s form. Half the weapon’s damage type is replaced with electricity damage. You can activate or deactivate the shock fusion as a swift action. If the weapon already deals two types of damage, replace one of them with electricity (you decide which damage type to replace each time you activate the shock fusion). You can add this fusion only to a weapon that does not already deal electricity damage. This fusion never causes a weapon that normally target KAC to target EAC.", "prerequisites": "", "level_requirement": 5}, "thundering": {"title": "Thundering", "body": "The thundering fusion imbues a weapon with heightened frequency vibrations. Half the weapon’s damage type is replaced with sonic damage. You can activate or deactivate the thundering fusion as a swift action. If the weapon already deals two types of damage, replace one of them with sonic (you decide which damage type to replace each time you activate the thundering fusion). You can add this fusion only to a weapon that does not already deal sonic damage. This fusion never causes a weapon that normally target KAC to target EAC", "prerequisites": "", "level_requirement": 9}, "trailblazer": {"title": "Trailblazer", "body": "A weapon with the trailblazer fusion manages to alter the nature of its attacks to overcome the penalties of some natural environmental effects. Its attacks ignore the cover provided by bogs and the cover creatures submerged at least chest deep in water receive from attacks made from the surface. Fire damage dealt by the weapon to underwater targets does half normal damage (rather than the normal one-quarter), and other attacks made underwater deal full damage (rather than the normal half damage).\r\nAdditionally, ranged attack rolls with the weapon don’t take a penalty due to the effects of storms, strong and severe winds, or windstorms. It can even be used to make ranged attacks in severe storms as if they were typical storms and in hurricane- force winds as if they were strong winds.\r\n\r\nSee Biomes on page 396 for more information on environments that impose attack penalties, and see Underwater Combat on page 405 for rules on attacking submerged targets.", "prerequisites": "", "level_requirement": 1}, "unholy": {"title": "Unholy", "body": "The unholy fusion imbues a weapon with divine energy from an evil deity. Any attacks with the fused weapon are evil-aligned. Damage from the weapon overcomes DR/evil and ignores the energy resistance of good dragons and good outsiders. The unholy fusion can’t be added to weapons that have the holy fusion.", "prerequisites": "", "level_requirement": 2}, "anchoring": {"title": "Anchoring", "body": "A weapon with the anchoring fusion has a chance to immobilize its targets. The weapon gains immobilization as a critical hit effect. If the weapon already has a critical hit effect, choose each time whether to apply the weapon’s normal critical hit effect or the immobilization effect. A target affected by the immobilization critical hit effect is unable to move from its space under its own power for 1d4 rounds. It cannot use any form of movement, including teleportation effects, to change its position. If the target is entirely contained in a mobile object (such as a starship or large vehicle), the target is immobile relative to its location within that object. Other creatures and forces can move the target normally.", "prerequisites": "", "level_requirement": 1}, "axiomatic": {"title": "Axiomatic", "body": "The axiomatic fusion imbues a weapon with divine energy from a lawful deity. Any attacks with the weapon are lawful-aligned. Damage from the weapon bypasses DR/lawful and ignores the energy resistance of chaotic dragons and chaotic outsiders. The axiomatic fusion can’t be added to weapons that have the anarchic fusion.", "prerequisites": "", "level_requirement": 2}, "corrosive": {"title": "Corrosive", "body": "The corrosive fusion weaves the destructive power of acid into the weapon’s form. Half the weapon’s damage type is replaced with acid damage. You can activate or deactivate the corrosive fusion as a swift action. If the weapon already deals two types of damage, replace one of them with acid (you decide which damage type is replaced each time you activate the corrosive fusion). You can add this fusion only to a weapon that does not already deal acid damage. This fusion never causes a weapon that normally targets KAC to target EAC.", "prerequisites": "", "level_requirement": 9}, "anarchic": {"title": "Anarchic", "body": "The anarchic fusion imbues a weapon with divine energy from a chaotic deity. Any attacks with the weapon are chaotic-aligned. Damage from the weapon bypasses DR/chaotic and ignores the energy resistance of lawful dragons and lawful outsiders. The anarchic fusion can’t be added to weapons that have the axiomatic fusion.", "prerequisites": "", "level_requirement": 2}, "devistating": {"title": "Devistating", "body": "You can apply the devastating fusion only to a weapon with two or more critical hit effects. When you score a critical hit with a weapon that has the devastating fusion, you can select two of the critical hit effects to apply to the target (even if you are normally required to select just one critical hit effect).", "prerequisites": "", "level_requirement": 5}, "flaming": {"title": "Flaming", "body": "The flaming fusion imbues a weapon with the fiery power of a star. Half the weapon’s damage type is replaced with fire damage. You can activate or deactivate the flaming fusion as a swift action. If the weapon already deals two types of damage, replace one of them with fire (you decide which damage type to replace each time you activate the flaming fusion). You can add this fusion only to a weapon that does not already deal fire damage. This fusion never causes a weapon that normally targets KAC to target EAC.", "prerequisites": "", "level_requirement": 5}, "hybridized": {"title": "Hybridized", "body": "A weapon with the hybridized fusion replaces much of its technological functions with magic counterparts. It gains the analog weapon special property (see page 180), and the core function of the weapon is considered to be a hybrid of magic and technology (rather than only the fusion counting as a hybrid item). A hybridized weapon still consumes ammunition and battery charges normally.", "prerequisites": "", "level_requirement": 1}, "venomous": {"title": "Venomous", "body": "A weapon with the venomous fusion gains the injection weapon special property (see page 181). Only a single attack each day may benefit from this property, and you must announce before making an attack that it is an injection attack. Regardless of how many targets you can hit with a single attack from your weapon, only a single target of your choice is exposed to the drug, medicinal, or poison when you use the injection property in an attack. Only weapons that deal piercing or slashing damage can benefit from this fusion.", "prerequisites": "", "level_requirement": 2}, "merciful": {"title": "Merciful", "body": "A weapon with the merciful fusion often hums pleasantly when at rest and makes soft, airy musical noises when it is used to make an attack. The magic of this fusion subdues the damaging effect of the weapon it is added to. While this fusion is active, the weapon’s regular damage becomes nonlethal damage. If the weapon deals two types of damage, both of the damage types become nonlethal. You can activate or deactivate the merciful fusion as a swift action.", "prerequisites": "", "level_requirement": 2}, "spellthrower": {"title": "Spellthrower", "body": "A weapon with the spellthrower fusion is able to have a single spell gem loaded into it at a time. It takes 1 minute to load a spell gem, and only gems containing a spell with a casting time of one standard action or less and a spell level no greater than one-quarter the weapon’s item level can be loaded into the weapon.\r\n\r\nIf you are proficient with and wielding the weapon, as a full action you can cast the spell contained within the spell gem rather than make a normal attack. This allows you to use the spell gem as if you were a spellcaster with the spell on your class’s spell list.\r\n\r\nUnlike the normal rules for using a spell gem, it does not matter if the gem’s item level is higher than your caster level (even if your caster level is 0). However, if the spell gem’s item level is higher than your base attack bonus, once you’ve spent the full action to cast the spell, you must succeed at an attack roll with the weapon against an AC equal to the spell gem’s level + 1 or you fail to cast the spell. This roll represents your expertise with the weapon, and no actual attack or ammunition is used. If you fail to cast a spell from a spell gem, the spell is expended harmlessly and the spell gem is destroyed.", "prerequisites": "", "level_requirement": 2}, "vorpal": {"title": "Vorpal", "body": "With the vorpal fusion, a weapon can tear between the molecules of a creature. The weapon gains the severe wound critical hit effect (see page 182). If the weapon already has a critical hit effect, when you score a critical hit, you can apply either the weapon’s normal critical hit effect or the severe wound effect. Only a weapon that deals bludgeoning, piercing, or slashing damage can benefit from this fusion.", "prerequisites": "", "level_requirement": 10}, "demand": {"title": "Demand", "body": "You can make a demand of a crew member to try to improve his performance. You grant a +4 bonus to one specific check by succeeding at an Intimidate check (DC = 15 + 1&frac12; × your starship’s tier). You must use this action before the associated check is rolled, and you can grant this bonus to an individual character only once per combat. Demand might result in negative consequences if used on NPCs, and you can’t make demands of yourself.", "prerequisites": null, "level_requirement": null}, "encourage": {"title": "Encourage", "body": "You can encourage another member of the crew to give her a bonus to her action. This works like aid another (see page 133), granting a +2 bonus to the check required by a crew action if you succeed at a DC 10 check using the same skill. Alternatively, you can grant this same bonus by succeeding at a Diplomacy check (DC = 15). You can’t encourage yourself.", "prerequisites": null, "level_requirement": null}, "taunt": {"title": "Taunt", "body": "You can use the communications system to broadcast a taunting message to the enemy vessel. You select an enemy vessel and a phase of combat (engineering, helm, or gunnery), and then attempt a Bluff or Intimidate check (DC = 15 + 1&frac12; × the enemy starship’s tier). If you are successful, each enemy character acting during the selected phase takes a –2 penalty to all checks for 1d4 rounds; the penalty increases to –4 if the enemy’s check is made as part of a push action. Once used against an enemy starship, regardless of the outcome, taunt can’t be used against that starship again during the same combat.", "prerequisites": null, "level_requirement": null}, "orders": {"title": "Orders", "body": "At 6th level, you can grant an additional action to one member of the crew by spending 1 Resolve Point and succeeding at a difficult skill check at the beginning of the phase in which the crew member would normally act. The type of check depends on the role of the crew member targeted: a Computers check for a science officer, an Engineering check for an engineer, a gunnery check (see page 320) for a gunner, and a Piloting check for a pilot. The DC of this check is equal to 15 + 1&frac12; × your starship’s tier. If the check succeeds, the crew member can take two actions in her role this round (both when she would normally act), but she can’t take the same action twice. You can’t give yourself orders", "prerequisites": "Level 6", "level_requirement": null}, "moving speech": {"title": "Moving Speech", "body": "At 12th level, you can spend 1 Resolve Point and use your action to give a moving speech to the crew during one phase of combat with a successful Diplomacy check (DC = 20 + 1&frac12; × your starship’s tier). For the remainder of that phase, your allies can roll twice and take the better result when performing crew actions.", "prerequisites": "12th Level", "level_requirement": null}, "divert": {"title": "Divert", "body": "You can divert auxiliary power into one of your starship’s systems, giving it a boost. This requires a successful Engineering check (DC = 10 + 1&frac12; × your starship’s tier), and the results depend on where you decide to send this extra power. If you send it to the engines, your starship’s speed increases by 2 this round. If you send it to the science equipment, all science officers receive a +2 bonus to their crew actions this round. If you send it to the starship’s weapons, treat each damage die that rolls a 1 this round as having rolled a 2 instead. If you send it to the shields, restore an amount of Shield Points equal to 5% of the PCU rating of the starship’s power core (see page 296), up to the shields’ maximum value. Evenly distribute the restored Shield Points to all four quadrants (putting any excess Shield Points in the forward quadrant).", "prerequisites": null, "level_requirement": null}, "hold it together": {"title": "Hold It Together", "body": "You can hold one system together by constantly patching and modifying it. If you succeed at an Engineering check (DC = 15 + 1&frac12; × your starship’s tier), you can select one system; that system is treated as if its critical damage condition were two steps less severe for the rest of the round (wrecked becomes glitching, and a malfunctioning or glitching system functions as if it had taken no critical damage). This check isn’t modified by penalties from critical damage to the power core.", "prerequisites": null, "level_requirement": null}, "patch": {"title": "Patch", "body": "You can patch a system to reduce the effects of a critical damage condition. The number of actions and the DC of the Engineering check required to patch a system depend on how badly the system is damaged, as indicated on the table on page 324. Multiple engineers can pool their actions in a single round to effect repairs more quickly, but each engineer must succeed at her Engineering check to contribute her action to the patch. The number of actions required can be reduced by 1 (to a minimum of 1 action) by increasing the DC by 5. If you succeed at this check, the severity of the critical damage is unchanged, but it is treated as one step less severe for the remainder of the combat, until 1 hour has passed, or until the system takes critical damage again (which removes the patch and applies the new severity). This action can be taken more than once per round, and this check is not modified by any critical damage to the core.\r\n\r\nCritical Damage Condition | Actions To Patch | DC\r\n:---:|:---:|:---:\r\nGlitching | 1 | 10 + 1&frac12; × your Starship’s tier\r\nMalfunctioning | 2 | 15 + 1&frac12; × your Starship’s tier\r\nWrecked | 3 | 20 + 1&frac12; × your Starship’s tier", "prerequisites": null, "level_requirement": null}, "overpower": {"title": "Overpower", "body": "If you have at least 6 ranks in Engineering, you can spend 1 Resolve Point and attempt an Engineering check (DC = 15 + 1&frac12; × your starship’s tier) to squeeze more out of your ship’s systems. If you’re successful, this functions as the divert action, but you can send extra power to any three systems listed in that action. This action and the divert action can’t be taken in the same round.", "prerequisites": "Engineering, 6 ranks", "level_requirement": null}, "quick fix": {"title": "Quick Fix", "body": "If you have at least 12 ranks in Engineering, you can try to repair a system quickly by spending 1 Resolve Point and attempting an Engineering check (DC = 20 + 1&frac12; × you starship’s tier). If successful, you remove the critical damage condition from one system for 1 hour (allowing it to function as if it had taken no critical damage), after which time it must be repaired as normal.", "prerequisites": "Engineering, 12 ranks", "level_requirement": null}, "fire at will": {"title": "Fire at Will", "body": "(Gunnery Phase, Push)\r\nYou can fire any two starship weapons, regardless of their arc. Each attack is made at a –4 penalty.", "prerequisites": "", "level_requirement": null}, "shoot": {"title": "Shoot", "body": "You can fire one of your starship’s weapons. If you use a turret weapon, you can target a ship in any arc.", "prerequisites": "", "level_requirement": null}, "broadside": {"title": "Broadside", "body": "At 6th level, you can expend 1 Resolve Point to fire all of the starship weapons mounted in one arc (including turret-mounted weapons). Each weapon can target any vessel in that arc. All of these attacks are made with a –2 penalty.", "prerequisites": "6th Level", "level_requirement": null}, "precise targeting": {"title": "Precise Targeting", "body": "At 12th level, you can perform a very precise strike by spending 1 Resolve Point and firing one starship weapon at a single target. If the attack hits and the enemy ship’s shields on that quadrant are depleted before your attack, you deal critical damage to a random system. If the attack would normally cause critical damage, the normal critical damage applies as well (meaning your attack could potentially deal critical damage multiple times; determine which system is damaged as normal each time).", "prerequisites": "12th Level", "level_requirement": null}, "fly": {"title": "Fly", "body": "You move your starship up to its speed and can make any turns allowed by its maneuverability. This doesn’t require a skill check.", "prerequisites": "", "level_requirement": null}, "maneuver": {"title": "Maneuver", "body": "You move your starship up to its speed. You can also attempt a Piloting check (DC = 15 + 1&frac12; × your starship’s tier) to reduce your starship’s distance between turns by 1 (to a minimum of 0).", "prerequisites": null, "level_requirement": null}, "stunt": {"title": "Stunt", "body": "You can attempt any one of the stunts described on page 319. The DCs of the Piloting checks required and the results of success and failure are described in each stunt’s description.", "prerequisites": "", "level_requirement": null}, "full power": {"title": "Full Power", "body": "If you have at least 6 ranks in Piloting, you can spend 1 Resolve Point to move your starship up to 1&frac12; times its speed. You can make turns during this movement, but you add 2 to your starship’s distance between turns.", "prerequisites": "Piloting, 6 ranks", "level_requirement": null}, "audacious gambit": {"title": "Audacious Gambit", "body": "If you have at least 12 ranks in Piloting, you can spend 1 Resolve Point and attempt a Piloting check (DC = 20 + 1&frac12; × your starship’s tier) to pull off complex maneuvers. You can move your starship up to its speed, treating its distance between turns as if it were 2 lower (minimum 0). You can also fly through hexes occupied by enemy vessels without provoking free attacks. At the end of your starship’s movement, you can rotate your starship to face in any direction. If you fail the check, you instead move as if you had taken the fly action (but still lose the Resolve Point).", "prerequisites": "Piloting, 12 ranks", "level_requirement": null}, "balance": {"title": "Balance", "body": "You can balance the shields, redirecting power from one quadrant to protect another. With a successful Computers check (DC = 10 + 1&frac12; × your starship’s tier), you can shift Shield Points (SP) from the shield in one quadrant to the shield in another quadrant, including to depleted shields (after rebalancing, every shield must have at least 10% of the total current SP). Alternatively, you can add up the SP from all the remaining shields and evenly distribute them to all four quadrants, putting any excess SP in the forward quadrant.", "prerequisites": null, "level_requirement": null}, "scan": {"title": "Scan", "body": "You can scan a starship with your sensors to learn information about it. This action requires your starship to have sensors (see page 300). You must attempt a Computers check, applying any modifiers from the starship’s sensors. You can attempt this check untrained. The DC for this check is equal to 5 + 1&frac12; x the tier of the starship being scanned + its bonus from defensive countermeasures (see page 298). If you succeed at this check, you learn the first unknown piece of information on the following list. For every 5 by which you exceed the check, you learn another unknown piece of information. Subsequent checks reveal new pieces of information, continuing down this list.\r\n\r\n1. Basic Information: Living crew complement and ship classification, size, speed, and maneuverability.\r\n2. Defenses: AC, TL, total and current Hull Points, total and current Shield Points in each quadrant, and core PCU value.\r\n3. Weapon: Information about one weapon, including its firing arc and the damage it deals, starting with the weapon that uses the most PCU. Repeat this entry until all the starship’s weapons are revealed.\r\n4. Load: Information about how the starship’s expansion bays are allocated and any cargo the starship might be carrying.\r\n5. Other: Any remaining ship statistics.", "prerequisites": null, "level_requirement": null}, "target system": {"title": "Target System", "body": "You can use your starship’s sensors to target a specific system on an enemy starship. This action requires your starship to have sensors. You must attempt a Computers check, applying any modifiers from the starship’s sensors. The DC equals 5 + 1&frac12; x the tier of the enemy starship + its bonus from defensive countermeasures (see page 298). If you succeed, choose one system (core, engines, life support, sensors, or weapons). The next attack made by your starship that hits the enemy ship scores a critical hit on a natural roll of 19 or 20. If that attack deals critical damage, it affects the chosen system. For any further critical damage resulting from the attack, determine which system is affected randomly as normal. Your starship’s sensors can target only one system on a specific enemy starship at a time, though this action can be used to concurrently target systems on multiple starships.", "prerequisites": null, "level_requirement": null}, "lock on": {"title": "Lock On", "body": "If you have at least 6 ranks in Computers, you can lock your starship’s targeting system on to one enemy vessel. You must spend 1 Resolve Point and attempt a Computers check. The DC equals 5 + 1&frac12; x the tier of the target starship + its bonus from defensive countermeasures (see page 298). If you succeed, your starship’s gunners gain a +2 bonus to gunnery checks against the target for the rest of the round. This action can be taken only once per round.", "prerequisites": "Computers, 6 ranks", "level_requirement": null}, "improve countermeasures": {"title": "Improve Countermeasures", "body": "If you have at least 12 ranks in Computers, you can try to foil enemy targeting arrays and incoming projectiles by spending 1 Resolve Point and attempting a Computers check. The DC equals 5 + 1&frac12; × the tier of the target starship + its bonus from defensive countermeasures (see page 298). If you’re successful, gunners aboard the target starship roll twice and take the worse result for gunnery checks during this round (including checks for tracking weapons).", "prerequisites": "Computers, 12 ranks", "level_requirement": null}, "glide": {"title": "Glide", "body": "You move the starship at half its normal speed. The starship can take turns during this movement, but the starship’s distance between turns increases by 2. You can add your ranks in the Piloting skill to the starship’s AC and TL for this round. You can only take this action if no other pilot actions have been taken during the helm phase (including glide).", "prerequisites": "", "level_requirement": null}, "snap shot": {"title": "Snap Shot", "body": "You can fire one of your starship’s weapons with a –2 penalty to the gunnery check. You can take this action only if no other gunner actions have been taken during the gunnery phase (including snap shot).", "prerequisites": "", "level_requirement": null}}