{"animate dead": {"title": "Animate Dead", "level_requirements": ["Technomancer 4", "Mystic 4"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": null, "targets": "one or more corpses", "effect": null, "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "This spell turns corpses into undead creatures that obey your spoken commands. The undead can be made to follow you, or they can be made to remain in place and attack any creature (or a specific kind of creature) entering the area. They remain animated until they are destroyed. A destroyed undead can’t be animated again.\r\n\r\nYou can create one or more undead creatures with a total CR of no more than half your caster level. You can only create one type of undead with each casting of this spell. Creating undead requires special materials worth 1,000 credits × the total CR of the undead created; these materials are consumed as part of casting the spell.\r\n\r\nThe undead you create remain under your control indefinitely. No matter how many times you use this spell, however, you can control only a number of undead whose total CR is no greater than your caster level. If you exceed this number, all the newly created creatures fall under your control and any excess undead from previous castings become uncontrolled. You choose which creatures are released. Once released, such undead have no particular feelings of loyalty to you, and in time they may grow in power beyond the undead you can create.\r\n\r\nThe corpses you use must be as intact as the typical undead of the type you choose to create. For example, a skeleton can be created only from a mostly intact corpse (that has bones) or skeleton. A zombie can be created only from a creature with a physical anatomy.", "brief_description": "Create controlled undead creatures out of target corpses.", "requires_resolve": false}, "arcane eye": {"title": "Arcane Eye", "level_requirements": ["Technomancer 4"], "school": "divination", "casting_time": "10 minutes", "range": "planetary", "area": null, "targets": null, "effect": "magical sensor", "duration": "1 minute/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You create an invisible magical sensor that sends you visual information. The sensor appears at any point within line of sight, but it can then travel beyond your line of sight without hindrance. An arcane eye travels at 30 feet per round (300 feet per minute) if viewing an area ahead as a humanoid would (primarily looking at the floor) or 10 feet per round (100 feet per minute) if examining the ceiling and walls as well as the floor ahead. The arcane eye sees exactly as you would see if you were there.\r\n\r\nThe arcane eye can travel in any direction as long as the spell lasts. Solid barriers block its passage, but it can pass through a hole or space as small as 1 inch in diameter. The arcane eye can’t enter another plane of existence, even through Drift travel or a magical gate or similar magical portal.\r\nYou must concentrate to use an arcane eye. If you do not concentrate, the sensor is inert until you concentrate again.", "brief_description": "Invisible floating eye moves 30 feet per round and sends you visual information.", "requires_resolve": false}, "arcane sight": {"title": "Arcane Sight", "level_requirements": ["Technomancer 3"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": null, "effect": "", "duration": "1 minute/level (D)", "saving_throw": "", "spell_resistance": "", "description": "This spell allows you to see magic sources within 120 feet of you. The effect is similar to that of a detect magic spell, but arcane sight does not require concentration and discerns information more quickly.\r\n\r\nYou know the location and caster level of all magic sources within your sight. If the magic sources are in line of sight, you can attempt a DC 28 Mysticism check (one check per source) to determine the school of magic involved in each source.\r\nIf you concentrate on a specific creature within 120 feet of you as a standard action, you can determine whether it has any spellcasting or spell-like abilities and the caster level of the most powerful spell or spell-like ability the creature currently has available for use.\r\n\r\nAs with detect magic, you can use this spell to identify the properties of magic items, but not of artifacts.", "brief_description": "Magical sources become visible to you.", "requires_resolve": false}, "arcing surge": {"title": "Arcing Surge", "level_requirements": ["Technomancer 3"], "school": "evocation", "casting_time": "1 standard action", "range": "120 ft.", "area": "line-shaped burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Reflex half", "spell_resistance": "yes", "description": "You cause an electrical device in your possession to surge\r\nin power and unleash a line of electricity from the massive oversurge. This deals 10d6 electricity damage to all creatures and objects in the area.", "brief_description": "Deal 10d6 electricity damage in a 120-foot line.", "requires_resolve": false}, "augury": {"title": "Augury", "level_requirements": ["Mystic 2"], "school": "divination", "casting_time": "1 minute", "range": "personal", "area": "", "targets": null, "effect": "", "duration": "instantaneous", "saving_throw": "", "spell_resistance": "", "description": "Casting augury can tell you whether a particular action will bring good or bad results for you in the immediate future. Casting this spell takes intense personal focus and requires you to spend 1 Resolve Point.\r\n\r\nThe chance for successfully receiving a meaningful reply is 75%; this roll is made secretly by the GM. A question may be so straightforward that a successful result is automatic, or it may be so vague as to have no chance of success. If the augury succeeds, you get one of four results.\r\n\r\n* Weal (if the action will probably bring good results).\r\n* Woe (for bad results).\r\n* Weal and woe (for both).\r\n* Nothing (for actions that have neither especially good nor\r\nespecially bad results).\r\n\r\nIf the augury isn’t successful, you get the “nothing” result.\r\n\r\nA spellcaster who gets the “nothing” result has no way to tell whether it was the consequence of a failed or successful augury.\r\nThe augury can see only about 30 minutes into the future, so anything that might happen beyond that time frame does not affect the result. Thus, the result might not take into account the long-term consequences of a contemplated action. Multiple castings of augury by the same creature about the same topic use the same die result as the first casting.", "brief_description": "Learn whether an action will be good or bad.", "requires_resolve": true}, "battle junkbot": {"title": "Battle Junkbot", "level_requirements": ["Technomancer 6"], "school": "transmutation", "casting_time": "1 round", "range": "touch", "area": "", "targets": "at least 1 bulk of inert electronic equipment; see text", "effect": "", "duration": "1 round/level", "saving_throw": "none", "spell_resistance": "no", "description": "You turn a pile of technological junk into a vicious robot that can hunt down and attack your enemies.\r\n\r\nYou must target inert, nonworking electronic equipment of at least 1 bulk. Valid targets include a large broken computer system, nonworking or unconnected computer or robot parts, a destroyed robot or another such trashed mechanical system, or any related electronic components or combination of the above as long as the junk is found in a large enough quantity. Creating a battle junkbot also requires one ultra-capacity battery. Casting this spell drains all of the battery’s charges.\r\n\r\nWhile casting this spell, you use your magic and technological know-how to rearrange the junked parts and infuse them with aggression and martial skills. A battle junkbot is Small, its KAC and EAC are each equal to 15 + your technomancer level, it has hardness 15, and it has a number of Hit Points equal to half of your own (but no Stamina Points). It uses your saving throw bonuses when it is the target of spells and other targeted effects. It has a land speed of 30 feet and a fly speed of 15 feet with average maneuverability. For purposes of spells and effects that target the junkbot, it is treated as a construct with the magical and technological subtypes.\r\n\r\nThe battle junkbot has four hands. It is treated as if it had the Deadly Aim and Improved Combat Maneuver (Bull Rush, Grapple, Trip) feats. It has an attack bonus equal to 6 + your technomancer level; in one hand it wields a special buzzblade dagger that deals 6d8+6 damage instead of its normal damage, and a second hand carries a special light laser pistol that deals 6d6 damage instead of its normal damage. Damage from the junkbot’s special weapons counts as magic for the purpose of overcoming damage reduction.\r\n\r\nYou can give new basic commands to your battle junkbot telepathically on your turn as a move action, and the junkbot can take actions as if it were a normal creature. You are aware when the robot has made an attack or combat maneuver and whether or not it was successful, as well as when the battle junkbot has been attacked, has taken damage, or is destroyed, but you can perceive nothing else through this basic telepathic link.\r\n\r\nWhen the battle junkbot is destroyed or this spell ends, the electronic equipment you used to create the junkbot falls apart into refuse, its circuitry fried beyond anything recognizable. You cannot use this refuse as a target to create another junkbot.", "brief_description": "Create a temporary robot from random junk, turning it into a deadly combatant.", "requires_resolve": false}, "bestow curse": {"title": "Bestow Curse", "level_requirements": ["Mystic 3"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "permanent", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You place a terrible curse on the target, stealing either its overall competency or its ability to think and act on its feet. Choose one of the following.\r\n\r\n* The target takes a –4 penalty to ability checks, attack rolls, saving throws, and skill checks.\r\n* Each turn, the target has a 50% chance to act normally; otherwise, it takes no action.\r\n\r\nYou can also invent your own curse (see Afflictions on page 414 for a few ideas), but it should be no more powerful than those described above. The curse bestowed by this spell cannot be dispelled, but it can be removed with a break enchantment, miracle, remove affliction, or wish spell.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity. Bestow curse counters remove affliction.", "brief_description": "Target takes –4 penalty to attack rolls, saves, and checks or 50% chance of not acting on each of its turns.", "requires_resolve": false}, "break enchantment": {"title": "Break Enchantment", "level_requirements": ["Technomancer 5", "Mystic 5"], "school": "abjuration", "casting_time": "1 minute", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature per level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "This spell frees victims from curses, enchantments, and transmutations. Break enchantment can reverse even an instantaneous effect. For each such effect, you attempt a caster level check (1d20 + your caster level, maximum +15) against a DC equal to 11 + the caster level of the effect. Success means that the creature is free of the spell, curse, or effect. For a cursed magic item, the DC of the caster level check is equal to the DC of the curse.\r\n\r\nIf the spell is one that can’t be dispelled by dispel magic, break enchantment works only if that spell is 5th level or lower. If the effect comes from a permanent magic item, break enchantment doesn’t remove the curse from the item but it does free the victim from the item’s effects.", "brief_description": "Free creatures from curses, enchantments, and transmutations.", "requires_resolve": false}, "call cosmos": {"title": "Call Cosmos", "level_requirements": ["Mystic 5"], "school": "evocation", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "cylinder (20-ft. radius, 40 ft. high)", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "none", "spell_resistance": "yes", "description": "You evoke a vertical column of dangerous material from across the universe that rains down upon creatures in the area. This matter is made up of bits of burning stars and chunks of frozen comets, and it deals 4d6 fire damage and 3d6 cold damage\r\nto every creature in the area. This damage occurs only once, when the spell is cast. For the spell’s remaining duration, the fallen starstuff makes the entire area difficult terrain, and thick, swirling clouds of particulate space matter magically block vision. This obscures all sight beyond 5 feet, including darkvision and other vision-based senses (including vision-based blindsight and sense through), but doesn’t prevent blindsense. A creature within 5 feet of its attacker has concealment (attacks have a 20% miss chance). Creatures farther away have total concealment (50% miss chance, and the attacker can’t use sight to locate the target). Additionally, the swirling cosmic particles are distracting to spellcasters in the area, who have a 20% chance of losing any spell they attempt to cast in the area. At the end of the duration, the starstuff disappears, leaving no aftereffects (other than the damage dealt).", "brief_description": "Rain cosmic particles on targets, dealing 4d6 fire damage and 3d6 cold damage.", "requires_resolve": false}, "charm monster": {"title": "Charm Monster", "level_requirements": ["Mystic 3"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 day/level", "saving_throw": "", "spell_resistance": "", "description": "This spell functions like charm person, except the effect is not restricted by creature type.", "brief_description": "Make one creature believe it is your ally or one day per level.", "requires_resolve": false}, "charm person": {"title": "Charm Person", "level_requirements": ["Mystic 1"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one humanoid creature", "effect": "", "duration": "1 hour/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This charm makes a humanoid creature regard you as its trusted friend and ally (treat the target’s attitude as friendly). If the creature is currently being threatened or attacked by you or your allies, however, it receives a +5 bonus to its saving throw.\r\n\r\nThe spell does not enable you to control the charmed creature as if it were an automaton. It is unlikely to attempt to harm you, but it is also unlikely to attack any of its true friends or allies. You can try to give the target suggestions, but you must succeed at an opposed Charisma check to convince it to do anything it wouldn’t ordinarily do. (Retries of this check are not allowed.) An affected creature never obeys suicidal or obviously harmful suggestions. Any act by you or your apparent allies that threatens the charmed creature breaks the spell. You must speak the creature’s language to communicate your suggestions, or else be good at pantomiming.", "brief_description": "Make one creature believe it is your ally or one day per level.", "requires_resolve": false}, "clairaudience/clairvoyance": {"title": "Clairaudience/Clairvoyance", "level_requirements": ["Technomancer 3", "Mystic 3"], "school": "divination", "casting_time": "10 minutes", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "", "effect": "magical sensor", "duration": "1 minute/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You create an invisible magical sensor at a specific location that enables you to hear or see (your choice) almost as if you were there. You don’t need line of sight or line of effect to create this sensor in a specific spot within range, but the locale must be either a place that’s familiar to you or an obvious location, such as inside a cave whose entrance you can see.\r\n\r\nThe sensor doesn’t move, but you can rotate it in all directions to view the area as desired. This spell functions only on the plane of existence you are currently occupying.", "brief_description": "Hear or see at a distance for 1 minute per level.", "requires_resolve": false}, "command": {"title": "Command", "level_requirements": ["Mystic 1"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 round", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You give the target one of the following commands, which it obeys to the best of its ability at its earliest opportunity. If the target can’t carry out your command on its next turn, the spell automatically fails.\r\n\r\n* **Approach:** The target moves toward you as quickly and directly as possible for 1 round, taking no other actions and triggering reactions (such as attacks of opportunity) for this movement as normal.\r\n* **Drop:** The target drops whatever it is holding. It can’t pick up any dropped item until its next turn.\r\n* **Fall:** The target falls to the ground and remains prone for 1 round. It can otherwise act normally.\r\n* **Flee:** The target moves away from you as quickly and directly as possible for 1 round, taking no other actions and provoking reactions (such as attacks of opportunity) for this movement as normal.\r\n* **Halt:** The target is dazed for 1 round.", "brief_description": "One creature obeys a select command for 1 round.", "requires_resolve": false}, "command, greater": {"title": "Command, Greater", "level_requirements": ["Mystic 5"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 round/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell functions like command, except you can affect up to one creature per level and the targets continue the specified activity beyond 1 round. At the start of each commanded creature’s action after the first, it can attempt another Will saving throw to break free from the spell. Each creature must receive the same command.", "brief_description": "One creature per level obeys select command for 1 round per level.", "requires_resolve": false}, "command undead": {"title": "Command Undead", "level_requirements": ["Technomancer 2", "Mystic 2"], "school": "necromancy", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one undead creature", "effect": "", "duration": "1 day/level", "saving_throw": "Will negates, see text", "spell_resistance": "yes", "description": "This spell allows you a degree of control over an undead creature. If the target is intelligent, it perceives your words and actions favorably (treat its attitude as friendly). It will not attack you while the spell lasts. You can give the target suggestions, but you must succeed at an opposed Charisma check to convince it to do anything it wouldn’t ordinarily do. (Retries are not allowed.) An intelligent commanded undead never obeys suicidal or obviously harmful suggestions, but it might be convinced that something very dangerous is worth doing.\r\n\r\nAn unintelligent undead creature gets no saving throw against this spell. When you control a mindless being, you can communicate only basic commands, such as “Come here,” “Go there,” “Fight,” “Stand still,” and so on. Unintelligent undead won’t resist suicidal or obviously harmful orders.\r\n\r\nAny act by you or your apparent allies that threatens the commanded undead (regardless of its Intelligence) breaks the spell. You command the undead creature by voice and it understands you, no matter what language you speak.", "brief_description": "Undead creature obeys your commands.", "requires_resolve": false}, "commune with nature": {"title": "Commune With Nature", "level_requirements": ["Mystic 5"], "school": "divination", "casting_time": "10 minutes", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "", "spell_resistance": "", "description": "You become one with nature, attaining knowledge of the surrounding territory. You instantly gain knowledge of up to three facts from among the following subjects: the ground or terrain, plants, minerals, bodies of water, people, general animal population, presence of native creatures, presence of powerful unnatural creatures, or general state of the natural setting.\r\n\r\nIn outdoor settings, the spell operates in a radius of 1 mile per caster level. In natural underground settings—caves, caverns, and the like—the spell is less powerful and its radius is limited to 100 feet per caster level. The spell does not function where nature has been replaced by construction or settlements, such as in cities, factories, and starships.", "brief_description": "Learn about terrain for 1 mile per level.", "requires_resolve": false}, "comprehend languages": {"title": "Comprehend Languages", "level_requirements": ["Technomancer 1"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "10 minutes/level", "saving_throw": "", "spell_resistance": "", "description": "You can understand the spoken or signed words of creatures or read otherwise incomprehensible written or tactile messages. The ability to read does not necessarily impart insight into the material, merely its literal meaning. The spell enables you to understand or read an unknown language, not speak or write it. You can’t use this spell to read magic writing or encoded messages (though it does reveal if a message is magic or encoded), but you can use it to read raw computer code or foreign programming languages, allowing you to understand enough to attempt Computers checks on those materials without penalties.", "brief_description": "", "requires_resolve": false}, "confusion": {"title": "Confusion", "level_requirements": ["Mystic 4"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "15-ft.-radius burst", "targets": "", "effect": "", "duration": "1 round/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell causes confusion in all creatures in the area, making them unable to determine their actions. Any confused creature that is attacked automatically attacks or attempts to attack its attackers on its next turn, as long as it is still confused at the start of its next turn. Note that a confused creature will not make attacks of opportunity against any foe that it is not already devoted to attacking (either because of its most recent action or because it has just been attacked). For confused creatures that have not been attacked, roll on the following table at the start of each affected creature’s turn each round to see what it does in that round.\r\n\r\nd% | Behavior\r\n:---:|:---:\r\n1–25 | Act normally.\r\n26–50 | Do nothing but babble incoherently.\r\n51–75 | Deal 1d8 + Str modifier damage to self with item in hand.\r\n76–100 | Attack nearest creature.\r\n\r\nA confused creature that can’t carry out the indicated action does nothing but babble incoherently. Attackers are not at any special advantage when attacking a confused target.", "brief_description": "", "requires_resolve": false}, "confusion, lesser": {"title": "Confusion, Lesser", "level_requirements": ["Mystic 1"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 round", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell causes a single creature to become confused (as per the confusion spell) for 1 round.", "brief_description": "", "requires_resolve": false}, "contact other plane": {"title": "Contact Other Plane", "level_requirements": ["Technomancer 5", "Mystic 5"], "school": "divination", "casting_time": "10 minutes", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "concentration", "saving_throw": "", "spell_resistance": "", "description": "You send your mind to another plane of existence (an Elemental Plane or some plane further removed) in order to receive advice and information from powers there. The powers reply in a language you understand, but they resent such contact and give only brief answers to your questions. All questions are answered with “Yes,” “No,” “Maybe,” “Never,” “Irrelevant,” or some other one-word answer.\r\n\r\nYou must concentrate on maintaining the spell in order to ask questions at the rate of one per round. A question is answered by the power during the same round. You can ask one question for every 2 caster levels. On rare occasions, this divination may be blocked by an act of certain deities or forces.\r\nContacting a minor planar power is relatively safe but may not result in useful answers. For each question you ask, the GM secretly rolls 1d20.\r\n\r\n* **1–2:** The power gives you no answer, the spell ends, and you must attempt a DC 7 Intelligence check. On a failed check, your Intelligence and Charisma scores each fall to 8 for a week and you are unable to cast spells for that period.\r\n* **3–5:** You receive a random answer to the question.\r\n* **6–10:** You receive an incorrect answer to the question. Based on the nature and needs of the creature contacted, this may be a lie designed to harm you.\r\n* **11–15:** You receive no answer to the question.\r\n* **16 or More:** You receive a truthful and useful one-word answer. If the question can’t be truthfully answered in this way, no answer is received.\r\n\r\nContact with minds further removed from your home plane increases the probability that you will incur a decrease in Intelligence and Charisma due to your brain being overwhelmed by the power’s sheer strangeness and force, but it also increases the chance of the power knowing the answer and answering correctly. You can add any value from +1 to +5 to the d20 roll to represent contacting increasingly powerful planar beings. However, on a roll of 1 or 2, the result is still no answer, the spell ends, and you must attempt an Intelligence check to avoid losing Intelligence and Charisma. The DC of this Intelligence check is increased by the same amount added to the d20 check to contact a planar creature.", "brief_description": "", "requires_resolve": false}, "control gravity": {"title": "Control Gravity", "level_requirements": ["Technomancer 6", "Mystic 6"], "school": "transmutation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "up to one 10-ft. cube/2 levels (S)", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Fortitude negates, see text;", "spell_resistance": "no", "description": "You can control gravity in an area, causing it to reverse, become zero-g, or become extremely strong. A creature or object within the area that succeeds at its saving throw is unaffected (though if it stays in the area, it must succeed at a new save each round or become affected), but it might still suffer secondary effects (such as an object flying up from reversed gravity, or an object falling upon it when the spell ends). You choose how to have this spell affect gravity when you cast it, and you cannot change it without recasting the spell. If two control gravity spells affect the same area, they negate each other in the area of overlap.\r\n\r\nIf you reverse gravity in an area, you cause unattached objects and creatures in the area to fall upward and reach the top of the affected area in 1 round. If a solid object (such as a ceiling) is encountered in this fall, falling objects and creatures strike it in the same manner as they would during\r\na normal downward fall. If an object or creature reaches the top of the spell’s area without striking anything, it remains there, oscillating slightly, until the spell ends. At the end of the spell’s duration, affected objects and creatures fall downward. Creatures who can fly or levitate can keep themselves from falling in either direction.\r\n\r\nIf you increase gravity in the area, creatures and objects weigh twice as much as normal, move at half speed, can jump only half as far as normal, and can lift and carry only half as much as normal. Any flying target has its maneuverability worsened by one step (from average to clumsy, for example; minimum clumsy) and plummets to the ground unless it succeeds at a DC 25 Acrobatics check to fly to remain in the air.\r\n\r\nAn area of zero-g works like the zero-g environment (see page 402). You can also use this spell to make areas of zero-g, heavy gravity, or light gravity act as normal gravity for the duration (see page 402).", "brief_description": "", "requires_resolve": false}, "control machines": {"title": "Control Machines", "level_requirements": ["Technomancer 5"], "school": "transmutation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "constructs of the technological subtype with individual CRs no greater than your level + 1 and a total CR no greater than twice", "effect": "", "duration": "concentration, up to 1 round/level", "saving_throw": "Will negates", "spell_resistance": "no", "description": "You wrest control of the target constructs and command them telepathically. You can issue commands to any number of controlled constructs on your turn, beginning when you cast this spell, as part of the concentration required to sustain its duration (a standard action).\r\n\r\nIf any of the constructs are under the control of a hostile creature, that controlling creature can attempt a Will saving throw (DC equal to this spell’s) to negate this spell’s effect. Each construct under the control of another creature grants its controlling creature a separate saving throw to negate the effect for that construct.\r\n\r\nWhile this spell is in effect, the affected constructs follow any command you give them, even if it would be dangerous to the controlled constructs. At the end of the spell, the constructs revert to their normal behavior. If they are intelligent, they know and remember that you used magic to control them.", "brief_description": "", "requires_resolve": false}, "control undead": {"title": "Control Undead", "level_requirements": ["Technomancer 6", "Mystic 6"], "school": "necromancy", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "undead creatures with individual CRs no greater than your level + 1 and a total CR no greater than twice your level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell enables you to control undead creatures for a short period of time. You command them by voice and they understand you, no matter what language you speak. No matter what, the controlled undead do not attack you. At the end of the spell, the targets revert to their normal behavior.\r\nIf any of the undead are under the control of a hostile creature, that controlling creature can attempt a Will saving throw (DC = the spell’s DC) to negate this spell’s effect if the creature failed its initial saving throw. Each undead under the control of another creature grants its controlling creature a separate saving throw to negate the effect for that undead.\r\n\r\nIntelligent undead creatures remember that you controlled them, and they may seek revenge after the spell’s duration ends.", "brief_description": "", "requires_resolve": false}, "corrosive haze": {"title": "Corrosive Haze", "level_requirements": ["Technomancer 4"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "", "effect": "5-ft.-diameter cloud of acid", "duration": "1 round/level", "saving_throw": "Reflex negates", "spell_resistance": "yes", "description": "A 5-foot cloud of acid-resistant nanites continually converts nearby water vapor into deadly acid. You can create the cloud in the same square as a creature and move it up to 30 feet in any direction as a move action on your turn. If the cloud enters (or is created in) a square containing a creature, it can’t move any farther that round and deals 4d6 acid damage to that creature (Reflex negates). The acidic cloud also corrodes any unattended objects along its path, dealing them 4d8 acid damage.\r\n\r\nIf you don’t move the cloud, it remains where it is; if it shares its square with any creature at the beginning of your turn, that creature must succeed at a Reflex save or take 4d8 acid damage. Any creature that takes damage from the cloud takes 10 additional acid damage at the end of its next turn.", "brief_description": "", "requires_resolve": false}, "cosmic eddy": {"title": "Cosmic Eddy", "level_requirements": ["Mystic 4"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "20-ft.-radius spread", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Reflex partial, see text", "spell_resistance": "yes", "description": "You pull dormant mystical energy from the land and objects around you and use it to create a swirling eddy that batters your foes and can hinder their movement. The eddy deals 4d6 bludgeoning damage to each creature in the area. Additionally, creatures in the area are knocked prone and are reduced to half speed while the spell is in effect. A creature that succeeds at a Reflex save takes only half damage and is not knocked prone, but it is still reduced to half speed. Flying creatures within the eddy’s area must attempt an Acrobatics check to fly (DC equals the spell’s save DC) each round. Failure means the creature cannot move for that round.\r\n\r\nThe spell deals damage and knocks creatures prone only once. However, if a creature leaves the spell’s area and then returns, it is subject to the damage and other effects described above again (and can attempt another Reflex saving throw). Similarly, if a creature is not in this spell’s area when it is first cast but later moves into it, it is subject to the damage and other effects described above.\r\n\r\nSmall, unattended items (no more than light bulk) are also thrown around in the eddy’s area. At the end of the spell’s duration, such items land in a randomly determined space within the spell’s area.", "brief_description": "", "requires_resolve": false}, "creation": {"title": "Creation", "level_requirements": ["Technomancer 4", "Technomancer 5"], "school": "conjuration", "casting_time": "1 minute", "range": "0 ft.", "area": "", "targets": "", "effect": "one nonmagical, nontechnological object of nonliving matter, up", "duration": "see text", "saving_throw": "none", "spell_resistance": "no", "description": "You create a nonmagical, nontechnological, unattended object of nonliving matter. The volume of the item created can’t exceed 1 cubic foot (or 1 bulk) per caster level. You must succeed at an appropriate Engineering or Profession check to make a complex item, and you can’t create a consumable item.\r\n\r\n* **4th:** When you cast creation as a 4th-level spell, it creates an object made out of vegetable matter (such as wood) that has an item level no greater than one-third your caster level. The duration is 1 hour per caster level.\r\n* **5th:** When you cast creation as a 5th-level spell, it creates an object made out of vegetable matter or material of a mineral nature: crystal, metal, stone, or the like. The object can’t have an item level greater than half your caster level. The duration depends on the hardness and rarity of the created object, as indicated on the following table.\r\n\r\nHardness and Rarity Examples | Duration\r\n:---:|:---:\r\nVegetable matter | 2 hours/level\r\nStone, crystal, base metals | 1 hour/level\r\nPrecious metals | 20 minutes/level\r\nGems | 10 minutes/level\r\nRare metals* | 1 round/level\r\n\r\n* Includes adamantine, alchemical silver, mithral, and skymetal\r\nalloys. You can’t use a 5th-level creation spell to create a cold iron item", "brief_description": "", "requires_resolve": false}, "crush skull": {"title": "Crush Skull", "level_requirements": ["Mystic 5"], "school": "necromancy", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude partial", "spell_resistance": "yes", "description": "You manipulate the energy that swirls around the target’s head, pulling it inward and potentially crushing its skull. You must make a ranged attack against the target’s EAC to ensure this spell hits the necessary weak spots in the target’s head, but you can add your key ability score modifier to this attack roll instead of your Dexterity modifier if it is higher. If you hit and the target fails a Fortitude saving throw, it takes 18d8 damage. If the target succeeds at its saving throw, it instead takes 4d8 damage. The target might die from damage even if it succeeds at its saving throw; in this case, the spell is not a death effect. This spell has no effect against living creatures that don’t have an anatomical head.", "brief_description": "", "requires_resolve": false}, "dancing lights": {"title": "Dancing Lights", "level_requirements": ["Technomancer 0"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "", "effect": "up to four lights", "duration": "1 minute (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You create up to four lights that resemble small headlights or flashlights. The dancing lights must stay within a 10-foot-radius area in relation to each other but otherwise move as you desire: forward or back, up or down, straight or turning corners, or the like. The lights can move up to 100 feet per round. A light winks out if the distance between you and it exceeds the spell’s range.\r\n\r\nYou can have only one dancing lights spell active at a time. If you cast this spell while another casting is still in effect, the previous casting is dispelled.", "brief_description": "", "requires_resolve": false}, "darkvision": {"title": "Darkvision", "level_requirements": ["Technomancer 2", "Mystic 2"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature or camera", "effect": "", "duration": "1 hour/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target gains the ability to see 60 feet even in total darkness. Darkvision is black and white only but otherwise like normal sight.", "brief_description": "", "requires_resolve": false}, "daze": {"title": "Daze", "level_requirements": ["Technomancer 0", "Mystic 0"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one humanoid creature of CR 3 or lower", "effect": "", "duration": "1 round", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell short-circuits the mind of a humanoid creature with a CR of 3 or lower so that it is dazed (unable to take actions, but taking no penalty to AC). Humanoids of CR 4 or higher are not affected. After a creature has been dazed by this spell, it is immune to it for 1 minute.", "brief_description": "", "requires_resolve": false}, "daze monster": {"title": "Daze Monster", "level_requirements": ["Technomancer 2", "Mystic 2"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one living creature of CR 5 or lower", "effect": "", "duration": "1 round", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell functions like daze, but it can affect any one living creature of any type up to CR 5. Creatures of CR 6 or higher are not affected.", "brief_description": "", "requires_resolve": false}, "death ward": {"title": "Death Ward", "level_requirements": ["Mystic 4"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one living creature", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target gains a +4 morale bonus to saving throws against all spells and effects with the death descriptor. The target can attempt a save to negate such effects even if one is not normally allowed. The target can’t gain negative levels and is immune to any negative energy effects. This spell does not remove negative levels the target has already gained, but it does remove the penalties from negative levels for the duration of its effect.\r\n\r\nDeath ward does not protect against other sorts of attacks, even if those attacks might be lethal.", "brief_description": "", "requires_resolve": false}, "deep slumber": {"title": "Deep Slumber", "level_requirements": ["Mystic 3"], "school": "enchantment", "casting_time": "1 round", "range": "close (25 ft. + 5 ft./2 levels)", "area": "one or more living creatures with a total CR of 8 or lower, all", "targets": "", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "This spell causes living creatures in the area to fall into a magical sleep, gaining the asleep condition (except normal noise doesn’t wake up the sleeping creatures). Creatures with the lowest CR are affected first. Among creatures of equal CR, those who are closest to the spell’s point of origin are affected first. Deep slumber doesn’t affect unconscious creatures, constructs, or undead creatures.", "brief_description": "", "requires_resolve": false}, "detect affliction": {"title": "Detect Affliction", "level_requirements": ["Technomancer 0", "Mystic 0"], "school": "divination", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature or object", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes (harmless)", "description": "You determine whether a creature or object has been poisoned, is diseased, is cursed, or is suffering a similar affliction. If the target is poisoned or diseased, you automatically detect that fact and can determine the exact type of poison or disease with a successful DC 20 Intelligence or Wisdom check. If you are trained in Life Science or Medicine (depending on the nature of the poison or disease), you can attempt a DC 20 check of that skill if you fail your Wisdom or Intelligence check. If the target is cursed or suffering from a similar affliction, you must succeed at a DC 20 Intelligence or Wisdom check to determine that fact. You can then determine the exact nature of the curse with a successful DC 25 Mysticism check.", "brief_description": "", "requires_resolve": false}, "detect magic": {"title": "Detect Magic", "level_requirements": ["Technomancer 0", "Mystic 0"], "school": "divination", "casting_time": "1 standard action", "range": "60 ft.", "area": "cone-shaped emanation", "targets": "", "effect": "", "duration": "concentration, up to 1 minute/level", "saving_throw": "none", "spell_resistance": "no", "description": "You detect all magic spells, effects, items, and objects (including those on or affecting creatures you can see), as well as hybrid items, in the area. You can’t detect magical traps in this way, as they are created with additional magic that wards them from this common spell. Each round you concentrate on the same area, you can determine if one magic source you detect is from a spell, magic item, or other effect, and the caster level (or item level) of the effect. You can’t determine if there are magic sources in areas you can’t see, or if there was a magic source in an area at one time but that has since expired.", "brief_description": "", "requires_resolve": false}, "detect radiation": {"title": "Detect Radiation", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "divination", "casting_time": "1 standard action", "range": "120 ft.", "area": "120-ft. spherical emanation centered on you", "targets": "", "effect": "", "duration": "10 minutes/level", "saving_throw": "none", "spell_resistance": "no", "description": "You detect radiation in the surrounding area, and you can determine the specific intensity of the radiation of one area or object within the spell’s area each round without taking an action (see Radiation on page 403 for more details). The spell can penetrate barriers, but 3 feet of dirt or wood, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or any force field blocks it.", "brief_description": "", "requires_resolve": false}, "detect tech": {"title": "Detect Tech", "level_requirements": ["Technomancer 1"], "school": "divination", "casting_time": "1 standard action", "range": "60 ft.", "area": "cone-shaped burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "You detect all technological items (even hybrid items) with charges or that replenish charges in the area, including batteries, power cells, and generators (as well as such items that are on creatures you can see, even if the creatures have hidden those items on themselves). You can’t determine if there are technological items in areas you can’t see, nor can you detect technological traps in this way.\r\nThe information this spell provides allows you to differentiate between charged items and items that replenish charges, but it does not provide any further information nor does it tell you, for example, how many charges an item currently has or how many maximum charges it can hold. This spell can penetrate barriers, but 3 feet of dirt or wood, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or any force field blocks it.", "brief_description": "", "requires_resolve": false}, "detect thoughts": {"title": "Detect Thoughts", "level_requirements": ["Mystic 1"], "school": "divination", "casting_time": "1 standard action", "range": "60 ft.", "area": "cone-shaped emanation", "targets": "", "effect": "", "duration": "concentration, up to 1 minute/level", "saving_throw": "Will negates, see text", "spell_resistance": "no", "description": "You detect the surface thoughts of intelligent creatures around you. The amount of information revealed depends on how long you study a particular area or target.\r\n\r\n* **1st Round:** You detect the presence or absence of thoughts from conscious creatures that have Intelligence scores of at least 1 (or an Intelligence modifier of –5) or higher.\r\n* **2nd Round:** You detect the number of thinking minds and the Intelligence score (or modifier) of each. If the highest Intelligence score is 26 (or a modifier of +8) or higher and at least 10 points higher than your own Intelligence score (or 5 points higher than your own Intelligence modifier), you are stunned for 1 round and the spell ends. This spell doesn’t let you determine the location of the thinking minds if you can’t see the creatures whose thoughts you are detecting.\r\n* **3rd Round:** You can read the surface thoughts of any mind in the area. A target who succeeds at its Will save prevents you from reading its thoughts, and you must cast detect thoughts again to have another chance. Creatures of animal intelligence (an Intelligence score of 1 or 2 or an Intelligence modifier of –4 or lower) have simple, instinctual thoughts.\r\n\r\nEach round, you can turn to detect thoughts in a new area. The spell can penetrate barriers, but 3 feet of dirt or wood, 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or any force field blocks it.", "brief_description": "", "requires_resolve": false}, "dimension door": {"title": "Dimension Door", "level_requirements": ["Technomancer 4"], "school": "conjuration", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "you and touched objects or touched willing or unconscious creatures", "effect": "", "duration": "instantaneous", "saving_throw": "none, Will negates (object)", "spell_resistance": "no, yes (object)", "description": "You instantly transfer yourself from your current location to any other spot within range. You always arrive at exactly the spot desired—whether by simply visualizing the area or by stating its direction. You can bring along objects as long as their weight doesn’t exceed your maximum load. You can also bring up to four additional willing or unconscious Medium or smaller creatures (carrying gear or objects up to their maximum load) or their equivalent. A Large creature counts as two Medium creatures, and a Huge creature counts as two Large creatures. All creatures to be transported must be in contact with one another, and at least one of those creatures must be in contact with you. After using this spell, you can’t take any other actions until your next turn (and each creature traveling with you can’t take any other actions until its next turn).\r\n\r\nIf you arrive in a place that is already occupied by a solid body, you and each creature traveling with you each take 1d6 damage and are shunted to a random open space on a suitable surface within 100 feet of the intended location. If there is no free space within 100 feet, you and each creature traveling with you take 2d6 additional damage and are shunted to a free space within 1,000 feet. If there is no free space within 1,000 feet, you and each creature traveling with you take 4d6 additional damage and the spell simply fails.", "brief_description": "", "requires_resolve": false}, "discern lies": {"title": "Discern Lies", "level_requirements": ["Mystic 4"], "school": "divination", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "concentration, up to 1 round/level", "saving_throw": "Will negates", "spell_resistance": "no", "description": "Each round, you concentrate on one target within range. You know if the target deliberately and knowingly speaks a lie by discerning disturbances in its aura caused by lying. The spell does not reveal the truth or uncover unintentional inaccuracies, and it doesn’t necessarily reveal evasions. Each round, you can concentrate on a different target.", "brief_description": "", "requires_resolve": false}, "discharge": {"title": "Discharge", "level_requirements": ["Technomancer 3"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature or technological object", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (object)", "spell_resistance": "no", "description": "You can dissipate the charges from one technological object, temporarily depower one electrically powered technological object that does not use charges, or severely hinder a construct with the technological subtype. If the spell targets an object with charges, the object loses all of its remaining charges. If the object is powered by electrical means other than charges, its functions are suppressed for 1d4 rounds. If the spell targets a creature not of the technological subtype, it affects a random charged or electrically powered item in that creature’s possession. If the target is a construct with the technological subtype, it is staggered and cannot use any energy-based attacks for 1d4 rounds. A construct with the technological subtype that is affected by this spell can attempt a Fortitude saving throw at the end of each round to shrug off the effect.", "brief_description": "", "requires_resolve": false}, "disguise self": {"title": "Disguise Self", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "illusion", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "10 minutes/level (D)", "saving_throw": "", "spell_resistance": "", "description": "You make yourself—and any clothing, armor, weapons, and equipment on you—look different. You can seem up to 1 foot shorter or taller, thin, fat, or in between. You can’t change your creature type (although you can appear as another subtype). Otherwise, the extent of the apparent change is up to you. You could merely add or obscure a minor feature, or you could look like an entirely different person or gender.\r\n\r\nThe spell does not provide the abilities or mannerisms of the chosen form nor does it alter the perceived tactile (touch) or audible (sound) properties of you or your equipment.\r\n\r\nIf you use this spell to create a disguise, you gain a +10 circumstance bonus to the Disguise check (since it counts as altering your form). A creature that interacts with you directly can attempt a Will saving throw to recognize your appearance as an illusion.", "brief_description": "", "requires_resolve": false}, "disintegrate": {"title": "Disintegrate", "level_requirements": ["Technomancer 6"], "school": "transmutation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature or object, or up to a 10-ft. cube of nonliving matter", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude partial (object)", "spell_resistance": "yes", "description": "Immense power shoots from your finger, with the potential to disintegrate a target where it stands.\r\n\r\nWhen you cast this spell, a thin, green ray springs from your pointing finger. You must make a ranged attack against your target’s EAC, but you can add your key ability score bonus to this attack instead of your Dexterity modifier if it is higher. If you hit, the target takes 14d20 damage. Any creature reduced to 0 Hit Points by this spell is entirely disintegrated, leaving behind only a trace of fine dust. A disintegrated creature’s equipment is unaffected. Only one target is affected per casting of this spell.\r\n\r\nWhen used against an object, the ray simply disintegrates as much as a 10-foot cube of nonliving matter. Thus, the spell disintegrates only part of any very large object or structure targeted. The ray affects even objects constructed entirely of force, but it does not affect other magical effects that are not an object, creature, or force effect.\r\n\r\nA creature or object that succeeds at a Fortitude saving throw is partially affected, taking only 4d20 damage. If this damage reduces the creature or object to 0 Hit Points, the target is entirely disintegrated.", "brief_description": "", "requires_resolve": false}, "dismissal": {"title": "Dismissal", "level_requirements": ["Technomancer 5", "Technomancer 4", "Mystic 4", "Mystic 5"], "school": "abjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "see text", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates, see text", "spell_resistance": "yes", "description": "The spell instantly forces one or more extraplanar creatures off your current plane, whisking them away instantly—usually to the creature’s home plane, but there is a 20% chance of sending the target to a random plane other than its own. You can improve the spell’s chance of success by presenting one object or substance that the target fears, hates, or otherwise opposes; you gain a +1 circumstance bonus to your caster level check to overcome the target’s spell resistance (if any), and\r\nthe save DC of the spell increases by 2. At the GM’s discretion, certain rare items might work twice as well, providing a +2 circumstance bonus to the caster level check to overcome spell resistance and increasing the spell’s save DC by 4.\r\n\r\n* **4th:** When you cast dismissal as a 4th-level spell, it affects one extraplanar creature.\r\n* **5th:** When you cast dismissal as a 5th-level spell, it affects\r\na number of extraplanar creatures whose total CR can’t exceed your level + 2, no two of which can be more than 30 feet apart.", "brief_description": "", "requires_resolve": false}, "dispel magic": {"title": "Dispel Magic", "level_requirements": ["Technomancer 3", "Mystic 3"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature, object, spell, or spellcaster", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "You can use dispel magic to end one ongoing spell that has been cast on a creature or object, to temporarily suppress the magical abilities of a magic item, or to counter another spellcaster’s spell. A dispelled spell ends as if its duration had expired. Some spells, as detailed in their descriptions, can’t be defeated by dispel magic. Dispel magic can dispel (but not counter) spell-like abilities just as it does spells. The effect of a spell with an instantaneous duration can’t be dispelled.\r\nYou choose to use dispel magic in one of two ways: as a targeted dispel or as a counter.\r\n\r\n**Targeted Dispel:** One creature, object, or spell is the target of the dispel magic spell. You can also use a targeted dispel to specifically end one spell affecting the target or one spell affecting an area (such as zone of truth). You must name the specific spell effect to be targeted in this way or otherwise uniquely identify it (such as “that burning wall” or “the spell that’s giving him those duplicates”). Attempt a dispel check (1d20 + your caster level) with a DC equal to 11 + the spell’s caster level. If you succeed, the spell ends. If you don’t specify a spell and there is more than one possible spell on the target, your targeted dispel attempts to dispel a spell at random.\r\n\r\nIf you target a force, an object, or a creature that is the effect of an ongoing spell (such as unseen servant), you attempt a dispel check to end the spell that conjured the object or creature.\r\n\r\nIf the object that you target is a magic item, you attempt a dispel check against the item level (DC = 11 + the item level). If you succeed, all the item’s magical properties are suppressed for 1d4 rounds, after which the item recovers its magical properties. A suppressed item becomes nonmagical for the duration of the effect. A magic item’s nonmagical physical properties are unchanged: a suppressed holy laser pistol is still a laser pistol. Artifacts and deities are unaffected by mortal magic such as this.\r\n\r\nYou can choose to automatically succeed at your dispel check against any spell you have cast.\r\n\r\n* **Counter:** You can use the energy of dispel magic to disrupt the casting of other spells. First, select an opponent and take the ready action (see page 249) to cast dispel magic when that target casts a spell. This is considered a purely defensive action. When that readied action is triggered, you cast dispel magic\r\nand must attempt a dispel check (1d20 + your caster level) to counter the other spellcaster’s spell. The DC is equal to 11 + the other spellcaster’s caster level. If the check is successful and the target is in range, the spell fails and has no result.", "brief_description": "", "requires_resolve": false}, "dispel magic, greater": {"title": "Dispel Magic, Greater", "level_requirements": ["Technomancer 5", "Mystic 5"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature, object, spell, or spellcaster; or a 20-ft.-radius burst", "effect": "", "duration": "instantaneous", "saving_throw": "", "spell_resistance": "", "description": "This spell functions like dispel magic, except it can end more than one spell on a target and it can be used to target multiple creatures. You choose to use greater dispel magic in one of three ways: a targeted dispel, an area dispel, or a counter.\r\n\r\n**Targeted Dispel:** This functions as a targeted dispel magic, but you can dispel one spell for every 4 caster levels you have, attempting a separate dispel check for each spell. Additionally, greater dispel magic has a chance to dispel any curse that remove affliction can remove, even if dispel magic can’t dispel that effect. The DC of this check is equal to the curse’s DC.\r\n\r\n**Area Dispel:** When greater dispel magic is used in this way, the spell affects everything within a 20-foot-radius burst. Attempt one dispel check and apply that check to each creature or object in the area, as if it were targeted by dispel magic.\r\n\r\nIf you don’t specify spells and there is more than one possible spell on the target, your targeted dispel attempts to dispel spells at random. Magic items themselves are not affected by an area dispel but additional magical effects on them may be dispelled.\r\n\r\nFor each ongoing spell effect whose point of origin is within the area of the greater dispel magic spell, apply the result of the dispel check to dispel the spell. For each ongoing spell whose area overlaps that of the greater dispel magic spell, apply the result of the dispel check to end the effect, but only within the overlapping area.\r\n\r\nIf an object or a creature that is the effect of an ongoing spell is in the area, apply the result of the dispel check to end the spell that conjured that object or creature (returning it whence it came) in addition to attempting to dispel one spell targeting the creature or object.\r\n\r\nYou can choose to automatically succeed at your dispel check against any spell you have cast.\r\nCounter: This functions as countering with dispel magic, but you receive a +4 bonus to your dispel check to counter the other spellcaster’s spell.", "brief_description": "", "requires_resolve": false}, "displacement": {"title": "Displacement", "level_requirements": ["Technomancer 3"], "school": "illusion", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target of this spell appears to be about 2 feet away from its true location. The creature benefits from a 50% miss chance as if it had total concealment. Unlike actual total concealment, displacement doesn’t prevent enemies from targeting the creature normally. True seeing reveals the target’s true location and negates the miss chance. If a creature with blindsense can also see the displaced creature, the visual and blindsense information combined are enough for the creature with blindsense to attack the displaced creature without a miss chance, unlike normal for blindsense.", "brief_description": "", "requires_resolve": false}, "divination": {"title": "Divination", "level_requirements": ["Mystic 4"], "school": "divination", "casting_time": "10 minutes", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "", "spell_resistance": "", "description": "Similar to _augury_ but more powerful, a divination spell can provide you with a useful piece of advice in reply to a question concerning a specific goal, event, or activity that is to occur within 1 week. Casting this spell requires you to expend 1 Resolve Point. The advice granted by the spell can be as simple as a short phrase, or it might take the form of a cryptic rhyme or omen. If you don’t act on the information, the conditions may change so that the information is no longer useful. The chance for a correct divination is 75%. If the die roll fails, you know the spell failed, unless specific magic yielding false information is at work.\r\n\r\nAs with _augury_, multiple castings of divination about the same topic by the same caster use the same die result as the first divination spell and yield the same answer each time.", "brief_description": "", "requires_resolve": false}, "dominate person": {"title": "Dominate Person", "level_requirements": ["Mystic 5"], "school": "enchantment", "casting_time": "1 round", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one humanoid", "effect": "", "duration": "1 day/level; see text", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You fire a bright purple ray at your target, making a ranged attack against your target’s EAC, but you can add your key ability score bonus to this attack instead of your Dexterity modifier if it is higher.\r\nIf you hit and your target fails its Will saving throw, you establish a telepathic link with the target’s mind and can control its actions. If you and the target have a common language, you can generally force the target to perform as you desire, within the limits of its abilities. If no common language exists, you\r\ncan communicate only basic commands, such as “Come here,” “Go there,” “Fight,” and “Stand still.” You know what the target is experiencing, but you don’t receive direct sensory input from it, nor can it communicate with you telepathically. Once you have given a dominated creature a command, it continues to attempt to carry out that command to the exclusion of all other activities except those necessary for day-to-day survival (such as sleeping, eating, and so forth). Changing your orders or giving a dominated creature a new command is a move action.\r\n\r\nBy concentrating fully on the spell (a standard action), you can receive full sensory input as interpreted by the mind of the target, though it still can’t communicate with you. You don’t actually see through the target’s eyes, but you still get a good idea of what’s going on.\r\n\r\nThe target resists this control, and any target forced to take actions against its nature can attempt a new saving throw with a +2 bonus. Obviously self-destructive orders are not carried out. Once control is established, the range at which it can be exercised is unlimited as long as you and the target are on the same plane. You don’t need to see the target to control it.\r\n\r\nIf you don’t spend at least 1 round concentrating on the spell each following day, the target can attempt a new saving throw to throw off the domination. You can be prevented from exercising control or using the telepathic link while the target is under the effects of some spells, but such effects don’t automatically dispel the domination.", "brief_description": "", "requires_resolve": false}, "energy ray": {"title": "Energy Ray", "level_requirements": ["Technomancer 0"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature or object", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "When you cast this spell, choose acid, cold, electricity, or fire; the spell gains that descriptor. You fire a ray at the target, and you must make a ranged attack against its EAC. On a hit, the ray deals 1d3 damage of the chosen energy type.", "brief_description": "", "requires_resolve": false}, "enervation": {"title": "Enervation", "level_requirements": ["Mystic 4"], "school": "necromancy", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "You shoot a black ray at a target, making a ranged attack against the target’s EAC. If you hit, the target gains 2 temporary negative levels. Negative levels stack. If the target survives, it recovers from negative levels after a number of hours equal to your caster level (maximum 15 hours). An undead creature struck by the ray gains 10 temporary Hit Points for 1 hour.", "brief_description": "", "requires_resolve": false}, "enshrining refuge": {"title": "Enshrining Refuge", "level_requirements": ["Mystic 6"], "school": "abjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "all creatures in 40-ft. radius burst", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates, see text", "spell_resistance": "no", "description": "All creatures within a 40-foot radius of the spell’s point of origin are protected from violence. Any opponent attempting to directly attack a warded creature, even with a targeted spell, must attempt a Will saving throw. If the opponent succeeds, it can attack that creature normally, though it takes a –2 penalty to attacks against that creature for the duration of the spell. On a failed save, the opponent can’t follow through with the attack, loses that action, and can’t directly attack the warded creature for the duration of the spell. Those not attempting to attack a warded creature remain unaffected.\r\n\r\nThis spell doesn’t prevent warded creatures from being affected by an attack with an area of effect, though a warded creature receives a +2 bonus to saving throws against such attacks.\r\n\r\nEach warded creature can breathe normally, no matter the surrounding atmosphere, and it suffers no harm from being in a hot or cold environment. A warded creature can’t attack without breaking the spell for itself, but it can use harmless spells and abilities that don’t require attack rolls, and it can act otherwise.", "brief_description": "", "requires_resolve": false}, "entropic grasp": {"title": "Entropic Grasp", "level_requirements": ["Technomancer 3"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one nonmagical manufactured object (or the volume of the object within a 3-ft.-radius of the touched point) or one manufactured creature touched each round", "effect": "", "duration": "see text", "saving_throw": "Fortitude negates (object)", "spell_resistance": "no", "description": "Any unattended, manufactured (built from component parts, including metal, wood, plastic, glass, and so on) item you touch crumbles into dust, rust, and decay. If the item is so large that it can’t fit within a 3-foot radius, a 3-foot-radius volume of the material is destroyed. This is an instantaneous effect.\r\n\r\nYou can employ entropic grasp in combat by making a melee attack against your opponent’s EAC. If you hit, you instantaneously reduce a manufactured armor’s KAC and EAC bonus by 3 (to a minimum of a +0 bonus). Damaged armor can be repaired using the Engineering skill; with a successful check, the armor’s armor bonuses are restored to their original values. Against a manufactured creature (generally constructs, but not undead), this attack instead deals 6d12 damage.\r\n\r\nWeapons and equipment in use by an opponent are more difficult to affect with this spell. You attempt a sunder combat maneuver against the item. If successful, you deal 6d6 damage to the weapon or item.\r\nUsed in combat, this spell lasts 1 round per level, and you can make one melee attack each round on future rounds as a standard action. The target can attempt a save to negate each melee attack, but success does not end the spell.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "erase": {"title": "Erase", "level_requirements": ["Technomancer 1"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one written data set", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "Erase removes writings of either magical or mundane nature from any written storage, including paper, computers, or similar devices. You remove up to 1,500 words worth of text (for computer files, this could be a 1,500-word data file or 1,500 words of computer code). With this spell, you can remove magic runes and glyphs created by spells of 3rd-level and lower.\r\n\r\nNonmagical writing in a book or manual is automatically erased if you touch it and no one else is holding it. Magical writing and computer programs must be touched (either directly or by touching the physical drive that holds the file) to be erased, and you must also succeed at a caster level check (1d20 + caster level) with a DC equal to 11 + the caster level for the magical writing or the item level of the computer’s drive. Computers generally keep backups on a round-by-round basis, and when you erase code from a computer, it takes 1 round for the computer to access its backups. If you erase a file that stores continuous data (like a camera feed), the computer won’t be able to recover the missing round. A natural 1 is always a failure on this check. If you fail to erase writing that is part of a trap (magical or otherwise), you set off that trap.", "brief_description": "", "requires_resolve": false}, "chain surge": {"title": "Chain Surge", "level_requirements": ["Technomancer 6"], "school": "evocation", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "one primary target and up to 10 secondary targets, no two of which can be more than 30 ft. from the primary target", "effect": "", "duration": "instantaneous", "saving_throw": "Reflex half, see text", "spell_resistance": "yes", "description": "Choose a primary target as well as up to 10 secondary targets within 30 feet of the primary target. The primary target must be carrying or wielding some kind of equipment that uses electricity. This spell causes the primary target’s electrical equipment to surge with deadly electricity, which arcs out to strike the secondary targets, dealing 13d12 electricity damage to all targets chosen.\r\n\r\nIf the primary target fails its Reflex save, the spell also shorts out one of that target’s electrical items (your choice) for 1 round, meaning the primary target can’t use it for that period. If the primary target negates the effect entirely (such as with evasion), the secondary targets also suffer no effects.", "brief_description": "Deal 13d12 electricity damage to primary target and up to 10 secondary targets; one of the primary target’s electrical devices stops functioning for 1 round.", "requires_resolve": false}, "fatigue": {"title": "Fatigue", "level_requirements": ["Mystic 0"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level", "saving_throw": "Fortitude negates", "spell_resistance": "yes", "description": "You make a melee attack against a single target’s EAC, adding your key ability score modifier to the attack roll instead of your Strength modifier if it is higher. The target must succeed at a Fortitude save or be fatigued for the spell’s duration. This spell has no effect on a creature that is already fatigued. Casting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "fear": {"title": "Fear", "level_requirements": ["Mystic 1", "Mystic 4", "Mystic 2", "Mystic 3"], "school": "enchantment", "casting_time": "1 standard action", "range": "see text", "area": null, "targets": "see text", "effect": null, "duration": "see text", "saving_throw": "Will partial", "spell_resistance": "yes", "description": "With a single mental nudge, you can unlock one or more targets’ deepest nightmares. A target that succeeds at its Will saving throw against this spell is shaken for 1 round.\r\n\r\n**1st:** When you cast fear as a 1st-level spell, it affects one living creature of CR 4 or lower at close range (25 feet + 5 feet/2 levels). The target must succeed at a Will saving throw or be frightened for 1d4 rounds.\r\n\r\n**2nd:** When you cast fear as a 2nd-level spell, it affects one living creature of CR 4 or lower per 3 caster levels at medium range (100 feet + 10 feet/level), no two of which can be more than 30 feet apart. Each target must succeed at a Will saving throw or be frightened for 1 minute.\r\n\r\n**3rd:** When you cast fear as 3rd-level spell, it affects all living creatures of CR 8 or lower in 30-foot cone-shaped burst. Each target must succeed at a Will save or become panicked for 1 minute. If cornered, a panicked creature begins cowering.\r\n\r\n**4th:** When you cast fear as 4th-level spell, it affects all living creatures in 30-foot cone-shaped burst regardless of CR. Each target must succeed at a Will save or become panicked for 1 minute. If cornered, a panicked creature begins cowering.", "brief_description": null, "requires_resolve": false}, "feeblemind": {"title": "Feeblemind", "level_requirements": ["Mystic 5"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You fire a scintillating ray at your target, making a ranged attack against your target’s EAC, but you can add your key ability score bonus to this attack instead of your Dexterity modifier if it is higher. If you hit and your target fails its Will saving throw, the target creature’s Intelligence and Charisma scores each drop to 1 (a modifier of –5). The affected creature is unable to use Intelligence- or Charisma-based skills, cast spells, understand language, or communicate coherently. It still knows who its friends are and can follow them and even protect them. The target remains in this state until a miracle, psychic surgery, wish, or similar spell is used to cancel the effect. It can’t be removed by effects like _break enchantment_.", "brief_description": "", "requires_resolve": false}, "flesh to stone": {"title": "Flesh to Stone", "level_requirements": ["Mystic 6"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates", "spell_resistance": "yes", "description": "You fire a dull gray ray at your target, making a ranged attack against your target’s EAC, but you can add your key ability score bonus to this attack instead of your Dexterity modifier if it is higher. If you hit and the target fails its Fortitude save, the target, along with all its carried gear, turns into a mindless, inert statue. If the statue resulting from this spell is broken or damaged, the target (if ever returned to its original state) has similar damage or deformities. The creature is not dead, but it gives off no sign of life even upon close inspection. Only creatures made of flesh are affected by this spell. \r\n\r\nIf this spell is cast upon a stone creature that was once flesh, it reverses the petrification.", "brief_description": "", "requires_resolve": false}, "flight": {"title": "Flight", "level_requirements": ["Technomancer 1", "Technomancer 2", "Technomancer 3", "Technomancer 4", "Technomancer 5", "Technomancer 6"], "school": "transmutation", "casting_time": "1 standard action; see text", "range": "see text", "area": "", "targets": "see text", "effect": "", "duration": "see text", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "You tinker with the particles of magic surrounding one or more targets to either allow them to slow a fall, gently rise or descend, or fly short or vast distances.\r\n\r\n**1st:** When you cast flight as a 1st-level spell, you can target one Medium or smaller falling object or creature per level at close range (25 feet + 5 feet/2 levels). The targets must all be within 20 feet of each other. A Large creature or object counts as two Medium creatures or objects, a Huge creature or object counts as four Medium creatures or objects, and so on. The affected targets instantly fall slower, at a rate of just 60 feet per round (equivalent to the end of a fall from a few feet). The targets take no damage upon landing while the spell is in effect. This spell doesn’t affect charging or flying creatures.\r\n\r\nFor each target, this casting of the spell lasts until that target lands or 1 round per caster level (whichever happens first).\r\n\r\nThe 1st-level version of this spell can be cast as a reaction, but when you do so, you can’t take a standard action on your next round.\r\n\r\n**2nd:** When you cast flight as a 2nd-level spell, you can target yourself or one willing or unconscious creature or unattended object (total weight up to 100 pounds or 10 bulk per level) at close range. The spell allows you to move the target up or down as you wish. Each round as a move action, you can mentally direct the target up or down as much as 20 feet. You can’t move the target horizontally. A levitating creature that attacks with a melee or ranged weapon finds itself increasingly unstable; the first attack takes a –1 penalty to attack rolls, the second a –2 penalty, and so on, to a maximum of –5. A full round spent stabilizing allows the creature to begin again at –1.\r\n\r\nThis casting of the spell lasts 1 minute per caster level and is dismissible.\r\n\r\n**3rd:** When you cast flight as a 3rd-level spell, you can target one willing or unconscious touched creature and give it the power of flight. The target can fly at a speed of 60 feet with average maneuverability. Flying while under this spell’s effects takes no more concentration than walking, so the target can attack or cast spells normally. The target can charge but not run, and it can’t carry aloft more weight than its normal bulk limit. The target gains a bonus to Acrobatics checks to fly equal to half your caster level. If this spell expires or is dispelled while the target is aloft, the target floats downward 60 feet per round for 1d6 rounds. If it reaches the ground in that amount of time, it lands safely. If not, it falls the rest of the distance, taking 1d6 damage per 10 feet fallen.\r\n\r\nThe spell lasts for 1 minute per caster level.\r\n\r\n**4th:** When you cast flight as a 4th-level spell, you can target one willing or unconscious touched creature and affect it as per the 3rd-level version of the spell, except the target’s fly speed is increased by 10 feet and the spell lasts for 10 minutes per caster level.\r\n\r\n**5th:** When you cast flight as a 5th-level spell, you can target yourself and be affected as per the 4th-level version of the spell, except the spell lasts for 1 hour per caster level. When you use this flight speed for long-distance movement, you can hustle without taking nonlethal damage (a forced march still requires Constitution checks). You can cover 140 miles in an 8-hour period of flight (or 80 miles at a speed of 50 feet).\r\n\r\n**6th:** When you cast flight as a 6th-level spell, you can target multiple willing or unconscious creatures at close range (25 feet + 5 feet/2 levels) and affect them as per the 3rd-level version of the spell. You can target one creature per caster level, all of which must be within 30 feet of each other. This casting of the spell lasts 10 minutes per caster level.", "brief_description": "", "requires_resolve": false}, "fog cloud": {"title": "Fog Cloud", "level_requirements": ["Technomancer 2", "Mystic 2"], "school": "conjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "20-ft.-radius spread", "targets": "", "effect": "", "duration": "10 minutes/level", "saving_throw": "none", "spell_resistance": "no", "description": "A bank of fog billows out from the point you designate. The fog obscures all sight, including darkvision, beyond 5 feet. A creature within 5 feet has concealment (attacks have a 20% miss chance) against its attacker. Creatures farther away have total concealment (50% miss chance, and the attacker can’t use sight to locate the target) against their attackers.\r\n\r\nA moderate wind (11+ mph) disperses the fog in 4 rounds; a strong wind (21+ mph) disperses the fog in 1 round.\r\n\r\nThis spell doesn’t function underwater or in a vacuum.", "brief_description": "", "requires_resolve": false}, "force blast": {"title": "Force Blast", "level_requirements": ["Mystic 2"], "school": "evocation", "casting_time": "1 standard action", "range": "30 ft.", "area": "cone-shaped burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Reflex partial, see text", "spell_resistance": "yes", "description": "You gather mystical energy and blast it outward in a mighty wave originating from your fingertips, damaging and potentially knocking back your enemies. This spell deals 2d6 force damage to each creature in the area unless it succeeds at a Reflex saving throw for half damage.\r\n\r\nAdditionally, the force from this spell effectively attempts to bull rush all creatures in the area. Attempt a single bull rush combat maneuver, using your caster level + your key ability score modifier as your attack bonus. Compare the result to each target’s KAC + 8. If you’re successful, that creature is knocked back 5 feet, plus 5 additional feet for every 5 by which your attack exceeds the creature’s KAC + 8. If there is an obstacle in the way, the creature stops at the obstacle instead.", "brief_description": "", "requires_resolve": false}, "grave words": {"title": "Grave Words", "level_requirements": ["Mystic 0"], "school": "necromancy", "casting_time": "1 minute", "range": "touch", "area": "", "targets": "one dead creature", "effect": "", "duration": "1 round", "saving_throw": "none", "spell_resistance": "no", "description": "You can force a touched corpse talk to you, but you can’t ask it specific questions or communicate with it at all. The corpse utters random sentences for 1 round, with a 10% chance this information is of some use to you. Useful information might include warnings about dangers in a wrecked starship, the password to unlock a computer, or the name of a supernatural creature seeking you or your allies. The GM makes the d% roll in secret and decides what information, useful or not, the corpse spews out in its babbling.\r\n\r\nOnce a corpse has been subjected to grave words by any caster, any new attempt to cast grave words on that corpse fails. A corpse must have a mouth or means to speak in order for this spell to function, and the spell doesn’t affect a corpse that has been turned into an undead creature.", "brief_description": "", "requires_resolve": false}, "gravitational singularity": {"title": "Gravitational Singularity", "level_requirements": ["Mystic 6"], "school": "conjuration", "casting_time": "1 round", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "", "effect": "5-ft.-cube gravitational singularity; see text", "duration": "1 round/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You call into being a tiny particle of mass with infinite density. You must conjure the singularity in a square that is unoccupied by any creatures or objects. When you finish casting this spell, the singularity immediately draws all Medium and smaller creatures and unattended objects of no more than light bulk within 30 feet toward it. Each round on your turn, the singularity makes a single special combat maneuver against creatures within 30 feet with an attack bonus equal to 4 + your caster level + your key ability modifier. Compare the result to each creature’s KAC + 8. If the singularity is successful, that creature is moved 5 feet toward the singularity plus 5 additional feet for every 5 by which the result exceeds a target’s KAC + 8. Unattended objects are automatically moved 10 feet toward the singularity each round. If a creature or object is moved into the square that contains the singularity, it is sucked inside it and takes 12d6 damage at the end of its turn each round it remains within that space.\r\n\r\nA creature drawn into the singularity can take no actions except a full action to try to escape (it still takes damage during the rounds it attempts to escape). A creature must succeed at either an Athletics check (DC = 15 + 1-1/2 × your mystic level) or a DC 22 Strength check to escape the singularity. The singularity can hold up to four Medium creatures or objects (two Small creatures or objects count as one Medium creature, and so on); if it would pull in additional creatures, those creatures are simply pulled into a square adjacent to the singularity.\r\n\r\nA creature within 50 feet of the singularity has its speed reduced by half when it moves away from the singularity. However, it can move at double its normal speed when moving toward the singularity. If a creature moves within 30 feet of the singularity at any point in its movement, it is subject to the combat maneuver described above. A creature that moves neither toward nor away from the singularity moves at its normal speed.\r\n\r\nWhen this spell ends, the singularity disappears, and creatures and objects that were sucked into the singularity appear in the space where you conjured it (or as close as possible to that space, if they can’t all fit within it).", "brief_description": "", "requires_resolve": false}, "grease": {"title": "Grease", "level_requirements": ["Technomancer 1"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "one 10-ft. square or one object", "targets": "", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "Reflex partial, see text", "spell_resistance": "no", "description": "You cover a solid surface with a layer of slippery grease. Any creature in the area when the spell is cast must succeed at a Re ex save or fall prone. A creature can walk within or through the area of grease at half normal speed with a successful DC 10 Acrobatics check. Failure means the creature can’t move that round and must then succeed at a Re ex save or fall prone, while failure by 5 or more means it falls prone (see the Acrobatics skill on page 135 for details). A creature that doesn’t move on its turn doesn’t need to attempt this check and isn’t considered  at-footed. The spell can also be used to create a greasy coating on an item. Unattended material objects are always affected by this spell. If you attempt to affect an object in a creature’s possession, the creature can attempt a Reflex save to negate the effect. If the creature fails the initial saving throw, it immediately drops the item and must attempt a new save each round it attempts to pick up, hold, or use the item. A creature wearing greased armor or clothing gains a +5 circumstance bonus to Acrobatics checks to escape a grapple and a +2 circumstance bonus to its AC against grapple combat maneuvers.", "brief_description": "", "requires_resolve": false}, "handy junkbot": {"title": "Handy Junkbot", "level_requirements": ["Technomancer 3"], "school": "transmutation", "casting_time": "1 round", "range": "touch", "area": "", "targets": "1 bulk of inert electronic equipment; see text", "effect": "", "duration": "1 round/level", "saving_throw": "none", "spell_resistance": "no", "description": "You turn a pile of technological junk into a robot that can accomplish helpful tasks. You must target inert, nonworking electronic equipment of at least 1 bulk. Valid targets include a large broken computer system, nonworking or unconnected computer or robot parts, a destroyed robot or another such trashed mechanical system, or any related electronic components or combination of the above as long as the junk is found in a large enough quantity.\r\n\r\nWhile casting this spell, you use your magic and technological know-how to rearrange the junked parts and infuse them with energy and helpful programming. A handy junkbot is Small, its KAC and EAC are each equal to 10 + your caster level, and it has a number of Hit Points equal to one-quarter of your own (but no Stamina Points). It has a land speed of 30 feet and a fly speed of 15 feet with average maneuverability. It can accomplish all tasks described in the Computers, Engineering, Piloting, and Sleight of Hand skills, is considered trained in those skills, and has a total skill bonus in each equal to 3 + your caster level. The junkbot is treated as if it is using a hacker’s kit when using the Computers skill and an engineering kit when using the Engineering skill. A handy junkbot can never attack. The junkbot uses your saving\r\nthrow bonuses if it is the target of a spell or another targeted effect. For purposes of spells and effects that target the junkbot, it is treated as a construct with the technological and magical subtypes.\r\n\r\nYou can give new basic commands to your handy junkbot telepathically on your turn as a move action, and the junkbot can take actions as if it were a normal creature. You are aware when the junkbot has succeeded at or failed a skill check, as well as when it has been attacked or destroyed, but you can perceive nothing else through this basic telepathic link.\r\n\r\nWhen the handy junkbot is destroyed or this spell ends, the electronic equipment you used to create it falls apart into refuse, its circuitry fried beyond anything recognizable. You can’t use this refuse as a target to create another junkbot.", "brief_description": "", "requires_resolve": false}, "haste": {"title": "Haste", "level_requirements": ["Technomancer 3", "Mystic 3"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 round/level", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The targeted creatures move and act more quickly than normal. This extra speed has several effects.\r\n\r\nWhen making a full attack, a hasted creature can also take a separate move action in order to move. The movement can occur before, after, or between the attacks from the full attack. All movement must occur at the same time. All of the hasted creature’s modes of movement (including base, burrow, climb, fly, and swim speeds) increase by 30 feet, to a maximum of twice the\r\ntarget’s normal speed using that form of movement. This increase counts as an enhancement bonus, and it affects the creature’s jumping distance as normal for increased speed. Multiple haste effects don’t stack. Haste counters and negates _slow_.", "brief_description": "", "requires_resolve": false}, "healing junkbot": {"title": "Healing Junkbot", "level_requirements": ["Technomancer 3"], "school": "transmutation", "casting_time": "1 round", "range": "touch", "area": "", "targets": "1 bulk of inert electronic equipment; see text", "effect": "", "duration": "1 round/level", "saving_throw": "none", "spell_resistance": "no", "description": "You turn a pile of technological junk into a robot that can perform basic healing tasks.\r\n\r\nYou must target inert, nonworking electronic equipment of at least 1 bulk. Valid targets include a large broken computer system, nonworking or unconnected computer or robot parts, a destroyed robot or another such trashed mechanical system, or any related electronic components or combination of the above as long as the junk is found in a large enough quantity. While casting this spell, you use your magic and technological know-how to rearrange the junked parts and infuse them with energy and medical skills.\r\n\r\nA healing junkbot is Small, its KAC and EAC are each equal to 10 + your caster level, and it has a number of Hit Points equal to one-quarter of your own (but no Stamina Points). It has a land speed of 30 feet and a fly speed of 15 feet with average maneuverability. It is considered trained in the Medicine skill and can perform first aid, treat deadly wounds, and treat drugs or poison as if it had a medkit (though it can’t provide long-term care or treat disease). The junkbot has a total skill bonus for Medicine checks equal to 3 + your caster level.\r\n\r\nA healing junkbot can drag or fly one unconscious creature at a time to any spot you designate. It can drag or fly a Small, Medium, or Large creature at half speed. It can drag or fly smaller creatures at normal speed, but it can’t move creatures bigger than Large. A healing junkbot can never attack. The junkbot uses your saving throw bonuses if it is the target of a spell or another targeted effect. For purposes of spells and effects that target it, the junkbot is treated as a construct with the technological and magical subtypes.\r\n\r\nYou can give new basic commands to your healing junkbot telepathically on your turn as a move action, and the junkbot can take actions as if it were a normal creature. You are aware when the bot has succeeded at or failed a skill check, as well as when it has been attacked or destroyed, but you can perceive nothing else through this basic telepathic link.\r\n\r\nWhen the healing junkbot is destroyed or this spell ends, the electronic equipment you used to create it falls apart into refuse, its components and circuitry fried beyond anything recognizable. You can’t use this refuse as a target to create another junkbot.", "brief_description": "", "requires_resolve": false}, "heat leech": {"title": "Heat Leech", "level_requirements": ["Technomancer 5"], "school": "evocation", "casting_time": "1 standard action", "range": "60 ft.", "area": "cone-shaped burst", "targets": "", "effect": "", "duration": "instantaneous; see text", "saving_throw": "Reflex half", "spell_resistance": "yes", "description": "You drain the heat from all creatures and objects in the area, dealing 13d8 cold damage. You can store the gathered heat energy in a used battery. If you do so and use that battery when casting explosive blast within 1 minute, that spell deals 2d6 additional fire damage, destroying the used battery. Otherwise, the energy dissipates normally.", "brief_description": "", "requires_resolve": false}, "hold monster": {"title": "Hold Monster", "level_requirements": ["Mystic 4"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates, see text", "spell_resistance": "yes", "description": "This spell functions as _hold person_, except it can target any living creature.", "brief_description": "", "requires_resolve": false}, "hold person": {"title": "Hold Person", "level_requirements": ["Mystic 2"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one humanoid creature", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates, see text", "spell_resistance": "yes", "description": "The target becomes paralyzed and freezes in place. It is aware and breathes normally but can’t take any physical actions, even speech. A held creature can’t cast spells. Each round on its turn, the target can spend a full action to attempt a new saving throw to end the effect. This does not provoke attacks of opportunity. A winged creature that is paralyzed can’t flap its wings and falls. A swimmer can’t swim and may drown.", "brief_description": "", "requires_resolve": false}, "hold portal": {"title": "Hold Portal", "level_requirements": ["Technomancer 1"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one portal up to 20 sq. ft./level", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "This spell magically holds shut a door, gate, shutter, or window of any standard material (metal, plastic, stone, wood, and so on), or it reinforces an electronic lock. The magic affects the portal just as if it were securely closed and normally locked. A knock spell or a successful dispel magic spell can negate a hold portal spell.\r\n\r\nAdd 5 to the normal DC for forcing open a portal or hacking an electronic lock affected by this spell.", "brief_description": "", "requires_resolve": false}, "hologram memory": {"title": "Hologram Memory", "level_requirements": ["Mystic 3"], "school": "divination", "casting_time": "1 full action", "range": "touch", "area": "", "targets": "one living or deceased sentient creature; see text", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates, see text", "spell_resistance": "no", "description": "You reach into the target’s mind, extract a specific memory, and project that memory into a small hologram that plays in front of you and is visible to all creatures who can see it. The hologram memory can be no longer than 1 minute; if the extracted memory is longer than this, the hologram simply ends. The hologram includes audio as well as visual components, but it does not contain haptic, olfactory, or other components. The hologram typically plays a memory that takes place in a single scene, though it can cut to multiple scenes, if they are accurate to the memory and its length allows. The hologram plays the memory exactly as the target experienced it and from the target’s perspective, so it often lacks context. The target creature must remain quiet and still while the hologram plays or the spell and hologram end.\r\n\r\nThis spell can target any living, unconscious, or deceased sentient creature with an Intelligence score of 3 or higher (or a modifier of –4 or higher). If the target is deceased, it cannot have been dead for longer than 1 week, or this spell fails; once a corpse has been subjected to hologram memory by any caster, any subsequent attempts to cast hologram memory on that corpse fail.\r\n\r\nIf the target is unwilling to share this memory (or if it would be unable to share the memory, in the case of an unconscious or deceased target), it can attempt a Will saving throw with a +4 bonus to negate this spell and its effects.", "brief_description": "", "requires_resolve": false}, "holographic image": {"title": "Holographic Image", "level_requirements": ["Technomancer 1", "Technomancer 2", "Technomancer 3", "Technomancer 4", "Technomancer 5", "Technomancer 6"], "school": "illusion", "casting_time": "1 standard action", "range": "see text", "area": "see text", "targets": "", "effect": "", "duration": "see text", "saving_throw": "Will disbelief", "spell_resistance": "no", "description": "You weave nearby photons into illusory holograms that can take almost any form you can imagine. These holograms are usually effective against cameras, robots, and living creatures.\r\n\r\n**1st:** When you cast holographic image as a 1st-level spell, it produces a purely visual hologram at long range (400 feet + 40 feet/level). The image has no sound, smell, texture, or temperature. The image can’t extend beyond four 10-foot cubes plus one 10-foot cube per caster level. The image lasts for as long as you concentrate. You can move the image within the limits of the size of the effect.\r\n\r\n**2nd:** When you cast holographic image as a 2nd-level spell, it produces a hologram as per the 1st-level version of the spell, except the hologram can include minor sounds, but not understandable speech. The image lasts for as long as you concentrate plus 2 additional rounds.\r\n\r\n**3rd:** When you cast holographic image as a 3rd-level spell, it produces a hologram as per the 1st-level version of the spell, except the hologram can include sound, smell, and thermal illusions (but not speech). The image disappears when it is struck by an opponent, unless you cause the hologram to react appropriately. The image lasts for as long as you concentrate plus 3 additional rounds.\r\n\r\n**4th:** When you cast holographic image as a 4th-level spell, it produces a hologram as per the 3rd-level version of the spell, except the hologram follows a script determined by you. It follows that script for 1 minute per level without you having to concentrate on it. The hologram can include intelligible speech, if you wish.\r\n\r\n**5th:** When you cast holographic image as a 5th-level spell, it produces a hologram as per the 4th-level version of the spell, except the size of the hologram can’t extend beyond a 20-foot cube plus one 10-foot cube per caster level.\r\nYou can choose to make the hologram permanent at the time of casting. By concentrating, you can move the image within the limits of the range, but it is static while you are not concentrating.\r\n\r\nAlternatively, you can have the hologram activate when a specific condition (which you set at the time of casting) occurs. The event that triggers the hologram can be as general or as specific and detailed as desired, but it must be based on an audible, olfactory, tactile, or visual trigger. The trigger can’t\r\nbe based on some quality not normally obvious to the senses, such as alignment. The spell lasts until it is triggered, and then the hologram lasts for 1 round per caster level.\r\n\r\n**6th:** When you cast holographic image as a 6th-level spell, it creates a quasi-real, illusory version of yourself at medium range (100 feet + 10 feet/level). This hologram looks, sounds, and smells like you, but it is intangible. The hologram mimics your actions (including speech) unless you use a move action to direct it to act differently. You can see through its eyes and hear through its ears as if you were standing where it is, and during your turn you can switch from using its senses to using your own, or back again, as a move action. While you are using its senses, your body is considered blinded and deafened.\r\n\r\nIf you desire, any spell you cast with a range of touch or greater can originate from the hologram instead of from you. The hologram can’t cast spells on itself except for illusion spells. Spells cast in this manner affect other targets normally, despite originating from the hologram.\r\n\r\nAn object isn’t deceived by illusions (treat as if it had succeeded at its Will saving throw). The hologram remains for 1 round per level, and you must maintain line of effect to the hologram at all times. If your line of effect is obstructed, the spell ends. If you use dimension door, plane shift, teleport, or a similar spell that breaks your line of effect, even momentarily, the spell ends. This casting of the spell is a shadow effect.", "brief_description": "", "requires_resolve": false}, "holographic terrain": {"title": "Holographic Terrain", "level_requirements": ["Technomancer 5"], "school": "illusion", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "one 20-ft. cube/level (S)", "targets": "", "effect": "", "duration": "2 hours/level (D)", "saving_throw": "Will disbelief", "spell_resistance": "no", "description": "You make terrain look, sound, and smell like some other sort of terrain. Equipment, structures, and vehicles within the area can be hidden or changed in appearance. The illusion includes audible, olfactory, tactile, and visual elements and is effective against cameras, living creatures, robots, and scrying spells. This spell can’t disguise or add creatures nor can it make them invisible (though creatures within the area might hide themselves within the illusion just as they can hide themselves within a real location).", "brief_description": "", "requires_resolve": false}, "hurl forcedisk": {"title": "Hurl Forcedisk", "level_requirements": ["Mystic 2"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. +10 ft./level)", "area": "", "targets": "up to five creatures; see text", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "You create a spinning disk made of pure, shimmering force and hurl it at one opponent within range, potentially striking other nearby enemies as the disk ricochets. Choose the initial target, and make a ranged attack against its EAC. If the attack hits, the disk deals 3d6 force damage. The disk then ricochets to hit up to four more creatures of your choice, each no more than 15 feet from the last target. Make a ranged attack against each successive target’s EAC in turn; the disk deals 2d6 force damage to each secondary target struck (this damage is rolled separately for each target). The disk continues to ricochet in this way until it has attempted to strike five creatures, or until there are no more valid targets, or until you voluntarily end the spell. A creature can take damage only once from a single casting of this spell.\r\n\r\nThe forcedisk is subject to spell resistance, so you must attempt a caster level check (1d20 + your caster level) against each target with spell resistance before determining whether the target might take damage. If you fail this check, the spell ends.\r\n\r\nThe exact shape of the forcedisk is superficially changeable; as part of casting this spell, a spellcaster can decide to make it shaped differently from a traditional disk. For example, using this spell to create a starknife made of force is popular among Desna’s followers. The spell still deals the amount of damage described above regardless of the disk’s shape.", "brief_description": "", "requires_resolve": false}, "identify": {"title": "Identify", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "divination", "casting_time": "1 standard action", "range": "5 ft.", "area": "", "targets": "one magic or technological object", "effect": "", "duration": "1 round/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "This spell allows you to attempt to identify the function of a magic item (with Mysticism) or technological device (with Engineering) each round. You gain a +10 insight bonus to skill checks to identify the properties and command words or passwords of items targeted when using this spell. This spell does not allow you to identify artifacts.", "brief_description": "", "requires_resolve": false}, "implant data": {"title": "Implant Data", "level_requirements": ["Technomancer 2"], "school": "illusion", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one computer system or module", "effect": "", "duration": "1 hour/level or until triggered; see text", "saving_throw": "none", "spell_resistance": "no", "description": "You subtly rearrange the internal circuitry of a computer system or module, programming it to convey a certain dataset when accessed (either normally or if it is hacked). You can implant up to one piece of data per caster level. A piece of data consists of a simple fact, such as a creature or object’s location or physical description, a creature or object’s tangible or intangible value, or another simple statement. When an affected computer system or module is accessed, this implanted data is the first data the accessing individual gains, regardless of what data the individual is actually looking for, though the accessing individual can access the system or module’s actual information if it looks beyond the implanted data. The implanted data vanishes from the system or module once the accessing individual has reviewed it. If this spell’s duration ends before an individual accesses the implanted data, the implanted data vanishes.\r\n\r\nThe implanted data can be made permanent with a special ritual, which takes 1 hour and requires materials worth 5,000 credits. Once it’s made permanent, the implanted data temporarily vanishes after it is accessed, but it returns 1 hour later.", "brief_description": "", "requires_resolve": false}, "inflict pain": {"title": "Inflict Pain", "level_requirements": ["Mystic 2"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level", "saving_throw": "Will partial, see text", "spell_resistance": "yes", "description": "You telepathically rack the target’s mind and body with agonizing pain that imposes a –2 penalty to ability checks, attack rolls, and skill checks. A target that succeeds at a Will saving throw reduces the duration to 1 round.", "brief_description": "", "requires_resolve": false}, "inflict pain, mass": {"title": "Inflict Pain, Mass", "level_requirements": ["Mystic 6"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 round/level", "saving_throw": "Will partial, see text", "spell_resistance": "yes", "description": "This spell functions as _inflict pain_, except as noted above.", "brief_description": "", "requires_resolve": false}, "inject nanobots": {"title": "Inject Nanobots", "level_requirements": ["Technomancer 2"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one living creature or construct", "effect": "", "duration": "instantaneous and 1 round/level; see text", "saving_throw": "Fortitude partial and Will partial, see text", "spell_resistance": "yes", "description": "You concentrate key particles in your blood into tiny biological nanobots that you can inject into a foe with a touch, disrupting and damaging its natural processes. Make a melee attack against the target’s EAC; if you hit, the nanobots deal 4d8 damage and swarm through the target’s biological or mechanical systems, causing the creature to be confused, as per confusion, for 1 round per your caster level. If the target succeeds at a Fortitude save, it takes only half damage and negates the confusion effect. A confused target can attempt a Will saving throw at the beginning of its turn each round to end the confusion effect.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "instant virus": {"title": "Instant Virus", "level_requirements": ["Technomancer 3"], "school": "necromancy", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one construct with the technological subtype", "effect": "", "duration": "instantaneous; see text", "saving_throw": "Fortitude negates, see text", "spell_resistance": "yes", "description": "You overwhelm your target’s programming, installing a dangerous self-replicating programming virus. This works like a physical or mental disease (your choice), except it ignores the target’s immunity to diseases. The programming virus has a frequency of 1 hour and requires two consecutive saving throws to cure. _Detect affliction_ can reveal the existence of this virus in a construct (the virus is considered a _disease_ for purposes of that spell). Additionally, _remove affliction_ can remove this virus.", "brief_description": "", "requires_resolve": false}, "invisibility": {"title": "Invisibility", "level_requirements": ["Technomancer 2"], "school": "illusion", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature or object no more than 10 bulk/level", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "Will negates (harmless, object), see text", "spell_resistance": "yes (harmless, object)", "description": "The creature or object touched becomes invisible (see page 264). If the target is a creature, any gear it is carrying vanishes as well. If you cast the spell on someone else, neither you nor your allies can see the target unless you can normally see invisible things or you employ magic to do so.\r\n\r\nThe spell ends if the target attacks any creature. For purposes of this spell, an attack includes any spell or harmful effect targeting a foe or whose area or effect includes a foe. Actions directed at unattended objects don’t break the spell. Spells that specifically affect allies but not foes are not attacks for this purpose, even when they include foes in their area. Causing harm indirectly is not an attack. Thus, an invisible being can open doors, talk, eat, climb stairs, summon security forces and have them attack, start a trash compactor with foes inside, remotely trigger traps, and so forth.", "brief_description": "", "requires_resolve": false}, "invisibility, greater": {"title": "Invisibility, Greater", "level_requirements": ["Technomancer 4"], "school": "illusion", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions like _invisibility_, except it doesn’t end if the target attacks.", "brief_description": "", "requires_resolve": false}, "invisibility, mass": {"title": "Invisibility, Mass", "level_requirements": ["Technomancer 6"], "school": "illusion", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "any number of creatures, no two of which can be more than 180 ft. apart", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "Will negates (harmless, object), see text", "spell_resistance": "yes (harmless, object)", "description": "This spell functions like _invisibility_, except the effect moves with the group and is broken when anyone in the group attacks. Individuals in the group can’t see one another. Any individual who moves more than 180 feet from the nearest member of the group loses the benefit of this spell. If only two individuals are affected, the one moving away from the other one loses its invisibility. If both are moving away from each other, they both become visible when the distance between them exceeds 180 feet.", "brief_description": "", "requires_resolve": false}, "irradiate": {"title": "Irradiate", "level_requirements": ["Technomancer 3", "Mystic 3"], "school": "conjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "10-ft.-radius spread; see text", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude partial, see text;", "spell_resistance": "no", "description": "This spell floods the area of effect with dangerous radiation. The strength of the radiation you create depends on your caster level, as detailed below. The central irradiated area is always a 10-foot-radius spread that expands normally per the rules for radiation areas of effect (see page 403). Creatures within the area are exposed to the radiation only once; the radiation does not linger in the area. The saving throw to resist the radiation effects is set by the spell rather than the standard save DC for radiation.\r\n\r\nCaster Level | Radiation Level\r\n:---:|:---:\r\n6th or lower | Low\r\n7th–9th | Medium\r\n10th–16th | High\r\n17th or higher | Severe", "brief_description": "", "requires_resolve": false}, "jolting surge": {"title": "Jolting Surge", "level_requirements": ["Technomancer 1"], "school": "evocation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature or object", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "You touch a target with a device you’re holding that uses electricity, requiring a melee attack against the target’s EAC. Alternatively, you can instead touch an electrical device a target is wearing (or a target that is an electrical device, such as a robot) with your hand, gaining a +2 bonus to your attack roll. Either way, if your attack hits, the electrical device surges out of control, dealing 4d6 electricity damage to your target.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "keen senses": {"title": "Keen Senses", "level_requirements": ["Technomancer 1"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target gains a +2 insight bonus to Perception checks and gains low-light vision. Targets that have low-light vision double the distance they can see under the effects of this spell.", "brief_description": "", "requires_resolve": false}, "knock": {"title": "Knock", "level_requirements": ["Technomancer 2"], "school": "transmutation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one door, container, or portal with an area of up to 10 sq. ft./level", "effect": "", "duration": "instantaneous; see text", "saving_throw": "none", "spell_resistance": "no", "description": "Knock opens barred, computer-sealed, locked, or stuck doors, as well as those subject to _hold portal_ or _security seal_. When you complete the casting of this spell, attempt a caster level check (1d20 + your caster level) against the DC of the lock or computer seal with a +10 bonus. If successful, knock opens up to two means of closure. This spell opens secret doors (but doesn’t identify secret doors you haven’t found) as well as locked or trick-opening containers, starship doors, and similar secured entryways. It also loosens chains, shackles, or welds (provided they serve to hold something shut). If used to open a door closed with security seal, the spell doesn’t remove the seal but simply suspends its functioning for 10 minutes. In all other cases, the door does not relock itself or become stuck again on its own. Knock does not raise barred gates or similar impediments (such as a force field barrier) or open any door or container larger than the spell’s area, nor does it affect ropes, webs, and the like.", "brief_description": "", "requires_resolve": false}, "life bubble": {"title": "Life Bubble", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 day/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "You surround the target creatures with a constant and movable 1-inch shell of tolerable living conditions customized for each creature. This shell enables the targets to breathe freely in a variety of atmospheric conditions (including in corrosive, thick, thin, and toxic atmospheres), as well as underwater or in a vacuum. It also makes the targets immune to harmful gases and vapors, including inhaled diseases and poisons as well as spells with a harmful gaseous effect. In addition, the shell protects targets (and their equipment) from extreme temperatures (between –50° and 140° F) without having to attempt Fortitude saving throws, as well as extreme pressures.\r\n\r\nLife bubble doesn’t provide protection from energy damage, negative or positive energy (such as found on the Negative and Positive Energy Planes), or radiation; it also doesn’t provide the ability to see in conditions of poor visibility (such as in smoke or fog) or the ability to move or act normally in conditions that impede movement (such as underwater).", "brief_description": "", "requires_resolve": false}, "logic bomb": {"title": "Logic Bomb", "level_requirements": ["Technomancer 2"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one computer system or module", "effect": "", "duration": "1 day/level or until triggered", "saving_throw": "see text", "spell_resistance": "see text", "description": "You infuse one computer system or module with protective energy, inuring it against attempts to access it.\r\n\r\nAs long as this spell is in effect, the first time a creature unsuccessfully attempts to access, destroy, or manipulate the affected computer system or module (using the Computers skill or otherwise), it takes 6d6 damage (either cold, electricity, or fire damage; you choose when casting the spell, and the spell gains the appropriate descriptor). The creature can attempt a Fortitude saving throw for half damage, and spell resistance applies. This damage is in addition to any negative effects the creature suffers due to the system’s other countermeasures.", "brief_description": "", "requires_resolve": false}, "magic missile": {"title": "Magic Missile", "level_requirements": ["Technomancer 1"], "school": "evocation", "casting_time": "1 standard action; see text", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "up to three creatures, no two of which can be more than 15 ft. apart; see text", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "You fire two missiles of magical energy that strike targets unerringly (the creatures must still be valid targets) and deal 1d4+1 force damage each. You can’t target specific parts of a creature, and objects are not damaged by the spell.\r\n\r\nYou can target a single creature or several creatures, but each missile can strike only one creature. You must designate targets before you attempt to overcome spell resistance or roll damage.\r\n\r\nYou can cast this spell as a full action. If you do, you fire three missiles instead of two.", "brief_description": "", "requires_resolve": false}, "make whole": {"title": "Make Whole", "level_requirements": ["Technomancer 2"], "school": "transmutation", "casting_time": "10 minutes", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one object of up to 1 bulk/level or one construct of any size", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "This spell functions as _mending_, except it restores 5d6 Hit Points when cast on an object or construct creature.\r\n\r\nMake whole can fix destroyed magic items, and it restores the magic properties of the item if your technomancer level is at least twice the item’s level. Items with charges (such as batteries) and single-use items (such as potions and grenades) can’t be repaired in this way. When you cast make whole on a construct, the spell bypasses any immunity to magic as if the spell did not allow spell resistance.", "brief_description": "", "requires_resolve": false}, "mending": {"title": "Mending", "level_requirements": ["Technomancer 0"], "school": "transmutation", "casting_time": "10 minutes", "range": "10 ft.", "area": "", "targets": "one object of up to 1 bulk", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "This spell repairs damaged objects and constructs, restoring 1d4 Hit Points. If the object has the broken condition, this condition is removed if the object is restored to at least half its original Hit Points. All of the pieces of an object must be present for this spell to function. A construct can benefit from this spell only once per day. Magic items can be repaired by this spell, but magic items that are destroyed don’t have their magic abilities restored. This spell doesn’t reverse effects that warp or otherwise transmute items, but it can still repair damage dealt to such items.", "brief_description": "", "requires_resolve": false}, "microbot assault": {"title": "Microbot Assault", "level_requirements": ["Technomancer 2"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "", "effect": "distracting cloud of microbots", "duration": "concentration + 1 round", "saving_throw": "none", "spell_resistance": "no", "description": "You pull latent technological energy from the air to form a cloud of fist-sized hindering microbots that fill an area you designate. The microbots begin in a 10-foot-square area when you create them, and you can create the cloud so that it shares the space of other creatures. If no creatures are within the cloud’s area, the microbots pursue and harass the nearest creature that is hostile to you as best they can each round. Although the microbots generally know which creatures are your enemies, you have no control over their targets or direction of travel. If there are multiple valid targets the microbots can harass, the cloud will split into a maximum of four 5-foot-square segments and pursue different targets.\r\n\r\nThe cloud (and any segments thereof) has a fly speed of 20 feet. Each round on your turn, the microbot cloud grants harrying fire (see page 247) against the foes in its spaces. In addition, the cloud grants covering fire (see page 246) to anyone attacked by foes in its spaces. The microbots constantly repair themselves and the cloud generates new microbots every few seconds, so any attack against them is essentially ineffective.", "brief_description": "", "requires_resolve": false}, "mind link": {"title": "Mind Link", "level_requirements": ["Mystic 1"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "You link your mind to that of a touched creature to swiftly communicate a large amount of complex information in an instant. You decide what the target learns, limited to any amount of information that otherwise could be communicated in 10 minutes. This information comes in a series of visual images and emotional sensations, and it isn’t language dependent.", "brief_description": "", "requires_resolve": false}, "mind probe": {"title": "Mind Probe", "level_requirements": ["Mystic 4"], "school": "divination", "casting_time": "1 minute", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates, see text", "spell_resistance": "yes", "description": "You gain access to the target’s memories and knowledge, and you can pry the information you want from them involuntarily.\r\n\r\nYou can attempt to learn the answer to one question of your choice per round; after each question, the target can attempt a Will saving throw to end the spell. If it fails, the creature can attempt a Bluff check with a DC equal to 11 + your Sense Motive modifier. If it fails its Bluff check, you gain the answer you desire. If it succeeds at its check, you gain no information. If it succeeds by 5 or more, it answers however it chooses and you believe that wrong answer to be the truth. Your questions are purely telepathic inquiries, and the answers to those questions are imparted directly into your mind. You and the target don’t need to speak the same language, though less intelligent creatures may yield up only appropriate sensory images in answer to your questions.", "brief_description": "", "requires_resolve": false}, "mind thrust": {"title": "Mind Thrust", "level_requirements": ["Mystic 1", "Mystic 2", "Mystic 3", "Mystic 4", "Mystic 5", "Mystic 6"], "school": "divination", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will half", "spell_resistance": "yes", "description": "You divine the most vulnerable portion of your opponent’s mind and overload it with a glut of psychic information. The target can attempt a Will saving throw to halve the damage dealt by this spell. This spell has no effect on creatures without an Intelligence score.\r\n\r\n**1st:** When you cast mind thrust as a 1st-level spell, it deals 2d10 damage to the target.\r\n\r\n**2nd:** When you cast mind thrust as a 2nd-level spell, it deals 4d10 damage to the target.\r\n\r\n**3rd:** When you cast mind thrust as a 3rd-level spell, it deals 7d10 damage to the target.\r\n\r\n**4th:** When you cast mind thrust as a 4th-level spell, it deals 10d10 damage to the target and the target is fatigued for 1 round if it fails its saving throw.\r\n\r\n**5th:** When you cast mind thrust as a 5th-level spell, it deals 15d10 damage to the target. The target is exhausted for 1 round if it fails its save and it is fatigued for 1 round if it succeeds at its saving throw.\r\n\r\n**6th:** When you cast mind thrust as a 6th-level spell, it deals 17d10 damage to the target. The target is exhausted and stunned for 1 round if it fails its save, and it is fatigued for 1 round if it succeeds at its saving throw.", "brief_description": "", "requires_resolve": false}, "miracle": {"title": "Miracle", "level_requirements": ["Mystic -"], "school": "evocation", "casting_time": "1 standard action", "range": "see text", "area": "see text", "targets": "see text", "effect": "see text", "duration": "see text", "saving_throw": "see text", "spell_resistance": "yes", "description": "When you cast miracle, you state what you would like to have happen and request that the power to which you are connected intercede. A request that is out of line with the power’s nature is refused. A miracle can do any of the following things.\r\n\r\n* Duplicate any mystic spell of 6th level or lower.\r\n* Duplicate any other spell of 5th level or lower.\r\n* Undo the harmful effects of certain spells, such as _feeblemind_.\r\n* Produce any effect whose power level is in line with the above effects.\r\n\r\nAt the GM’s discretion, you may try to use a miracle to produce greater effects than these, but doing so may be dangerous or the spell may have only a partial effect.\r\n\r\nA duplicated spell allows saving throws and spell resistance as normal, but the save DCs are the same as for a 7th-level spell. For the purpose of other effects that depend on spell level, miracle counts as a 9th-level spell.", "brief_description": "", "requires_resolve": false}, "mirror image": {"title": "Mirror Image", "level_requirements": ["Technomancer 2"], "school": "illusion", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "1 minute/level", "saving_throw": "", "spell_resistance": "", "description": "This spell creates a number of illusory doubles of you that inhabit your square. These doubles make it difficult for enemies to precisely locate and attack you.\r\n\r\nWhen you cast mirror image, it creates 1d4 figment images. These images remain in your space and move with you, mimicking your movements, sounds, and actions exactly. Whenever you are attacked or are the target of a spell that requires an attack roll, there is a possibility that the attack targets one of your images instead. If the attack hits, roll randomly to see whether the selected target is real or a figment. If it is a figment, the figment is destroyed. If the attack misses by 5 or less, one of your figments is destroyed by the near miss, and an attack that misses you due to a miss chance also destroys an image. Area spells and effects that don’t require an attack roll affect you normally and don’t destroy any of your figments. Spells with a range of touch are harmlessly discharged if used to destroy a figment.\r\n\r\nAn attacker must be able to see the figments to be fooled. If you are invisible or the attacker is blind, the spell has no effect. Blindsense doesn’t help distinguish the figments from the real you, but blindsight is sufficient to do so.", "brief_description": "", "requires_resolve": false}, "mislead": {"title": "Mislead", "level_requirements": ["Technomancer 5"], "school": "illusion", "casting_time": "1 standard action", "range": "personal; see text", "area": "", "targets": "", "effect": "one illusory double", "duration": "1 round/level (D) and concentration + 3 rounds; see text", "saving_throw": "none or Will disbelief, see text", "spell_resistance": "no", "description": "You become invisible (as greater invisibility), and at the same time, a figment double of you (as per a 3rd-level casting of holographic image) appears. The double appears within close range (25 feet + 5 feet/2 levels) but thereafter moves as you direct it (which requires concentration beginning on the first round after the casting). You can make the figment appear superimposed perfectly over your own body so that observers don’t notice an image appearing and you turning invisible. You and the figment can then move in different directions. The double moves at your speed and can talk and gesture as if it were real, but it can’t attack or cast spells, though it can pretend to do so.\r\n\r\nThe illusory double lasts as long as you concentrate upon it plus 3 additional rounds. After you cease concentration, the illusory double continues to carry out the same activity until the duration expires. The invisibility lasts for 1 round per level, regardless of concentration.", "brief_description": "", "requires_resolve": false}, "explosive blast": {"title": "Explosive Blast", "level_requirements": ["Technomancer 3"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "20-ft.-radius burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Reflex half", "spell_resistance": "yes", "description": "You magically transform a used battery into a powerful explosive device, propelling it in a straight line to a grid intersection within range, at which point it detonates, dealing 9d6 fire damage to all creatures and objects in the area. If you send the battery through a narrow opening, you must make a ranged attack (usually against an Armor Class of 10 for a narrow opening or an Armor Class of 15 for an extremely narrow opening) to avoid hitting the side and detonating it prematurely.", "brief_description": "", "requires_resolve": false}, "nondetection": {"title": "Nondetection", "level_requirements": ["Technomancer 3"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature or object", "effect": "", "duration": "1 hour/level", "saving_throw": "Will negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "The warded creature or object becomes difficult to detect by divination spells such as clairaudience/clairvoyance and spells with the word “detect” in their names. Nondetection also prevents location by magic items such as crystal balls and technological items such as cameras and surveillance systems. Casting this spell places significant stress on you, and requires you to spend 1 Resolve Point.\r\n\r\nIf a magic divination is attempted against the warded creature or item, the caster of the divination must succeed at a caster level check (1d20 + caster level) against a DC equal to 11 + your caster level. If surveillance is attempted with remote cameras or sensors, the viewer must succeed at a Perception check against a DC equal to 11 + your caster level to see the target. If you cast nondetection on yourself or on an item currently in your possession, the DC for each these checks is equal to 15 + your caster level. If cast on a creature, nondetection wards the creature’s gear as well as the creature itself.\r\n\r\nNondetection protects the target only from discovery by items and remote sensors, not by creatures. A camera mounted to a wall and monitored from a security booth is subject to nondetection, but a camera in a creature (including constructs) is not.", "brief_description": "", "requires_resolve": false}, "overheat": {"title": "Overheat", "level_requirements": [], "school": "evocation", "casting_time": "1 standard action", "range": "15 ft.", "area": "cone-shaped burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Reflex half", "spell_resistance": "yes", "description": "You collect the heat generated by nearby bodies and devices and vent it outward in a thermal wave, dealing 2d8 fire damage to creatures and objects in the area.", "brief_description": "", "requires_resolve": false}, "overload systems": {"title": "Overload Systems", "level_requirements": ["Technomancer 4"], "school": "enchantment", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 round/level", "saving_throw": "Fortitude negates", "spell_resistance": "yes", "description": "By touching the target (usually requiring a melee attack roll against the target’s EAC, but you can add your key ability score modifier instead of your Strength modifier if it is higher), you flood the target’s body with random jolts of electricity or other interference. On a failed Fortitude save, the target is overwhelmed and potentially unable to perform tasks as normal. While this spell is in effect, whenever the target takes any action or reaction, there is a 50% chance that the target simply takes no action instead. Roll this chance separately for each action the target would take. For example, if the target wishes to move and attack during its turn, it would roll d% twice to determine whether it could take those actions—once before each action it wishes to take. Each attack of a full attack action counts as separate action.\r\n\r\nThis spell is effective against living and unliving creatures, and casting it doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "passwall": {"title": "Passwall", "level_requirements": ["Technomancer 5"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "", "effect": "5-ft.-by-8-ft. opening", "duration": "1 hour/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You can create a passage through metal, plaster, plastic, stone, or wooden walls, but you can not create one through force fields, starship bulkheads, or other harder materials. The passage is 30 feet deep. If the wall’s thickness is more than the depth of the passage created, then a single casting of passwall simply makes a niche or short tunnel. Several castings of passwall can then form a continuing passage to breach very thick walls. When passwall ends, creatures within the passage are ejected out the nearest exit. If someone dispels passwall or you dismiss it, creatures in the passage are ejected out the far exit, if there is more than one, or out the sole exit.", "brief_description": "", "requires_resolve": false}, "planar barrier": {"title": "Planar Barrier", "level_requirements": ["Technomancer 6", "Mystic 6"], "school": "abjuration", "casting_time": "6 rounds", "range": "medium (100 ft. + 10 ft./level)", "area": "one 60-ft. cube/level (S)", "targets": "", "effect": "", "duration": "24 hours", "saving_throw": "none", "spell_resistance": "yes", "description": "Planar barrier seals an area against all planar travel into or within it. This includes all teleportation spells, summoning spells, plane shifting, astral travel, and ethereal travel. Such effects simply fail automatically. Starships cannot enter or emerge from Drift travel in an area affected by this spell.\r\n\r\nDispel magic does not dispel your planar barrier effect unless the caster level of the creature attempting to dispel it is at least as high as your own. You can’t have multiple overlapping planar barrier effects. If planar barrier effects woulds overlap, the more recent effect stops at the boundary of the older effect.\r\n\r\nA planar barrier can be made permanent with a special ritual, which takes 1 hour and requires materials worth 15,000 credits per 60-foot cube.", "brief_description": "", "requires_resolve": false}, "planar binding": {"title": "Planar Binding", "level_requirements": ["Mystic 4", "Mystic 5", "Mystic 6", "Technomancer 4", "Technomancer 5", "Technomancer 6"], "school": "conjuration", "casting_time": "10 minutes", "range": "close (25 ft. + 5 ft./2 levels)", "area": null, "targets": "see text", "effect": null, "duration": "instantaneous; see text", "saving_throw": "Will negates", "spell_resistance": "yes, see text", "description": "Casting this spell attempts a dangerous act: to lure a creature from another plane to a specifically prepared trap, created by the spell within its range. The called creature is held in the trap until it agrees to perform one service in return for its freedom or breaks free. The kind of creature to be bound must be known and stated. If you wish to call a specific individual, you must use that individual’s proper name in casting the spell. The CR of the outsider you can call with planar binding depends on the spell’s level.\r\n\r\n**4th:** One outsider of CR 4 or lower\r\n**5th:** One outsider of CR 7 or lower\r\n**6th:** One outsider of CR 10 or lower\r\n\r\nThe target creature can attempt a Will saving throw. If the creature succeeds at the saving throw, it resists the spell. If it fails, the creature is immediately drawn to the trap (spell resistance does not keep it from being called). The creature can escape from the trap by successfully using its spell resistance (meaning you fail a caster level check against its spell resistance), by dimensional travel, or with a successful Charisma check (DC = 15 + half your caster level + your Charisma modifier). It can try each method once per day, and a natural 20 on this check always succeeds (and a natural 1 on your caster level check always fails). If it breaks loose, it can flee or attack you. A planar barrier spell cast in the area prevents the creature from escaping via dimensional travel.\r\n\r\nIf the creature does not break free of the trap, you can keep it bound for as long as you dare. You can attempt to convince the creature to perform a task for you in exchange for release and perhaps some sort of reward. The creature decides which terms it is willing to accept, and it must willingly agree to the terms; magical compulsion isn’t sufficient. This continues until the creature promises to serve, until it breaks free, or until you decide to get rid of it by means of some other spell. It never agrees to unreasonable commands.\r\n\r\nOnce the requested service has been completed, the creature need only to inform you to be instantly sent back to its home plane. The creature might later seek revenge against you for having imprisoned it. If you assign some open-ended task that the creature can’t complete through its own actions, the spell remains in effect for 10 days and the creature gains an immediate chance to break free. A defined task that will take longer than 10 days usually counts as unreasonable. Note that a clever recipient can subvert some instructions.\r\n\r\nWhen you use this spell to call a creature with the air, chaotic, earth, evil, fire, good, lawful, or water subtype, the spell gains that descriptor.", "brief_description": null, "requires_resolve": false}, "plane shift": {"title": "Plane Shift", "level_requirements": ["Technomancer 6", "Mystic 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature, or up to eight willing or unconscious creatures", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You move yourself or some other creature to another plane of existence or alternate dimension. If several willing or unconscious creatures are linked by hand in a circle, as many as eight can be affected by a single casting of plane shift. Arriving at a precise location on the intended plane is nigh impossible. From the Material Plane, you can reach any other plane (except for the Drift), though you appear 5 to 500 miles (5d%) from the last place one of the targets (your choice) was located last time that target traveled to that plane. If it’s the first time traveling to a particular plane for all targets, you appear at a random location on the plane, though you can use other means of transit, such as interplanetary teleport, to travel on the new plane. Mystics must have an object attuned to a specific plane or native to that plane in order to use plane shift to travel to a plane. A technomancer requires a planar navigational program for a specific plane in order to travel to that plane with plane shift. Special rituals, jealously hoarded by powerful technomancers and mystics, can allow you to travel to specific locations on the chosen plane, or even to unknown worlds.", "brief_description": "", "requires_resolve": false}, "private sanctum": {"title": "Private Sanctum", "level_requirements": ["Technomancer 5"], "school": "abjuration", "casting_time": "10 minutes", "range": "close (25 ft. + 5 ft./2 levels)", "area": "one 30-ft. cube/level (S)", "targets": "", "effect": "", "duration": "24 hours (D)", "saving_throw": "none", "spell_resistance": "no", "description": "This spell ensures privacy. Anyone looking into the area from outside sees only a dark, foggy mass. Darkvision cannot penetrate it. No sounds, no matter how loud, can escape the area, so nobody can eavesdrop from outside. Those inside can see out normally.\r\n\r\nDivination (scrying) spells can’t perceive anything within the area, and those within are immune to detect thoughts. The ward prevents speech between those inside and those outside (because it blocks sound), and technological communication (as it blocks broadcasts), but it doesn’t prevent other magic communication, such as a telepathic message spell, or telepathic communication.\r\n\r\nThe spell does not prevent creatures or objects from moving into and out of the area.", "brief_description": "", "requires_resolve": false}, "probability prediction": {"title": "Probability Prediction", "level_requirements": ["Technomancer 3"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "1 round/level (D); see text", "saving_throw": "", "spell_resistance": "", "description": "You open your mind to read the underlying probability of the universe. At any point during the duration of this spell, you can discharge it to reroll any d20 roll (attack roll, saving throw, skill check, etc.; see page 243). This takes no action, but you must choose to do it before you learn the results of the first roll. You must take the result of the second roll, even if it is worse.", "brief_description": "", "requires_resolve": false}, "prying eyes": {"title": "Prying Eyes", "level_requirements": ["Technomancer 5"], "school": "divination", "casting_time": "1 minute", "range": "1 mile", "area": "", "targets": "", "effect": "20 magical sensors", "duration": "1 hour/level (D); see text", "saving_throw": "none", "spell_resistance": "no", "description": "You create 20 semitangible, visible magical orbs called “eyes.” These eyes move out, scout around, and return as you direct them when casting the spell. Each eye can see 120 feet (normal vision only) in all directions.\r\n\r\nWhile the individual eyes are quite fragile, they’re small and difficult to spot. Each eye is a Fine construct (about the size of a small apple) with the magical subtype. They each have 1 Hit Point and EAC and KAC of 18, and they fly at a speed of 30 feet with a +20 bonus to Acrobatics checks to fly and a +16 bonus to Stealth checks. An eye has a +20 Perception bonus and is subject to darkness, fog, illusions, and any other factors that affect your ability to receive visual information about your surroundings. An eye traveling in darkness must find its way by touch.\r\n\r\nWhen you create the eyes, you specify instructions you want them to follow in a command of no more than 25 words. The eyes know anything you know.\r\n\r\nIn order to report their findings, the eyes must return to your hand. Each eye replays in your mind all that it has seen during its existence. It takes an eye 1 round to replay 1 hour of recorded images. After relaying all of its findings, an eye simply disappears.\r\n\r\nIf an eye ever gets more than 1 mile away from you, it instantly ceases to exist. However, your link with the eye is such that you won’t know if the eye was destroyed because it wandered out of range or because of some other event.\r\n\r\nThe eyes exist for up to 1 hour per caster level or until they return to you. Dispel magic can destroy the eyes. Roll separately for each eye caught in an area dispel.", "brief_description": "", "requires_resolve": false}, "psychic surgery": {"title": "Psychic Surgery", "level_requirements": ["Mystic 6"], "school": "enchantment", "casting_time": "10 minutes", "range": "touch", "area": "", "targets": "one willing or unconscious, living creature", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "Psychic surgery heals the target of all Intelligence, Wisdom, and Charisma damage, and it restores all points permanently drained from the target’s Intelligence, Wisdom, and Charisma scores. It also eliminates all ongoing confusion, fear, and insanity effects. Psychic surgery also removes any mental afflictions that could be removed with dispel magic, as well as mental diseases. Psychic surgery removes all effects magically altering the target’s memory, even instantaneous effects, and it can restore a memory to perfect clarity (even if the memory loss is due to the mundane passage of time).", "brief_description": "", "requires_resolve": false}, "psychokinetic hand": {"title": "Psychokinetic Hand", "level_requirements": ["Technomancer 0", "Mystic 0"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one unattended object of no more than 10 lbs. or 1 bulk", "effect": "", "duration": "concentration", "saving_throw": "none", "spell_resistance": "no", "description": "You point your finger at the target object, gaining the ability to lift it and move it at will from a distance. As a move action, you can propel the object as far as 15 feet in any direction, though the spell ends if the distance between you and the object ever exceeds the spell’s range. You can’t perform complex operations, such as firing a gun or using a computer, but you can shut a mechanical door or lid and work simple buttons to open or close automated doors or trigger an alarm.", "brief_description": "", "requires_resolve": false}, "raise dead": {"title": "Raise Dead", "level_requirements": ["Mystic 5"], "school": "conjuration", "casting_time": "1 minute", "range": "touch", "area": "", "targets": "one dead creature", "effect": "", "duration": "instantaneous", "saving_throw": "none, see text", "spell_resistance": "yes (harmless)", "description": "You restore life to a deceased creature. You can raise a creature that has been dead for no longer than 1 day per caster level. In addition, the target’s soul must be free and willing to return. If the target’s soul is not willing to return, the spell fails; therefore, a target that wants to return to life receives no saving throw against this spell. Casting this spell requires you to create a complex representation of the target deceased creature, worth at least 5,000 credits, to serve as a beacon for the creature’s soul. This object is consumed when you cast the spell.\r\n\r\nComing back from the dead is an ordeal. The target of the spell gains 2 permanent negative levels when it is raised, just as if it had been hit by a creature’s ability that bestows permanent negative levels. If the target is 1st level, it takes 2 Constitution drain instead (if this would reduce its Constitution to 0 or less, it can’t be raised). A raised creature returns with no Resolve Points, no Stamina Points, and no spell slots (until it rests to recover them normally). It has 5 Hit Points. Any ability scores reduced to 0 are raised to 1. Normal poison and normal disease are cured in the process of raising the target, but magical diseases and curses are not undone. While the spell closes mortal wounds and repairs lethal damage of most kinds, the body of the creature to be raised must be whole. Otherwise, missing parts are still missing when the creature is brought back to life.\r\n\r\nThe spell can’t bring back a creature that has died of old age. Constructs, elementals, and outsiders can’t be raised by this spell. It is possible to bring back a creature that has been turned into an undead creature, but the beacon for the creature’s soul must be more powerful, and must be worth at least 15,000 credits.", "brief_description": "", "requires_resolve": false}, "rapid repair": {"title": "Rapid Repair", "level_requirements": ["Technomancer 5"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one construct or weapon", "effect": "", "duration": "1 minute", "saving_throw": "Fortitude negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "On each round, the target construct or weapon regains 2d8 Hit Points. This does not stack with any fast healing the construct or weapon already has. You can’t target a construct or weapon that has been brought to 0 Hit Points or destroyed.", "brief_description": "", "requires_resolve": false}, "ray of exhaustion": {"title": "Ray of Exhaustion", "level_requirements": ["Mystic 3"], "school": "necromancy", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "1 minute/level", "saving_throw": "Fortitude partial, see text", "spell_resistance": "yes", "description": "You create an enervating ray of magic. You must make a ranged attack against your opponent’s EAC. On a hit, the target is immediately exhausted for the spell’s duration. A creature that succeeds at a Fortitude saving throw is only fatigued, unless it is already fatigued, in which case it instead becomes exhausted despite the saving throw.\r\n\r\nThis spell has no effect on a creature that is already exhausted. Unlike normal exhaustion or fatigue, the effect ends as soon as the spell’s duration expires.", "brief_description": "", "requires_resolve": false}, "recharge": {"title": "Recharge", "level_requirements": ["Technomancer 2"], "school": "evocation", "casting_time": "1 round", "range": "touch", "area": "", "targets": "one object", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (object)", "spell_resistance": "yes (object)", "description": "You restore up to 10 charges to a battery or 5 charges to a technological item capable of being charged by a battery. Since this spell takes your personal energy, you must spend 1 Resolve Point to cast it. If you recharge a battery, there is a 20% chance the battery is destroyed by the attempt.\r\n\r\nIf you restore more charges than the item can hold, the item must succeed at a Fortitude saving throw or take 1d6 electricity damage for each excess charge. This spell provides no knowledge of how many charges an item can safely hold, but you can choose to bestow fewer charges than the maximum allowed to reduce the risk; you must declare how many charges you are restoring before casting this spell.", "brief_description": "", "requires_resolve": false}, "reflecting armor": {"title": "Reflecting Armor", "level_requirements": ["Mystic 1"], "school": "abjuration", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "10 minutes/level or until dismissed (D); see text", "saving_throw": "", "spell_resistance": "", "description": "You create a shimmering skin-like coating of mystical force that covers your body, allowing you to reflect damage you take back against your attacker. At any time during this spell’s duration, when you take Hit Point damage from an attack made with a weapon by a foe within 100 feet, you can choose to dismiss the spell as a reaction. If you do, the armor crackles with energy as it disappears, arcing through the air to strike the attacking creature, which takes an amount of force damage equal to the damage dealt to you at the time this spell was dismissed (maximum 10). The target can attempt a Reflex save for half damage.", "brief_description": "", "requires_resolve": false}, "regenerate": {"title": "Regenerate", "level_requirements": ["Mystic 6"], "school": "conjuration", "casting_time": "3 rounds", "range": "touch", "area": "", "targets": "one living creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target’s severed body members (fingers, toes, hands, feet, arms, legs, tails, or even heads of multiheaded creatures), broken bones, and ruined organs (including eyes) grow back. After the spell is cast, the physical regeneration is complete in 1 round if the severed members are present and touching the creature. It takes 2d10 rounds otherwise.\r\n\r\nRegenerate also restores 12d8 Hit Points, rids the target of exhaustion and fatigue, and eliminates all nonlethal damage the target has taken. It has no effect on nonliving creatures (including undead).", "brief_description": "", "requires_resolve": false}, "reincarnate": {"title": "Reincarnate", "level_requirements": ["Mystic 4"], "school": "transmutation", "casting_time": "10 minutes", "range": "touch", "area": "", "targets": "one dead creature", "effect": "", "duration": "instantaneous; see text", "saving_throw": "none, see text", "spell_resistance": "yes (harmless)", "description": "When you cast this spell, you bring back a dead creature in another body, provided that its death occurred no more than 1 week before the casting of the spell and the target’s soul is free and willing to return. If the target’s soul is not willing to return, the spell fails; therefore, a target that wants to return receives no saving throw. Casting this spell requires a special monument worth at least 1,000 credits to serve as a beacon for the departed creature’s soul. This object is consumed when you cast the spell.\r\n\r\nSince the dead creature is returning in a new body, all physical ills and afflictions are removed. The condition of the creature’s remains is not a factor. So long as some small portion of the creature’s body still exists, it can be reincarnated, but the portion receiving the spell must have been part of the creature’s body at the time of death. The magic of the spell creates an entirely new young adult body for the soul to inhabit from the natural elements at hand. This process takes 1 hour to complete. When the body is ready, the target is reincarnated.\r\n\r\nA reincarnated creature recalls the majority of its former life and form. It retains any class features, feats, and skill ranks it formerly had. Its class, base attack bonus, base save bonuses, and Hit Points are unchanged. The creature should recalculate its ability scores from scratch as a member of its new race (remembering to include any ability score increases from leveling up). The target of the spell gains 2 permanent negative levels when it is reincarnated. If the target is 1st level, it takes 2 Constitution drain instead (if the Constitution drain would reduce its Constitution to 0 or less, the creature cannot be reincarnated). The target creature can decide whether its new body retains any of the implants it had in its former body. A spellcasting creature has a 50% chance of losing any given unused spell slot as if it had been used to cast a spell.\r\n\r\nFor a humanoid creature, the new incarnation is determined using the table on the facing page. For nonhumanoid creatures, a similar table of creatures of the same type should be created.\r\n\r\nElementals, outsiders, and undead creatures can’t be reincarnated. Any creature that can’t benefit from the mystic cure spell cannot be reincarnated. The spell can bring back a creature that has died of old age.\r\n\r\nThe reincarnated creature gains all abilities associated with its new form, including any forms of movement and speeds, natural attacks, extraordinary abilities, and the like, but it does not automatically speak the language of the new form it takes.\r\n\r\n\r\nd% | Incarnation\r\n:---:|:---:\r\n1–6 | Android\r\n7–14 | Dwarf\r\n15–22 | Elf\r\n23–30 | Gnome\r\n31–34 | Half-elf\r\n35–38 | Half-orc\r\n39–46 | Halfling\r\n47–55 | Human\r\n56–64 | Lashunta\r\n65–73 | Kasatha\r\n74–81 | Shirren\r\n82–90 | Vesk\r\n91–99 | Ysoki\r\n100 | Other (GM’s choice)\r\n\r\nA miracle or wish spell can restore a reincarnated creature to its original form.", "brief_description": "", "requires_resolve": false}, "remove affliction": {"title": "Remove Affliction", "level_requirements": ["Mystic 3"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature or object", "effect": "", "duration": "instantaneous or 10 minutes/level; see text", "saving_throw": "Will negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "You remove impurities from a creature or object, potentially neutralizing the curses, diseases, infestations, poisons, and other harmful conditions affecting it. If the target is a creature, you must attempt a caster level check (1d20 + your caster level) for each curse, disease, infestation, and poison affecting it (DC = 4 + the DC of the affliction). Success means that affliction is removed. Additionally, if the target is blind or deaf due to an affliction or damage, remove affliction restores vision and hearing unless the appropriate organ has been entirely removed from the creature’s body.\r\n\r\nA creature that is cured with remove affliction takes no additional effects from the curses, diseases, infestations, or poisons removed, and any temporary effects are ended, but the spell does not reverse instantaneous effects, such as Hit Point damage, temporary ability damage, or effects that don’t go away on their own (such as poison states). This spell cannot remove the curse from a cursed item, though a successful caster level check enables the creature afflicted with any such cursed item to remove the curse and get rid of it. Since the spell’s duration is instantaneous, it does not prevent the target from suffering from the same curse, disease, infestation, or poison after a new exposure at a later date.\r\n\r\nYou can instead cast this spell to neutralize the poison in a poisonous creature or object for 10 minutes per level. If you cast it on a creature, the creature can attempt a Will saving throw to negate the effect.\r\n\r\nRemove affliction counters bestow curse.", "brief_description": "", "requires_resolve": false}, "remove condition": {"title": "Remove Condition", "level_requirements": ["Mystic 2"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions in the same way as lesser remove condition, except you remove any one of the following conditions affecting the target: frightened, nauseated, shaken, sickened, or staggered.", "brief_description": "", "requires_resolve": false}, "remove condition, greater": {"title": "Remove Condition, Greater", "level_requirements": ["Mystic 5"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions as lesser remove condition, except you remove all of the following conditions affecting the target: cowering, dazed, frightened, nauseated, panicked, paralyzed, shaken, sickened, staggered, and stunned.", "brief_description": "", "requires_resolve": false}, "remove condition, lesser": {"title": "Remove Condition, Lesser", "level_requirements": ["Mystic 1"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "You remove any one of the following conditions affecting the target: shaken, sickened, or staggered. If the condition is the result of a disease or another ongoing effect, this spell removes the condition but does not cure the disease or ongoing effect, and the target can regain the condition from that effect as normal, potentially immediately. Lesser remove condition also doesn’t cure or remove other damage or conditions the target is suffering from any source, even the same source that caused the removed condition. Since this spell’s duration is instantaneous, it does not prevent the target from gaining the condition again.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "remove radioactivity": {"title": "Remove Radioactivity", "level_requirements": ["Technomancer 4", "Mystic 4"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "one creature or object or one 20-ft.-radius area", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (harmless, object)", "spell_resistance": "yes (harmless, object)", "description": "You remove all ongoing effects of radiation from a single target if you succeed at a caster level check (DC = the DC associated with the radiation effect). The target is cured of both the radiation’s poison effects and the radiation sickness disease, moving the target to the healthy state on both tracks. When cast on an area, a single casting of remove radioactivity removes radiation from a 20-foot-radius area around the point you touch. This spell has no power to negate naturally radioactive materials, and as long as such materials remain in an area, the radiation that was removed may return.", "brief_description": "", "requires_resolve": false}, "resilient sphere": {"title": "Resilient Sphere", "level_requirements": ["Technomancer 4"], "school": "evocation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one Large or smaller creature", "effect": "", "duration": "1 minute/level (D)", "saving_throw": "Reflex negates", "spell_resistance": "yes", "description": "A 10-foot-diameter globe of shimmering force encloses the target creature. The sphere contains the target for the spell’s duration. The sphere functions in the same way as a wall of force, except it can be negated by dispel magic. A target inside the sphere can breathe normally. The sphere can’t be physically moved either by creatures outside it or by the struggles of those within.", "brief_description": "", "requires_resolve": false}, "resistant aegis": {"title": "Resistant Aegis", "level_requirements": ["Technomancer 5", "Mystic 5"], "school": "abjuration", "casting_time": "1 standard action", "range": "30 ft.", "area": "", "targets": "up to 10 creatures wearing armor within range", "effect": "", "duration": "1 minute/level", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions as lesser resistant armor, except as indicated above, and the wearers and their gear gain DR 5/— or energy resistance 5 that protects against all five energy types.", "brief_description": "", "requires_resolve": false}, "resistant armor": {"title": "Resistant Armor", "level_requirements": ["Technomancer 4", "Mystic 4"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature wearing armor", "effect": "", "duration": "10 minutes/level", "saving_throw": "", "spell_resistance": "", "description": "This spell functions as lesser resistant armor, but the target and her gear gain DR 10/— or energy resistance 10 that protects against three energy types.", "brief_description": "", "requires_resolve": false}, "resistant armor, lesser": {"title": "Resistant Armor, Lesser", "level_requirements": ["Technomancer 3", "Mystic 3"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature wearing armor", "effect": "", "duration": "10 minutes/level", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "Lesser resistant armor grants the target (and its gear) protection from your choice of either kinetic damage or energy damage. If you choose kinetic damage, the target and her gear gain DR 5/— that protects against bludgeoning, piercing, and slashing damage. If you choose energy damage, pick any two of acid, cold, electricity, fire, and sonic damage. The target and her gear gain energy resistance 5 that protects against the chosen types of energy. This damage reduction or energy resistance doesn’t stack with any damage reduction or energy resistance the target already has, and multiple castings of this spell don’t stack.", "brief_description": "", "requires_resolve": false}, "restoration": {"title": "Restoration", "level_requirements": ["Mystic 4"], "school": "conjuration", "casting_time": "3 rounds", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions as lesser restoration, except it also removes temporary negative levels or 1 permanent negative level. You must spend 5 Resolve Points when casting this spell to remove a permanent negative level. This spell can’t be used to remove more than 1 permanent negative level from a target in a 1-week period.\r\n\r\nRestoration heals all temporary ability damage, and it restores all points permanently drained from a single ability score (your choice if more than one is drained). It also eliminates any fatigue or exhaustion suffered by the target, but it doesn’t remove any underlying source of fatigue or exhaustion. A target that has benefited from the removal of fatigue or exhaustion from this spell can’t benefit from either effect again for 24 hours.", "brief_description": "", "requires_resolve": false}, "restoration, lesser": {"title": "Restoration, Lesser", "level_requirements": ["Mystic 2"], "school": "conjuration", "casting_time": "3 rounds", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "Lesser restoration dispels any magical effects reducing one of the target’s ability scores, or it heals 1d4 temporary ability damage to one of the target’s ability scores. It also eliminates any fatigue suffered by the creature or improves an exhausted condition to fatigued, but it doesn’t remove any underlying source of fatigue or exhaustion. It also doesn’t heal permanent ability drain. A target that has benefited from the removal of fatigue or the reduction of exhaustion from lesser restoration can’t benefit from either effect again for 24 hours.", "brief_description": "", "requires_resolve": false}, "retrocognitron": {"title": "Retrocognitron", "level_requirements": ["Mystic 5"], "school": "divination", "casting_time": "1 minute", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "concentration, up to 1 minute/level", "saving_throw": "", "spell_resistance": "", "description": "This spell allows you to gain psychic impressions from past events that occurred in your current location. Retrocognition reveals psychic impressions from events that occurred over the course of the last hour throughout the first minute of the spell’s duration, followed by impressions from the next hour back throughout the next minute you concentrate, and so on. If a psychically traumatic or turbulent event happened during that period, you must succeed at a Will saving throw (DC = 15, 20, or 25, depending on the severity of the traumatic or turbulent event) or lose your concentration on the spell. If you fail this saving throw, the spell ends.\r\n\r\nAt mystic level 16th and higher, you can choose to collect impressions from over the course of a longer interval of time than an hour, beginning at 1 week per minute of concentration (as listed on the table below). The amount of detail you receive diminishes, so this eventually makes it harder to distinguish impressions left by anything but the most major events. In most circumstances, you can’t glean information about what occurred during the Gap with this spell.\r\n\r\nMystic Level | Period\r\n:---:|:---:\r\n16th–17th | 1 week per minute\r\n18th–19th | 1 year per minute\r\n20th | 1 decade per minute", "brief_description": "", "requires_resolve": false}, "rewire flesh": {"title": "Rewire Flesh", "level_requirements": ["Technomancer 4"], "school": "transmutation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 round/level (D); see text", "saving_throw": "Will negates and Fortitude half, see text", "spell_resistance": "yes", "description": "Like rewriting the code that makes up a computer program, you manipulate the target’s DNA to painfully rewire that target’s biological functions to mimic the cold and rigid processes of a robot. The target must succeed at a Will saving throw, or all of its movement speeds are halved and it takes 3d6 slashing damage per round on its turn as its internal organs shift and transform to become more like the inner components of a robot. Each round, the target can attempt a Fortitude saving throw to halve the damage this spell causes.\r\n\r\nWhile this spell is in effect, the target’s body becomes visibly more robotic; its voice is tinny and halting, its movements are jerky, and its face is unmoving and emotionless. The target has the flat-footed condition, and it takes a –2 penalty to all Sense Motive checks as well as to all Charisma-based and Dexterity-based skill and ability checks.", "brief_description": "", "requires_resolve": false}, "rewire flesh, mass": {"title": "Rewire Flesh, Mass", "level_requirements": ["Technomancer 6"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one door, container, or portal up to 30 sq. ft./level in size", "effect": "", "duration": "24 hours", "saving_throw": "none", "spell_resistance": "no", "description": "A security seal spell magically locks a single door, container with a lid or latch, portal, or computer system. Casting this spell requires you to spend 1 Resolve Point. You can freely bypass your own security seal without affecting it. If the sealed object has a lock, the DC to open that lock increases\r\nby 5 while it remains attached to the object. If the object doesn’t have a lock, this spell creates one that can only be opened with a successful DC 20 Engineering check to disable devices. If the sealed object has computer security, the DC to bypass that security increases by 5. A door or object secured with this spell can be opened only by breaking in or with a successful dispel magic or knock spell. Add 5 to the normal DC to break open a door or portal affected by this spell. A knock spell removes the security seal automatically, counting as one means of closure.", "brief_description": "", "requires_resolve": false}, "security seal": {"title": "Security Seal", "level_requirements": ["Technomancer 2"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one door, container, or portal up to 30 sq. ft./level in size", "effect": "", "duration": "24 hours", "saving_throw": "none", "spell_resistance": "no", "description": "A security seal spell magically locks a single door, container with a lid or latch, portal, or computer system. Casting this spell requires you to spend 1 Resolve Point. You can freely bypass your own security seal without affecting it. If the sealed object has a lock, the DC to open that lock increases\r\nby 5 while it remains attached to the object. If the object doesn’t have a lock, this spell creates one that can only be opened with a successful DC 20 Engineering check to disable devices. If the sealed object has computer security, the DC to bypass that security increases by 5. A door or object secured with this spell can be opened only by breaking in or with a successful dispel magic or knock spell. Add 5 to the normal DC to break open a door or portal affected by this spell. A knock spell removes the security seal automatically, counting as one means of closure.", "brief_description": "", "requires_resolve": false}, "see invisibility": {"title": "See Invisibility", "level_requirements": ["Mystic 2", "Technomancer 2"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "10 minutes/level (D)", "saving_throw": "", "spell_resistance": "", "description": "You can see any invisible or ethereal objects or beings within your range of vision, as if they were normally visible. Such creatures are visible to you as translucent shapes, allowing you easily to discern the difference between visible and invisible or ethereal creatures.\r\n\r\nThe spell doesn’t reveal the method used to obtain invisibility, doesn’t reveal illusions or enable you to see through opaque objects, and doesn’t reveal creatures that are simply concealed, hiding, or otherwise hard to see.", "brief_description": "", "requires_resolve": false}, "shadow walk": {"title": "Shadow Walk", "level_requirements": ["Technomancer 6", "Mystic 6"], "school": "illusion", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "up to one Medium creature or vehicle/level", "effect": "", "duration": "1 hour/level (D)", "saving_throw": "Will negates (object)", "spell_resistance": "yes (object)", "description": "To use shadow walk, you must be in an area of dim light. You and any creature or vehicle you touch are then transported along a coiling path of shadowstuff to the edge of the Material Plane where it borders the Plane of Shadow. The effect is largely illusory, but the path is quasi-real.\r\n\r\nAll targets affected must be in direct contact with one another. A Large target counts as two Medium targets, a Huge target counts as four Medium targets, and so forth. Creatures you transport this way can opt to follow you, wander off through the plane, or stumble back into the Material Plane (50% chance for either of the latter results if the creatures are lost or abandoned by you). Creatures unwilling to accompany you into the Plane of Shadow can attempt a Will saving throw to negate the effect.\r\n\r\nIn the region of shadow, you move at a rate of 200 miles per hour. Because of the blurring of reality between the Plane of Shadow and the Material Plane, you can’t make out details of the terrain or areas you pass over during transit nor can you predict perfectly where your travel will end. It’s impossible to judge distances accurately, making the spell virtually useless for scouting or spying. Furthermore, when the spell effect ends, you are shunted 1d10 × 100 feet in a random horizontal direction from your desired endpoint. If this would place you within a solid object, you (and any creatures with you) are shunted to the nearest empty space available, but the strain of this activity renders each creature fatigued (no saving throw).\r\n\r\nShadow walk can also be used to travel to other planes that border on the Plane of Shadow (except for the Drift), but this usage requires you to travel across the Plane of Shadow to arrive at a border with another plane of reality, which takes 1d4 hours.", "brief_description": "", "requires_resolve": false}, "shadowy fleet": {"title": "Shadowy Fleet", "level_requirements": ["Technomancer 6"], "school": "illusion", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "60-ft. radius", "targets": "", "effect": "", "duration": "1 round/level", "saving_throw": "Will disbelief and Reflex half, see text", "spell_resistance": "yes", "description": "You create a powerful vision of a fleet of hostile starships overhead that appears to rain fiery laser shots mercilessly\r\nat your enemies. The ships appear to be 1,000 feet overhead and target a 60-foot-radius area that you designate on the ground. You can’t cast this spell indoors unless you are within a structure that a fleet of starships could believably fit within.\r\n\r\nEach round this spell is in effect, the starships deal 3d6 piercing damage and 3d6 fire damage to all hostile creatures in the area as the ships appear to shoot lasers at your enemies. If a creature interacts with the illusion (such as by taking damage), it can attempt a Will saving throw to take only half of this damage per round for the remainder of the spell. Regardless of whether a creature disbelieves the illusion, each round it takes damage from this spell, it can attempt a Reflex saving throw to instead take half damage; thus, if a creature that succeeded at its Will saving throw also succeeds at its Reflex save in a given round, it takes one-quarter the spell’s damage that round.", "brief_description": "", "requires_resolve": false}, "share language": {"title": "Share Language", "level_requirements": ["Mystic 1"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "24 hours", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "For 24 hours, the target can read, understand, and communicate to the best of its ability in up to three languages that you already know. This doesn’t change the physical nature of the creature (if it lacks a means of speech, it still can’t talk) or its attitude toward you. It does, however, allow intelligent creatures that normally have no language to understand and (if physically capable) communicate in the languages granted by this spell.", "brief_description": "", "requires_resolve": false}, "shield other": {"title": "Shield Other", "level_requirements": ["Mystic 2"], "school": "abjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature", "effect": "", "duration": "1 hour/level (D)", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell wards the target and creates a mystic connection between you and the target so that some of its wounds are transferred to you. Casting this spell requires you to spend 1 Resolve Point. The target takes only half damage from all wounds and attacks (including those dealt by special abilities) that deal Hit Point damage, and you take the amount of damage not taken by the target. Only Hit Point damage is transferred in this manner; the target’s Stamina Points are damaged as normal. If you still have Stamina Points, you take the damage to your Stamina Points before Hit Points, as with normal damage.\r\n\r\nForms of harm that do not involve Hit Points, such as charm effects, temporary ability damage, ability drain, permanent negative levels, and death effects, are not affected. When the spell ends, subsequent damage is no longer divided between the target and you, but damage already split is not reassigned to the target. If you and the target of the spell move out of range of each other, the spell ends.", "brief_description": "", "requires_resolve": false}, "slow": {"title": "Slow", "level_requirements": ["Mystic 3", "Technomancer 3"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 round/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "An affected creature moves and attacks at a drastically slowed rate. Creatures affected by this spell are staggered (see page 277) and can take only a single move action or standard action each turn, but not both, and it can’t take full actions. A slowed creature moves at half its normal speed (round down to the next 5-foot increment). Multiple slow effects don’t stack. Slow counters and negates haste.", "brief_description": "", "requires_resolve": false}, "snuff life": {"title": "Snuff Life", "level_requirements": ["Mystic 6"], "school": "necromancy", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "up to one creature/2 levels, no two of which can be more than 30 ft. apart", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude partial, see text", "spell_resistance": "yes", "description": "You twist the essence of life that flows through your targets, snuffing the spark out of weaker creatures and debilitating or disabling others. This spell’s effects depend on each target’s CR.\r\n\r\nA creature of CR 5 or lower is slain by this spell. If it succeeds at a Fortitude saving throw, it is instead reduced to 1 Hit Point. \r\n\r\nA creature of CR 6–10 takes 10d20 damage and is stunned for 3 rounds. If it succeeds at a Fortitude saving throw, it takes half damage and negates the stunned effect.\r\n\r\nA creature of CR 11–14 takes 8d20 damage and is staggered for 3 rounds. If it succeeds at a Fortitude saving throw, it takes half damage and negates the staggered effect.\r\n\r\nA creature of CR 15 or higher takes 6d20 damage. If it succeeds at a Fortitude saving throw, it takes half damage.\r\n\r\nRegardless of whether the target succeeds at its saving throw, it still might die from the damage this spell deals, though in this case the spell is not a death effect.", "brief_description": "", "requires_resolve": false}, "soothing protocol": {"title": "Soothing Protocol", "level_requirements": ["Technomancer 4"], "school": "enchantment", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one construct with the technological subtype; see text", "effect": "", "duration": "10 minutes/level", "saving_throw": "none", "spell_resistance": "yes", "description": "Waves of calming programming ebb from your touch, potentially stabilizing a construct’s harmful intentions toward you and your allies. The target construct must have a CR lower than your level; if it does, the construct is convinced that you and your allies pose no threat. It can’t take violent actions against you or your allies, and it can’t do anything that would otherwise harm or threaten you (though it continues to carry out orders to take actions that do not harm or threaten you). Any aggressive action or damage dealt by you or your allies to a construct soothed in this way or its allies immediately ends this spell’s effects (and could cause the construct to attack you, if it was doing so previously).\r\nIf an affected construct is under the control of a spellcaster or another creature, the controlling creature can spend a full action to remove soothing protocol, as long as it can either touch the construct or give it an order.", "brief_description": "", "requires_resolve": false}, "speak with dead": {"title": "Speak With Dead", "level_requirements": ["Mystic 3"], "school": "necromancy", "casting_time": "10 minutes", "range": "10 ft.", "area": "", "targets": "one dead creature", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates, see text", "spell_resistance": "no", "description": "You grant the semblance of life to a corpse, allowing it to answer questions. You can ask up to six questions. The corpse’s knowledge is limited to what it knew during life, including the languages it spoke. Answers are brief, cryptic, or repetitive, especially if the creature would have opposed you in life.\r\n\r\nIf the dead creature was friendly or helpful toward you in life, the spell works automatically. Otherwise, the corpse can attempt a Will saving throw to resist the spell as if it were alive. On a successful save, the corpse can refuse to answer your questions or attempt to deceive you using its Bluff skill. The target can speak only about what it knew in life. It can’t answer any questions that pertain to events that occurred after its death.\r\n\r\nIf the corpse has been subjected to speak with dead within the past week, this spell fails. You can cast this spell on a corpse that has been deceased for any amount of time, but the body must be mostly intact to be able to respond. A damaged corpse might be able to give partial answers or partially correct answers, but it must have at least a mouth in order to speak at all. This spell does not affect a corpse that has been turned into an undead creature.", "brief_description": "", "requires_resolve": false}, "mystic cure, mass": {"title": "Mystic Cure, Mass", "level_requirements": ["Mystic 5", "Mystic 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels); see text", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "instantaneous", "saving_throw": "Will half (harmless)", "spell_resistance": "yes (harmless)", "description": "You restore a number of Hit Points to a number of targets. Choose one of these targets within 10 feet of you; if that target regains all of its Hit Points as a result of this healing, you can apply the remaining healing to yourself, as long as you are a living creature. On the other hand, if this isn’t enough to restore all of that target’s Hit Points, you can transfer any number of your own Hit Points to that target, healing the target that amount. You can’t transfer more Hit Points than you have or more Hit Points than the target is missing.\r\n\r\nThe number of Hit Points mass mystic cure restores to each target depends on the spell’s level. \r\n\r\n**5th:** 3d8 + your Wisdom modifier\r\n**6th:** 5d8 + your Wisdom modifier", "brief_description": "", "requires_resolve": false}, "stabilize": {"title": "Stabilize", "level_requirements": ["Mystic 0"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "If the target of this spell has 0 Hit Points and is dying, it automatically stabilizes. If the creature later takes damage, it is no longer stable.", "brief_description": "", "requires_resolve": false}, "status": {"title": "Status", "level_requirements": ["Mystic 2"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "up to one living creature touched/3 levels", "effect": "", "duration": "1 hour/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "When you need to keep track of comrades who get separated, status allows you to mentally monitor their relative positions and general conditions. You are aware of the direction of and distance to the creatures and any conditions or states affecting them: confused, diseased, dying, nauseated, panicked, poisoned, staggered, stunned, unconscious, unharmed, wounded, wounded and out of Stamina points, and the like. Once the spell has been cast upon the targets, the distance between them and the caster does not affect the spell as long as they are on the same plane of existence. If a target leaves the plane (including via Drift travel) or dies, the spell ceases to function for that creature.", "brief_description": "", "requires_resolve": false}, "subjective reality": {"title": "Subjective Reality", "level_requirements": ["Mystic 6"], "school": "illusion", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "", "spell_resistance": "", "description": "Choose one object or creature you can see within long range (400 feet + 40 feet/level). You alter your perceptions to become convinced the target is an illusion. For you, the target becomes transparent and does not create sound or smell. Until the spell ends, you can move through the target unimpeded and the target can move through you. The target’s nonmagical attacks can’t harm you, and the target’s magical attacks deal half damage to you. The target’s non-damaging magical abilities have only a 50% chance of affecting you, and you are immune to all its sonic, language-dependent, and scent-based attacks. However, your attacks deal no damage to the target, and your magical abilities don’t affect the target at all. You or the target can affect each other normally through intermediaries. For instance, while the target would be immune to the direct effects of your charm monster spell, if you charmed another creature that then attacked the target creature, the target would not be immune to the damage from that attack.", "brief_description": "", "requires_resolve": false}, "suggestion": {"title": "Suggestion", "level_requirements": ["Mystic 3"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "1 hour/level or until completed", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You influence the actions of the target creature by suggesting a course of activity (limited to a sentence or two). The suggestion must be worded in such a manner as to make the activity sound reasonable. Asking the creature to do some obviously harmful act automatically negates the effect of the spell.\r\n\r\nThe suggested course of activity can continue for the entire duration of the spell. If the suggested activity can be completed in a shorter time, the spell ends when the target finishes what it was asked to do. You can instead specify conditions that will trigger a special activity during the duration. If the condition is not met before the spell’s duration expires, the activity is not performed.\r\n\r\nA very reasonable suggestion imparts a penalty (such as –1 or –2) to the target’s saving throw.", "brief_description": "", "requires_resolve": false}, "suggestion, mass": {"title": "Suggestion, Mass", "level_requirements": ["Mystic 6"], "school": "enchantment", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "up to one creature/level, no two of which can be more than 30 ft. apart", "effect": "", "duration": "1 hour/level or until completed", "saving_throw": "", "spell_resistance": "", "description": "This spell functions as _suggestion_, except it can affect more creatures. All of the affected creatures are subject to the same suggestion.", "brief_description": "", "requires_resolve": false}, "supercharge weapon": {"title": "Supercharge Weapon", "level_requirements": ["Technomancer 1"], "school": "evocation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one weapon", "effect": "", "duration": "see text", "saving_throw": "none", "spell_resistance": "no", "description": "You supercharge the target weapon. If the weapon’s next attack hits (provided it is made before the end of the next round), the attack deals 4d6 additional damage if the weapon is a single target attack or 2d6 additional damage if the weapon attacks all creatures in an area. This bonus damage is of the same type as the weapon’s normal damage.", "brief_description": "", "requires_resolve": false}, "sympathetic vibration": {"title": "Sympathetic Vibration", "level_requirements": ["Technomancer 6"], "school": "evocation", "casting_time": "10 minutes", "range": "touch", "area": "", "targets": "one freestanding structure or vehicle", "effect": "", "duration": "up to 1 round/level", "saving_throw": "none", "spell_resistance": "yes", "description": "By attuning yourself to a freestanding structure or vehicle (this doesn’t include starships), you can create a damaging vibration within it. Once it begins, the vibration deals 2d10 sonic damage per round to the target, bypassing hardness. You can choose at the time of casting to limit the duration of the spell; otherwise, it lasts for 1 round per level. If the spell is cast upon a target that is not freestanding, the surrounding material dissipates the effect and no damage occurs.\r\n\r\nSympathetic vibration can’t affect creatures (even if they are constructs).", "brief_description": "", "requires_resolve": false}, "synapse overload": {"title": "Synapse Overload", "level_requirements": ["Technomancer 5"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one living creature", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude partial", "spell_resistance": "yes", "description": "To affect the target, you must hit with a melee attack against its EAC; you can add your key ability score modifier to this attack roll instead of your Strength modifier if it is higher. You then overload the target’s mind, causing the target’s synapses to violently trigger. The target takes 18d8 damage and is staggered for 1 minute. A target can negate the staggered effect with a successful Fortitude saving throw, but still takes full damage.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "synaptic pulse": {"title": "Synaptic Pulse", "level_requirements": ["Mystic 3"], "school": "enchantment", "casting_time": "1 standard action", "range": "20 ft.", "area": "20-ft.-radius spread centered on you", "targets": "", "effect": "", "duration": "1 round", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You stun all creatures in range for 1 round.", "brief_description": "", "requires_resolve": false}, "telekinesis": {"title": "Telekinesis", "level_requirements": ["Technomancer 5"], "school": "transmutation", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "see text", "effect": "", "duration": "concentration (up to 1 round/level) or instantaneous; see text", "saving_throw": "none, Will negates (object), see text", "spell_resistance": "yes (object), see text", "description": "You move objects or creatures by concentrating on them. Depending on your desired effect (choose one from below), the spell can perform a variety of combat maneuvers, provide a gentle, sustained force, or exert a single short, violent thrust.\r\n\r\n**Combat Maneuver:** Once per round, you can use telekinesis to perform a ranged attack that acts as a bull rush, disarm, grapple (including pin), or trip combat maneuver. Resolve these attempts as normal, but use your caster level plus your key ability score modifier as your attack bonus. No saving throw is allowed against these attempts, but spell resistance applies normally. This version of the spell can last 1 round per caster level, but it ends if you cease concentrating.\r\n\r\n**Sustained Force:** A sustained force moves an object of no more than 25 pounds or 2 bulk per caster level up to 20 feet per round in any direction (including up or down). A creature can negate the effect on an object it holds with a successful Will save or with spell resistance. This version of the spell lasts 1 round per caster level, but it ends if you cease concentrating. The spell ends if the object is forced beyond the spell’s range.\r\n\r\nYou can telekinetically manipulate an object as if with one hand. For example, a lever can be pulled, a key turned, a button pushed, an object rotated, and so on if the force required is within the weight limitation. You might even be able to untie simple knots, though a delicate activity such as this requires a successful DC 15 Intelligence check.\r\n\r\n**Violent Thrust:** The spell energy can be spent in a single round. You can hurl up to 15 objects or creatures that are within range (no two of which can be more than 10 feet apart) toward any target within 150 feet of all the objects. You can hurl up to a total weight of 400 pounds or 40 bulk. You must make attack rolls (one per creature or object thrown) to hit the target with the items, using your base attack bonus plus your key ability score modifier as your attack bonus. All objects cause damage ranging from 1 damage per 25 pounds or 2 bulk (for less dangerous objects) to 1d10 damage per 25 pounds or 2 bulk (for extremely dangerous objects, such as weapons or bladed or spiked objects). Objects and creatures that miss the target land in a square adjacent to the target. Creatures that fall within the weight capacity of the spell can be hurled, but they can attempt Will saving throws (or rely on spell resistance) to negate the effect, as can those whose held possessions are targeted by the spell. If a thrown creature is hurled against a solid surface, it takes 1d6 damage as if it had fallen 10 feet.", "brief_description": "", "requires_resolve": false}, "telekinetic projectile": {"title": "Telekinetic Projectile", "level_requirements": ["Mystic 0"], "school": "evocation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one object and one creature", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "You fling an object weighing up to 5 pounds (less than 1 bulk) at the target, making a ranged attack against its KAC. If you hit, you deal 1d6 bludgeoning damage to both the target and the object. The type of object thrown doesn’t change the damage type or any other properties of the attack.", "brief_description": "", "requires_resolve": false}, "telepathic bond": {"title": "Telepathic Bond", "level_requirements": ["Mystic 4"], "school": "divination", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "you plus up to one willing creature per 3 levels, no two of which can be more than 30 ft. apart", "effect": "", "duration": "10 minutes/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "You forge a telepathic bond between yourself and a number of willing creatures, each of which must have an Intelligence score of 3 or higher (or a modifier of –4 or higher). Each creature included in the link is linked to all the others. The creatures can communicate telepathically through the bond regardless of language. No special power or influence is established as a result of the bond. Once the bond is formed, it works over any distance (although not from one plane to another).\r\n\r\nIf desired, you can leave yourself out of the telepathic bond forged. This decision must be made at the time of casting.", "brief_description": "", "requires_resolve": false}, "telepathic jaunt": {"title": "Telepathic Jaunt", "level_requirements": ["Mystic 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "you and touched objects and other touched willing or unconscious creatures", "effect": "", "duration": "instantaneous", "saving_throw": "none, Will negates (object)", "spell_resistance": "no, yes (object)", "description": "Telepathic jaunt thrums along the mental connection you have with a creature with which you currently have an active telepathic bond via your mystic telepathic bond class feature (but not via the telepathic bond spell), and it instantly teleports you to that creature. This spell teleports you to a random, unoccupied square adjacent to the creature with which you have the telepathic bond. If no such square is available, you teleport to the closest eligible square; if the nearest eligible square is more than 50 feet away from the creature, this spell fails.\r\n\r\nYou can be transported any distance within a plane, even across the galaxy, but you can’t travel between planes, and you can’t transport yourself to a creature if one of you is traveling via Drift travel and the other isn’t. In addition to yourself, you can transport any objects you carry as long as their weight doesn’t exceed your maximum load. You can also bring up to six additional willing or unconscious Medium or smaller creatures (each carrying gear or objects up to its maximum load) or their equivalent. A Large creature counts as two Medium creatures, and a Huge creature counts as two Large creatures. All creatures to be transported must be in contact with one another, and at least one of those creatures must be in contact with you. Exceeding this limit causes the spell to fail. There must be sufficient space near the creature with which you have the telepathic bond for all the creatures you are teleporting, or this spell fails.", "brief_description": "", "requires_resolve": false}, "telepathic message": {"title": "Telepathic Message", "level_requirements": ["Technomancer 0", "Mystic 0"], "school": "divination", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "up to one creature/level", "effect": "", "duration": "10 minutes/level", "saving_throw": "none", "spell_resistance": "no", "description": "You can send a short telepathic message and hear simple telepathic replies. Any living creature within 10 feet of you or an intended recipient also receives your telepathic message if it succeeds at a DC 25 Perception check. You must be able to see or hear each recipient. The creatures that receive the message can reply telepathically, but no more than a single message can be sent each round, and each message cannot exceed 10 words. A technomancer casting this spell can also use it to send a message to a computer or a construct with the technological subtype if the receiving target is designed to receive messages.", "brief_description": "", "requires_resolve": false}, "telepathy": {"title": "Telepathy", "level_requirements": ["Mystic 5"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "10 minute/level", "saving_throw": "", "spell_resistance": "", "description": "You can mentally communicate with any other creature within 100 feet that has a language. It is possible to address multiple creatures at once telepathically, although maintaining a telepathic conversation with more than one creature at a time is just as difficult as speaking and listening to multiple people simultaneously. You can’t use telepathy to locate creatures to communicate with them, but once you’ve established telepathic communication, you don’t require line of effect to maintain it.", "brief_description": "", "requires_resolve": false}, "teleport": {"title": "Teleport", "level_requirements": ["Technomancer 5"], "school": "conjuration", "casting_time": "1 standard action", "range": "2,000 miles", "area": "", "targets": "you and touched objects and other touched willing or unconscious creatures", "effect": "", "duration": "instantaneous", "saving_throw": "none, Will negates (object)", "spell_resistance": "no, yes (object)", "description": "This spell instantly transports you to a designated destination within 2,000 miles. Interplanar and interplanetary travel is not possible, and neither is travel between two moving starships during combat, though you might be able to teleport to a planet’s surface from an orbiting starship. You can bring along objects as long as their weight doesn’t exceed your maximum bulk limit. You can also bring up to five additional willing or unconscious Medium or smaller creatures (carrying gear or objects up to its maximum load) or their equivalent. A Large creature counts as two Medium creatures, and a Huge creature counts as four Medium creatures. All creatures to be transported must be in contact with one another, and at least one of those creatures must be in contact with you. As the caster, you need not attempt a saving throw, nor is spell resistance applicable to you. Only objects held or in use by another creature receive saving throws and benefit from spell resistance.\r\n\r\nYou must have some clear idea of the location and layout of the destination. The clearer your mental image, the more likely the teleportation works. Areas of strong physical or magical energy can make teleportation more hazardous or even impossible. To see how well the teleportation works, roll d% and consult Table 10–1. Refer to the following information for definitions of the terms on the table.\r\n\r\nFamiliarity | On Target | Off Target | Similar Area | Mishap\r\n:---:|:---:|:---:|:---:|:---:\r\nVery familiar | 1–97 | 98–99 | 100 | —\r\nStudied carefully | 1–94 | 95–97 | 98–99 | 100\r\nSeen casually | 1–88 | 89–94 | 95–98 | 99–100\r\nViewed once | 1–76 | 77–88 | 89–96 | 97–100\r\nFalse destination | — | — | 81–92 | 93–100\r\n\r\n**Familiarity:** “Very familiar” describes a place you have been very often and where you feel at home. “Studied carefully” describes a place you know well, either because you can currently physically see it or because you’ve been there often. “Seen casually” describes a place you have been to more than once but with which you are not very familiar. “Viewed once” describes a place you have seen once in person or have extensively studied through scrying magic, remote cameras, or recorded images (for a remote-viewed location, you still need to have a clear idea of the location; you can’t teleport to an unknown location that you’ve seen in a holovid).\r\n\r\n“False destination” describes a place that doesn’t truly exist, or if you are teleporting to an otherwise familiar location, it is a place that no longer exists as such or has been so completely altered as to no longer be familiar to you. When traveling to a false destination, roll 1d20+80 to obtain results on the table, rather than rolling d%, since there is no real destination for you to hope to arrive at or even be off target from.\r\n\r\n**On Target:** You appear where you want to be.\r\n\r\n**Off Target:** You appear safely a random distance away from the destination in a random direction. The distance off target is d% of the distance that was to be traveled. The direction off target is determined randomly.\r\n\r\n**Similar Area:** You wind up in an area that’s visually or thematically similar to the target area. Generally, you appear in the closest similar place within range. If no such area exists within the spell’s range, the spell simply fails instead.\r\n\r\n**Mishap:** You and anyone else teleporting with you have gotten “scrambled.” You each take 2d10 damage, and you reroll on the chart to see where you wind up. For these rerolls, roll 1d20+80. Each time “mishap” comes up, the creatures take more damage and must reroll.", "brief_description": "", "requires_resolve": false}, "terraform": {"title": "Terraform", "level_requirements": ["Mystic 6"], "school": "transmutation", "casting_time": "1 hour", "range": "100 ft.", "area": "100-ft.-radius emanation centered on you", "targets": "", "effect": "", "duration": "1 day/level; see text", "saving_throw": "none", "spell_resistance": "no", "description": "You alter the area’s terrain and climate to a new terrain and climate type appropriate to the planet or plane. For example, you might transform a desert into plains. To cast this spell, you must spend 10 Resolve Points along with technological gear worth 30,000 credits (which is magically augmented to do much of the terraforming, then consumed by the spell). A xenodruid mystic instead uses crystals and incenses worth 30,000 credits. This magically alters the area’s climate and normal plants to those appropriate to the new terrain, but it doesn’t affect creatures or the configuration of the ground. Transforming rocky hills into forested areas converts grasses into shrubs and small trees, but it doesn’t flatten the hills or change the animals to suit the new environment.\r\n\r\nYou can alter the climate by one step (cold, temperate, or warm). The maximum extent of the terrain change is up to the GM, but in general it changes to a similar terrain type or by one step within that terrain type (such as from a typical forest to a forest with massive trees or light undergrowth, from a shallow bog to a deep bog, and so on).\r\n\r\nMultiple castings of the spell in the same area can create an area with radically different terrain and climate than the surrounding land. The GM can decide that certain terrain shifts are unsustainable and shorten the duration or that some are suitable for the area and extend the duration. This spell could have many secondary effects based on the nature of the change, the type of bordering terrain, and so on; these should be determined by the GM on a case-by-case basis. For example, transforming a desert requires drawing water up from underground to sustain the plants, which could deplete the water table in nearby areas.", "brief_description": "", "requires_resolve": false}, "token spell": {"title": "Token Spell", "level_requirements": ["Mystic 0", "Technomancer 0"], "school": "transmutation", "casting_time": "1 standard action", "range": "10 ft.", "area": "see text", "targets": "see text", "effect": "see text", "duration": "1 hour", "saving_throw": "none", "spell_resistance": "yes", "description": "Token spells are often some of the first minor changes that spellcasters produce when they begin experimenting with magic. Once cast, token spell enables you to perform simple magical effects for 1 hour. The effects are minor and have severe limitations. You can slowly lift one item of light bulk. You can alter items in a 1-foot cube each round, coloring, cleaning, soiling, cooling, warming, or flavoring them. You can create small objects, but they look artificial and are extremely fragile (they can’t be used as tools or weapons). You can illuminate an object to shed dim light in a 30-foot radius.\r\nToken spell lacks the power to duplicate any other spell effects. Any actual change to an object (beyond moving, cleaning, or soiling it) persists for only 1 hour.", "brief_description": "", "requires_resolve": false}, "tongues": {"title": "Tongues", "level_requirements": ["Mystic 3", "Technomancer 3"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "10 minutes/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "no", "description": "This spell grants the creature touched the ability to speak and understand the spoken or signed language of any intelligent creature, whether it is a racial tongue or a regional dialect. The target can speak only one language at a time, although it may be able to understand several languages. Tongues does not enable the target to speak with creatures who don’t speak. The target can make itself understood as far as its voice carries.", "brief_description": "", "requires_resolve": false}, "transfer charge": {"title": "Transfer Charge", "level_requirements": ["Technomancer 0"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "two objects of the same type; see text", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (object)", "spell_resistance": "yes (object)", "description": "You can transfer any number of charges from one battery to another battery or from one power cell to another power cell. You can only transfer charges using two objects of the exact same type (two batteries of the same size, two identical power cells, or the like); you transfer charges from the source object to the receiving object.\r\n\r\nYou must declare how many charges you are transferring before casting this spell. If you transfer more charges from the source than the receiving item can hold, the receiving item must succeed at a Fortitude saving throw or take 1d6 electricity damage. This spell provides no knowledge of how many charges a receiving item can safely hold, but you can choose to transfer fewer charges than the maximum allowed to reduce the risk.", "brief_description": "", "requires_resolve": false}, "true seeing": {"title": "True Seeing", "level_requirements": ["Mystic 6", "Technomancer 6"], "school": "divination", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "You confer upon the target the ability to see all things within 120 feet as they actually are. The target sees through normal and magical darkness, notices secret doors hidden by magic, sees the exact locations of creatures or objects that are invisible or displaced, sees through illusions, and sees the true form of changed or transmuted things. Further, the target can focus its vision to see into the Ethereal Plane (but not into extradimensional spaces).\r\n\r\nTrue seeing, however, does not penetrate solid objects. It in no way confers X-ray vision or its equivalent. It does not negate concealment, including that caused by fog and the like. True seeing does not help the viewer see through mundane disguises, spot creatures who are simply hiding, or notice secret doors hidden by mundane means.", "brief_description": "", "requires_resolve": false}, "unwilling guardian": {"title": "Unwilling Guardian", "level_requirements": ["Technomancer 5"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./level)", "area": "", "targets": "one creature with CR lower than your level; see text", "effect": "", "duration": "1 round/level (D)", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "Your overwhelming presence bores into the target’s mind, cowing its will. This turns it into an automaton-like guardian that protects you at all costs. As soon as it is able, the target mindlessly moves along the most direct route toward you and stops when it is within 10 feet of you (provoking attacks of opportunity for movement as normal). If you are being attacked in melee by a creature within 10 feet, the target instead takes the quickest route to intercept that creature from a square within 10 feet of you and attack it on your behalf.\r\n\r\nWhile this spell is in effect, the target attacks any creature that attacks you in melee, though it can’t move more than 10 feet from you to do so. If multiple creatures are attacking you in melee, you can choose which creature the target attacks on your behalf as part of combat banter. If you are the target of ranged attacks and your guardian is not attacking a melee assailant on your behalf, it moves to provide cover against the ranged attacks. Due to the strong momentary connection between you and your unwilling guardian, if you are the single target of a hostile creature’s spell or effect, the creature must succeed at a caster level check (DC = 6 + your caster level) or the spell or effect instead targets your guardian. This spell has no effect on area of effect or multi-target spells or other effects that include you as a target.\r\n\r\nWhen this spell ends, the target regains control of its faculties entirely and it knows and remembers that you used magic to control it. Once a creature has been the target of unwilling guardian, it can’t be targeted with this spell again for 24 hours if cast by the same spellcaster.", "brief_description": "", "requires_resolve": false}, "unseen servant": {"title": "Unseen Servant", "level_requirements": ["Technomancer 1"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "", "effect": "one invisible, mindless, shapeless servant", "duration": "1 hour/level", "saving_throw": "none", "spell_resistance": "no", "description": "The spell conjures an invisible, mindless, shapeless force that performs simple tasks at your command (a move action). It can run and fetch things, open unstuck doors, and hold chairs, as well as clean and mend. The servant can perform only one activity at a time, but it repeats the same activity over and over again if told to do so as long as you remain within range. It has an effective Strength score of 2 (so it can lift up to 20 pounds or 2 bulk or drag up to 100 pounds or 10 bulk). It can trigger traps and such, but it can’t exert enough force to activate certain pressure plates and other devices. It can’t perform any task that requires a skill check with a DC higher than 10 or that requires a check using a skill that can’t be used untrained. This servant can’t fly, climb, or swim (though it can walk on water). Its land speed is 15 feet.\r\n\r\nThe servant can’t attack in any way; it is never allowed to make attack rolls. It can’t be killed, but it dissipates if it takes 6 or more damage from area attacks; it gets no saving throws against attacks.", "brief_description": "", "requires_resolve": false}, "veil": {"title": "Veil", "level_requirements": ["Technomancer 6"], "school": "illusion", "casting_time": "1 standard action", "range": "long (400 ft. + 40 ft./level)", "area": "", "targets": "up to one or more creatures, no two of which can be more than 30 ft. apart", "effect": "", "duration": "concentration + 1 hour/level (D)", "saving_throw": "Will negates or disbelief, see text", "spell_resistance": "yes, see text", "description": "You instantly change the appearance of the targets and then maintain that appearance for the spell’s duration. You can make the targets appear to be anything you wish. The targets look, feel, and smell just like what the spell makes them resemble. Affected creatures return to their normal appearances if\r\nslain. You must succeed at a Disguise check to duplicate the appearance of a specific individual. This spell gives you a +10 bonus to such a check (since it counts as altering your form).\r\n\r\nAn unwilling target can negate the spell’s effect on it by succeeding at a Will saving throw or by relying on spell resistance. Those who interact with the targets can attempt Will saving throws to disbelieve the illusion, but spell resistance doesn’t help pierce the illusion.", "brief_description": "", "requires_resolve": false}, "vision": {"title": "Vision", "level_requirements": ["Mystic 6"], "school": "divination", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "see text", "saving_throw": "", "spell_resistance": "", "description": "You pose a question about some person, place, or object while casting this spell. If the person or object is at hand or if you are in the place in question and you succeed at a caster level check (1d20 + your caster level, DC 20), you receive a vision about that person, place, or object. The information gained includes everything available about the target that could be discovered by spending weeks in dedicated research with excellent-quality but standard reference works.\r\n\r\nIf the person or object is not at hand or you are not in the place and you know only detailed information about the person, place, or object, the DC of the caster level check is 25 and the information gained is incomplete (though it often provides enough information to help you find the person, place, or thing, thus allowing a better vision result next time). If you know only rumors, the DC is 30 and the information gained is vague (though it often directs you to more detailed information, thus allowing a better vision result next time). In most circumstances, you can’t glean information about what occurred during the Gap with this spell.\r\n\r\nCasting this spell requires access to a computer or similar device, which displays the information gained. Additionally, casting this spell places considerable strain on you, requiring you to spend 1 Resolve Point.", "brief_description": "", "requires_resolve": false}, "wall of fire": {"title": "Wall of Fire", "level_requirements": ["Technomancer 4"], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "", "effect": "wall up to 20 ft. long/level or a ring with a radius up to 5 ft.", "duration": "concentration + 1 round/level", "saving_throw": "none", "spell_resistance": "yes", "description": "An immobile blazing curtain of opaque, shimmering, violet fire springs into existence. One side of the wall, selected by you, sends forth waves of heat, dealing 2d6 fire damage to creatures within 10 feet and 1d6 fire damage to those beyond 10 feet but within 20 feet. The wall deals this damage when it appears and on your turn each subsequent round. In addition, the wall deals 5d6 fire damage to any creature passing through it. The wall deals double damage to undead creatures. \r\n\r\nIf you evoke the wall so that it appears where creatures are, each creature takes damage as if passing through the wall. If any 5-foot length of wall takes 20 or more cold damage in 1 round, that length goes away.", "brief_description": "", "requires_resolve": false}, "wall of force": {"title": "Wall of Force", "level_requirements": ["Technomancer 5"], "school": "evocation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "", "effect": "wall with area up to one 10-ft. square/level", "duration": "1 round/level (D)", "saving_throw": "none", "spell_resistance": "no", "description": "Wall of force creates an invisible wall of pure force. You can form the wall into a flat, vertical plane whose area is up to one 10-foot square per level. The wall must be continuous and unbroken when formed. If its surface is broken by any object or creature, the spell fails.\r\n\r\nThis counts as a force field for effects that can’t penetrate a force field. The wall can’t move and is not easily destroyed. A wall of force is immune to dispel magic. A greater dispel magic specifically targeting the wall of force can dispel it, but treat the wall of force’s caster level as being 5 higher than the actual caster level. A wall of force can be damaged by spells and attacks as normal, but a wall of force has hardness 30 and 300 Hit Points. Disintegrate instantly destroys a wall of force.\r\n\r\nBreath weapons and spells can’t pass through a wall of force in either direction, though dimension door, teleport, and similar effects can bypass the barrier. The wall blocks ethereal creatures as well as material ones (though ethereal creatures can usually circumvent the wall by going around it, through material floors and ceilings). Gaze attacks operate normally through a wall of force.", "brief_description": "", "requires_resolve": false}, "wall of steel": {"title": "Wall of Steel", "level_requirements": ["Technomancer 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "", "effect": "steel wall with area up to one 5-ft. square/level; see text", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "no", "description": "You cause a flat, vertical steel wall to spring into existence. The stress of casting this spell requires you to spend 1 Resolve Point. The wall can fit into any space of surrounding nonliving material if its area is sufficient to do so. The wall can’t be conjured so that it occupies the same space as a creature or another object. It must always be a flat plane, though you can shape its edges to fit the available space.\r\n\r\nA wall of steel is 4 inches thick. You can double the wall’s area by halving its thickness. Each 5-foot square of the wall has hardness 15 and 45 Hit Points per inch of thickness. A section of wall that is reduced to 0 Hit Points is breached. The DC of the Strength check for a creature to break through the wall with a single attack is 30. The wall is firmly anchored to its surroundings, and it doesn’t easily tip over; it can’t be summoned into any area where it is likely to fall or collapse.\r\n\r\nLike any steel wall, this wall is subject to perforation and other natural phenomena, though it doesn’t rust or corrode under typical circumstances. The metal created by this spell is not suitable for use in the creation of other objects and can’t be sold.", "brief_description": "", "requires_resolve": false}, "waves of fatigue": {"title": "Waves of Fatigue", "level_requirements": ["Mystic 5"], "school": "necromancy", "casting_time": "1 standard action", "range": "30 ft.", "area": "cone-shaped burst", "targets": "", "effect": "", "duration": "instantaneous", "saving_throw": "none", "spell_resistance": "yes", "description": "Waves of negative energy render all living creatures in the spell’s area fatigued. This spell has no effect on a creature that is already fatigued.", "brief_description": "", "requires_resolve": false}, "wish": {"title": "Wish", "level_requirements": ["Technomancer -"], "school": "universal", "casting_time": "1 standard action", "range": "see text", "area": "see text", "targets": "see text", "effect": "see text", "duration": "see text", "saving_throw": "see text", "spell_resistance": "see text", "description": "By simply speaking aloud, you can alter reality to better suit you. Even wish, however, has its limits. A wish spell can produce any one of the following effects.\r\n\r\n* Duplicate any technomancer spell of 6th level or lower.\r\n* Duplicate any other spell of 5th level or lower.\r\n* Undo the harmful effects of certain spells, such as feeblemind.\r\n* Produce any effect whose power level is in line with the above effects.\r\n\r\nAt the GM’s discretion, you may try to use a wish to produce greater effects than these, but doing so may be dangerous or the spell may have only a partial effect.\r\n\r\nA duplicated spell allows saving throws and spell resistance as normal, but the save DCs are the same as for a 7th-level spell. For the purpose of other effects that depend on spell level, wish counts as a 9th-level spell.", "brief_description": "", "requires_resolve": false}, "wisp ally": {"title": "Wisp Ally", "level_requirements": ["Mystic 1"], "school": "conjuration", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "", "effect": "one distracting, glowing servant", "duration": "1 round/level", "saving_throw": "none", "spell_resistance": "no", "description": "You draw forth otherworldly energy to create a small, spherical, floating wisp that can distract your enemies in combat. This wisp can move 60 feet per round in any direction, and you can direct it as a move action on your turn. If the wisp occupies the same space as an enemy, the wisp provides your choice of either harrying fire or covering fire (see pages 246–247) against the enemy each round on your turn, and it follows that enemy within range automatically unless you direct it to change targets. The wisp is made of pure light and energy and can’t be damaged in combat, though it can be dispelled as normal.\r\n\r\nIn addition to the function described above, the wisp sheds light in a 20-foot radius in a color of your choice (chosen when you cast the spell).", "brief_description": "", "requires_resolve": false}, "zone of truth": {"title": "Zone of Truth", "level_requirements": ["Mystic 2"], "school": "enchantment", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "20-ft.-radius emanation", "targets": "", "effect": "", "duration": "1 minute/level", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "Creatures within the emanation area can’t speak any deliberate and intentional lies. Each potentially affected creature can attempt a Will saving throw to avoid the effect when the spell is cast or when that creature first enters the emanation area. Affected creatures are aware of this enchantment, and they can therefore avoid answering questions to which they would normally respond with a lie, or they can be evasive as long as they remain within the boundaries of the truth. Creatures who leave the area are free to speak as they choose.", "brief_description": "", "requires_resolve": false}, "spider climb": {"title": "Spider Climb", "level_requirements": ["Mystic 2", "Technomancer 2"], "school": "transmutation", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature", "effect": "", "duration": "10 minutes/level", "saving_throw": "Will negates (harmless)", "spell_resistance": "yes (harmless)", "description": "The target can climb and travel on vertical surfaces or even traverse ceilings as well as a spider does. An affected creature with four limbs must have three limbs free (not holding equipment or being used to perform skills and so on) to climb in this manner. A creature with six limbs needs only four available. In general, other creatures must have 75% of their limbs available to benefit from this spell. The target gains a climb speed of 20 feet (and the +8 racial bonus to Athletics checks to climb granted by that climb speed); furthermore, it doesn’t need to attempt Athletics checks to climb to traverse a vertical or horizontal surface (even upside down). An affected creature climbing in this way is not flat-footed while climbing, and opponents get no special bonus to their attacks against it. The creature, however, can’t use the run action while climbing.", "brief_description": "", "requires_resolve": false}, "destruction protocol": {"title": "Destruction Protocol", "level_requirements": ["Technomancer 4"], "school": "enchantment", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one nonhostile construct of the technological subtype; see text", "effect": "", "duration": "concentration, up to 1 round/level", "saving_throw": "none", "spell_resistance": "yes", "description": "Waves of inciting programming ebb from your touch, reprogramming a construct to have murderous intentions toward your enemies. This spell must target a construct that is not already programmed or tasked with harming you. The target construct must have a CR lower than or equal to your level. If the target construct is under the control of another creature, the controlling creature can attempt a Will saving throw (DC = the spell’s DC) to negate this spell’s effect.\r\n\r\nWhile this spell is in effect, the construct is under your control. On your turn starting when you cast this spell, you must direct it to attack a target; the construct then pursues and attacks this target as best it can. You can change which target the construct attacks as part of your concentration to continue this spell’s duration (a standard action). When you stop concentrating or when the spell’s duration otherwise ends, the construct immediately stops following your commands to attack.", "brief_description": "", "requires_resolve": false}, "ethereal jaunt": {"title": "Ethereal Jaunt", "level_requirements": ["Mystic 6", "Technomancer 6"], "school": "transmutation", "casting_time": "1 standard action", "range": "personal", "area": "", "targets": "", "effect": "", "duration": "1 round/level (D)", "saving_throw": "", "spell_resistance": "", "description": "You become ethereal, along with your equipment. For the duration of the spell, you are on the Ethereal Plane, which overlaps the Material Plane. When the spell expires, you return to material existence.\r\n\r\nAn ethereal creature is invisible, insubstantial, and capable of moving in any direction, even up or down, albeit at half normal speed. As an insubstantial creature, you can move through solid objects, including living creatures. An ethereal creature can see and hear events and creatures on the Material Plane, but everything looks gray and ephemeral. Sight and hearing on the Material Plane are limited to 60 feet and many kinds of senses (such as blindsense and blindsight) don’t work across the planar boundary.\r\n\r\nForce effects and abjurations affect an ethereal creature normally, but force effects originating on the Ethereal Plane don’t affect targets on the Material Plane. An ethereal creature can’t attack material creatures, and spells you cast while ethereal affect only other ethereal things. Certain material creatures and objects have attacks or effects that work on the Ethereal Plane. Treat other ethereal creatures and ethereal objects as you would if you were both on the Material Plane.\r\n\r\nIf you end the spell and become material while inside a material object (such as a solid wall), you are shunted to the nearest open space and take 1d6 damage per 5 feet that you so travel.", "brief_description": "", "requires_resolve": false}, "caustic conversion": {"title": "Caustic Conversion", "level_requirements": [], "school": "evocation", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature or object", "effect": "", "duration": "1 round + 1 round/3 levels", "saving_throw": "none", "spell_resistance": "yes", "description": "You fling magical nanites that convert water vapor around your target into deadly acid. Make a ranged attack roll against your target’s EAC. If you hit, the target takes 4d4 acid damage and it takes 5 additional acid damage at the end of its turn each round for the spell’s duration.", "brief_description": "Fling magical nanites as a ranged attack that deals 4d4 acid damage to one target, plus 5 additional damage in subsequent rounds.", "requires_resolve": false}, "discharge, greater": {"title": "Discharge, Greater", "level_requirements": ["Technomancer 6"], "school": "abjuration", "casting_time": "1 standard action", "range": "medium (100 ft. + 10 ft./level)", "area": "", "targets": "one creature or technological object, or a 20-ft.-radius burst", "effect": "", "duration": "instantaneous", "saving_throw": "Fortitude negates (object)", "spell_resistance": "no", "description": "This spell functions as discharge, except it can discharge multiple technological objects. You can use it in one of two ways: an area discharge or a targeted discharge.\r\n\r\n* **Area Discharge:** When used in this way, the spell affects everything within a 20-foot-radius burst. Each creature in the area is affected as though by discharge (affecting only one object in the creature’s possession), and each unattended object is similarly affected.\r\n\r\n* **Targeted Discharge:** If this spell targets a single creature, it can discharge one randomly determined object from the target’s charged or electrically powered possessions for every 4 caster levels you have.", "brief_description": "", "requires_resolve": false}, "ghost sound": {"title": "Ghost Sound", "level_requirements": ["Mystic 0", "Technomancer 0"], "school": "illusion", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "", "effect": "illusory sounds", "duration": "1 round/level (D)", "saving_throw": "Will disbelief", "spell_resistance": "no", "description": "You create a volume of sound that rises, falls, recedes, approaches, or remains fixed. You choose what type of sound this spell creates when casting it and cannot thereafter change the sound’s basic character.\r\n\r\nThe volume of sound created can produce as much noise as 20 normal humans. Thus, you can create shouting, singing, talking, marching, running, or walking sounds, as well as sounds of battle or small explosions. You can make noises that sound like machines, the general chatter of distant conversation, or the roar of an alien predator, but you can’t make specific sounds such as intelligible speech or the exact hum of a particular starship’s engines.", "brief_description": "", "requires_resolve": false}, "interplanetary teleport": {"title": "Interplanetary Teleport", "level_requirements": ["Technomancer 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "solar system or plane; see text", "area": "", "targets": "you and touched objects or touched willing or unconscious creatures", "effect": "", "duration": "instantaneous", "saving_throw": "none, Will negates (object)", "spell_resistance": "no, yes (object)", "description": "This spell functions as teleport, except there is no hard range limit and you don’t need to have seen your destination. You can teleport to anywhere you are familiar with on the planet you are on while casting the spell, or you can teleport to any other planet in the same solar system. You must have an unambiguous idea of which world you wish to travel to (“the third planet from the sun” is an acceptable destination, but “a habitable world with oceans” is not). If you have a specific location on a planet in mind, you arrive there without a chance of failure; otherwise, you arrive at a location that would not immediately be life threatening. If no such safe landing zone exists on the world, such as someone attempting to travel into the sun without the proper precautions in place, the spell simply fails.\r\n\r\nYou can also attempt to teleport to planets in different solar systems that you have visited before. This increases the casting time to 1 hour and costs a number of Resolve Points equal to the number of days it would take to reach the planet through Drift travel (assume a base engine with a Drift rating of 1; the GM rolls this randomly, after you begin casting the spell). If you don’t have enough Resolve Points, you spend all the Resolve Points you have available and the spell fails.", "brief_description": "", "requires_resolve": false}, "modify memory": {"title": "Modify Memory", "level_requirements": ["Mystic 5"], "school": "enchantment", "casting_time": "1 round; see text", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one living creature", "effect": "", "duration": "permanent", "saving_throw": "Will negates", "spell_resistance": "yes", "description": "You reach into the target’s mind and modify up to 5 minutes of its memories in one of the following ways.\r\n\r\n* Eliminate all memory of an event the target actually experienced. This spell cannot negate _charm person_, _suggestion_uk, or similar spells.\r\n* Allow the target to recall with perfect clarity an event it actually experienced.\r\n* Change the details of an event the target actually experienced.\r\n* Implant a memory of an event the target never experienced.\r\n\r\nCasting the spell takes 1 round. If the target fails its saving throw, you proceed with the spell by spending as much as 5 minutes (a period of time equal to the amount of memory you want to modify) visualizing the memory you wish to modify in the target. If your concentration is disturbed before the visualization is complete, or if the target moves beyond the spell’s range at any point during this time, the spell fails.\r\n\r\nA modified memory does not necessarily affect the target’s actions, particularly if it contradicts the creature’s natural inclinations. An illogical modified memory is usually dismissed as a bad dream, a hallucination, or another similar excuse.", "brief_description": "", "requires_resolve": false}, "mystic cure": {"title": "Mystic Cure", "level_requirements": ["Mystic 1", "Mystic 2", "Mystic 3", "Mystic 4", "Mystic 5", "Mystic 6"], "school": "conjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one living creature", "effect": "", "duration": "instantaneous", "saving_throw": "Will half (harmless)", "spell_resistance": "yes (harmless)", "description": "With a touch, you heal and invigorate your target, restoring a number of Hit Points. If the target regains all of its Hit Points as a result of this healing, you can apply the remaining healing to yourself, as long as you are a living creature. On the other hand, if this isn’t enough to restore all the target’s Hit Points, you can transfer any number of your own Hit Points to the target, healing the target that amount. You can’t transfer more Hit Points than you have or more Hit Points than the target is missing.\r\n\r\nMystic cure restores a number of Hit Points to your target depending on the spell’s level.\r\n\r\n**1st:** 1d8 + your Wisdom modifier\r\n**2nd:** 3d8 + your Wisdom modifier\r\n**3rd:** 5d8 + your Wisdom modifier\r\n**4th:** 7d8 + your Wisdom modifier\r\n**5th:** 9d8 + your Wisdom modifier\r\n**6th:** 11d8 + your Wisdom modifier\r\n\r\nIn addition, unlike most healing, when you cast mystic cure as a spell of 4th-level or higher, you have two options to enhance its effects. The first option is to restore an extra 5d8 Hit Points with a 4th-level mystic cure spell, an extra 7d8 Hit Points with a 5th-level mystic cure spell, or an extra 9d8 Hit Points with a 6th-level mystic cure spell. The second option is to bring a target that died within 2 rounds back to life. In addition to healing such a creature, the spell returns the target to life, and the target takes a temporary negative level for 24 hours. This spell can’t resuscitate creatures slain by death effects, creatures turned into undead, or creatures whose bodies were destroyed, significantly mutilated, disintegrated, and so on.\r\n\r\nCasting this spell doesn’t provoke attacks of opportunity.", "brief_description": "", "requires_resolve": false}, "psychokinetic strangulation": {"title": "Psychokinetic Strangulation", "level_requirements": ["Mystic 3"], "school": "transmutation", "casting_time": "1 standard action", "range": "close (25 ft. + 5 ft./2 levels)", "area": "", "targets": "one creature that breathes", "effect": "", "duration": "concentration up to 1 round/level", "saving_throw": "Fortitude partial, see text", "spell_resistance": "yes", "description": "You manipulate the mystical energy around a creature’s throat into a viselike grip, potentially choking the life out of your victim.\r\n\r\nEach round you concentrate on this spell, it deals 3d8 bludgeoning damage and immobilizes the target. A creature immobilized in this way cannot move and must hold its breath (see page 404). The creature can still attack with any of its weapons (except any bite attacks), cast spells, and so on. Each round the spell affects the target, the target can attempt a Fortitude saving throw to halve the damage and avoid being immobilized.", "brief_description": "", "requires_resolve": false}, "resistant armor, greater": {"title": "Resistant Armor, Greater", "level_requirements": ["Mystic 6", "Technomancer 6"], "school": "abjuration", "casting_time": "1 standard action", "range": "touch", "area": "", "targets": "one creature wearing armor", "effect": "", "duration": "10 minutes/level", "saving_throw": "Fortitude negates (harmless)", "spell_resistance": "yes (harmless)", "description": "This spell functions as lesser resistant armor, but the target and her gear gain DR 15/— or energy resistance 15 that protects against four energy types.", "brief_description": "", "requires_resolve": false}, "synaptic pulse, greater": {"title": "Synaptic Pulse, Greater", "level_requirements": ["Mystic 5"], "school": "enchantment", "casting_time": "1 standard action", "range": "20 ft.", "area": "20-ft.-radius spread centered on you", "targets": "", "effect": "", "duration": "1d4 rounds", "saving_throw": "Will partial", "spell_resistance": "yes", "description": "You stun all creatures in range for 1d4 rounds. With a successful Will saving throw, a creature is instead sickened for 1 round.", "brief_description": "", "requires_resolve": false}, "polymorph": {"title": "Polymorph", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "transmutation (polymorph)", "casting_time": "1 round", "range": "close", "area": null, "targets": "one willing creature", "effect": null, "duration": "1 minute/level (D)", "saving_throw": "none", "spell_resistance": "yes (harmless)", "description": "You change a willing target’s shape into a predetermined polymorphed form of your choice. When you select this spell as a spell known, you design four polymorphed forms for each spell level at which you can cast this spell. These forms should be premade, following the rules for spells with the polymorph descriptor (starting on page 141) and the restrictions for each spell level of this spell, and be as ready to use in play as all other aspects of a character are. Each time you gain a character level, you can change which forms you have available.\r\n\r\nYou choose which of these predetermined polymorph forms the target changes into each time you cast the spell.\r\n\r\n**1st:** Casting polymorph as a 1st-level spell allows you to transform the target into one of the four 1st-level polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Unlike most polymorph effects, these forms are close enough to the target’s true form to make the target recognizable, and they cannot duplicate any other specific individual. Each form must be of the animal or humanoid type. You can target only creatures that are Small or Medium with this spell, and all your polymorphed forms must be Small or Medium.\r\n \r\n*CR:* The maximum CR is 1. \r\n\r\n*Defenses:* The form can grant DR 1/magic or resistance 2 to one energy type. \r\n\r\n*Movement:* The form can grant a land speed of up to 30 feet or a swim speed of up to 20 feet. \r\n\r\n*Racial Traits:* You cannot grant racial traits. \r\n\r\n*Senses:* The form can grant low-light vision or tracking (scent), but not both. \r\n\r\n**2nd:** Casting polymorph as a 2nd-level spell allows you to completely transform the target into one of the four 2ndlevel polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Each form must be an animal, fey, humanoid, magical beast, or monstrous humanoid. All your polymorphed forms must be Small or Medium.\r\n\r\n*CR:* The maximum CR is 3.\r\n\r\n*Defensive Abilities:* The form can grant DR 2/magic or resistance 5 to one energy type.\r\n\r\n*Racial Traits:* The form can grant only one racial trait to each polymorphed form, and you can’t grant racial traits that include spell-like abilities.\r\n\r\n*Senses:* The form can grant one of the following options: blindsense (scent) out to 5 feet, darkvision out to 60 feet, lowlight vision, or tracking (scent).\r\n\r\n*Speed:* The form can grant the target a maximum land speed of 40 feet, climb speed of 20 feet, or swim speed of 30 feet. \r\n\r\n**3rd:** Casting polymorph as a 3rd-level spell allows you to completely transform the target into one of the four 3rd-level polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Each form must be an aberration, animal, fey, humanoid, magical beast, monstrous humanoid, or vermin. See the vermin benefits in the Type and Subtype section of the polymorph rules. All your polymorphed forms must be Small or Medium.\r\n\r\n*CR:* The maximum CR is 6.\r\n\r\n*Defensive Abilities:* The form can grant DR 3/magic, resistance 5 to two different energy types, or resistance 10 to one energy type.\r\n\r\n*Racial Traits:* The form can grant up to two racial traits (which must be from the same race) to each polymorphed form, one of which can include spell-like abilities.\r\n\r\n*Senses:* The form can grant one of the following options: blindsense (scent, sound, or vibration) out to 15 feet, darkvision out to 60 feet, low-light vision, or tracking (scent).\r\n\r\n*Speed:* The form can grant the target a maximum land speed of 40 feet, a burrow speed of up to 20 feet, a climb speed of 20 feet, a fly speed of 20 feet (Ex) with clumsy maneuverability, or a swim speed of 30 feet. \r\n\r\n**4th:** Casting polymorph as a 4th-level spell allows you to completely transform the target into one of the four 4th-level polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Each form must be an aberration, animal, fey, humanoid, magical beast, monstrous humanoid, or vermin. See the vermin benefits in the Type and Subtype section of the polymorph rules. All your polymorphed forms must be Small, Medium, or Large.\r\n\r\n*CR:* The maximum CR is 9.\r\n\r\n*Defensive Abilities:* The form can grant DR 5/magic, resistance 5 to three different energy types, resistance 10 to two different energy types, or resistance 15 to one energy type.\r\n\r\n*Racial Traits:* The form can grant up to two racial traits to each polymorphed form; one can include spell-like abilities.\r\n\r\n*Senses:* The form can grant one of the following options: blindsense (scent, sound, or vibration) out to 30 feet, blindsight (scent, sound, or vibration) out to 5 feet, darkvision out to 60 feet and low-light vision, or tracking (scent).\r\n\r\n*Speed:* The form can grant the target a maximum land speed of 40 feet, a burrow speed of up to 30 feet, a climb speed of 30 feet, a fly speed of 30 feet (Ex) with clumsy maneuverability, or a swim speed of 40 feet. \r\n\r\n**5th:** Casting polymorph as a 5th-level spell allows you to completely transform the target into one of the four 5th-level polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Each form must be an aberration, animal, construct (only if cast as a technomancer spell), elemental, fey, humanoid, magical beast, monstrous humanoid, plant (only if cast as a mystic spell), or vermin. See the construct, elemental, plant, and vermin benefits in the Type and Subtype section of the polymorph rules. All your polymorphed forms must be Tiny, Small, Medium, or Large.\r\n\r\n*CR:* The maximum CR is 12.\r\n\r\n*Defensive Abilities:* The form can grant DR 5/—, resistance 10 to three different energy types, resistance 15 to two different energy types, or resistance 20 to one energy type.\r\n\r\n*Racial Traits:* The form can grant up to three racial traits to each polymorphed form; one can include spell-like abilities.\r\n\r\n*Senses:* The form can grant one of the following options: blindsense (scent, sound, or vibration) out to 30 feet, blindsight (scent, sound, or vibration) out to 15 feet, darkvision out to 90 feet and low-light vision, or tracking (scent).\r\n\r\n*Speed:* The form can grant the target a maximum land speed of 40 feet, a burrow speed of up to 40 feet, a climb speed of 40 feet, a fly speed of 40 feet (Ex) with average maneuverability, or a swim speed of 40 feet. \r\n\r\n**6th:** Casting polymorph as a 6th-level spell allows you to completely transform the target into one of the four 6th-level polymorphed forms you know. Your polymorphed forms must comply with the additional restrictions that follow. Each form must be an aberration, animal, construct (only if cast as a technomancer spell), elemental, fey, humanoid, magical beast, monstrous humanoid, plant (only if cast as a mystic spell), undead, or vermin. See the construct, elemental, plant, undead, and vermin benefits in the Type and Subtype section of the polymorph rules. All your polymorphed forms must be Diminutive, Tiny, Small, Medium, Large, or Huge.\r\n\r\n*CR:* The maximum CR is 15.\r\n\r\n*Defensive Abilities:* The form can grant DR 5/—, resistance 10 to three different energy types, resistance 15 to two different energy types, resistance 20 to one energy type, or immunity to disease, poison, or radiation.\r\n\r\n*Racial Traits:* The form can grant up to four racial traits to each polymorphed form; one can include spell-like abilities.\r\n\r\n*Senses:* The form can grant one of the following options: blindsense (scent, sound, or vibration) out to 30 feet, blindsight (scent, sound, or vibration) out to 15 feet, darkvision out to 90 feet and low-light vision, or tracking (scent).\r\n\r\n*Speed:* The form can grant the target a maximum land speed of 60 feet, a burrow speed of up to 60 feet, a climb speed of 60 feet, a fly speed of 60 feet (Ex) with perfect maneuverability, or a swim speed of 60 feet.", "brief_description": "Change the target's shape into that of another creature", "requires_resolve": false}, "polymorph, mass": {"title": "Polymorph, Mass", "level_requirements": ["Technomancer 4", "Mystic 4"], "school": "transmutation (polymorph)", "casting_time": "1 round", "range": "close", "area": null, "targets": "up to four willing creatures, no two of which can be more than 30 ft. apart", "effect": null, "duration": "1 minute/level (D)", "saving_throw": "none", "spell_resistance": "yes (harmless)", "description": "This spell functions as polymorph, except as noted in this description. Each target must take the same form. \r\n\r\n**4th:** This spell can transform the targets as per the 1st-level version of polymorph. \r\n\r\n**5th:** This spell can transform the targets as per the 2nd-level version of polymorph. \r\n\r\n**6th:** This spell can transform the targets as per the 3rd-level version of polymorph.", "brief_description": "Change multiple target's shapes to that of another creature", "requires_resolve": false}, "summon creature": {"title": "Summon Creature", "level_requirements": ["Mystic 1", "Technomancer 1"], "school": "conjuration (Summoning)", "casting_time": "1 round", "range": "medium", "area": null, "targets": null, "effect": "one or more summoned creatures", "duration": "1 round/level", "saving_throw": "none", "spell_resistance": "no", "description": "This spell summons an extraplanar creature (typically an elemental, magical beast native to another plane, or outsider, but also occasionally even extraplanar constructs). The summoned creature appears where you designate and acts immediately on your turn. It attacks your opponents to the best of its ability. If you can communicate with the creature, you can direct it to not attack, to attack particular enemies, or to perform other actions.\r\n\r\nWhen you gain this spell as a spell known, select four creatures from the appropriate list in Table 8: Summon Creature for each level at which you can cast this spell. For example, for the 1st-level summon creature spell, you could choose Tiny air, earth, fire, and water elementals. Note that a particular alignment or class is sometimes required to choose certain creatures, as listed in Table 8. In place of a single selection, you can choose a creature from a lower-level summoning list; doing so allows you the option of summoning multiple such creatures at a time. Each time you gain a character level, you can change these selections.\r\n\r\nYou can gain summon creature a second time at the highest spell level you know, selecting four additional appropriate creatures at each level you can cast this spell.\r\n\r\nYou choose which of the selected creatures you summon each time you cast the spell.\r\n\r\n**1st:** When you cast summon creature as a 1st-level spell, you summon one creature from your selection of creatures from the 1st-level summoning list.\r\n\r\n**2nd:** When you cast summon creature as a 2nd-level spell, you summon one creature from your selection of creatures from the 2nd-level summoning list. If the chosen creature is from a lower-level summoning list, you summon three such creatures instead.\r\n\r\n**3rd:** When you cast summon creature as a 3rd-level spell, you summon one creature from your selection of creatures from the 3rd-level summoning list. If the chosen creature is from a lower-level summoning list, you summon three such creatures instead.\r\n\r\n**4th:** When you cast summon creature as a 4th-level spell, you summon one creature from your selection of creatures from the 4th-level summoning list. If the chosen creature is from a lower-level summoning list, you summon three such creatures instead.\r\n\r\n**5th:** When you cast summon creature as a 5th-level spell, you summon one creature from your selection of creatures from the 5th-level summoning list. If the chosen creature is from a lower-level summoning list, you summon three such creatures instead.\r\n\r\n**6th:** When you cast summon creature as a 6th-level spell, you summon one creature from your selection of creatures from the 6th-level summoning list. If the chosen creature is from a lower-level summoning list, you summon three such creatures instead.\r\n\r\nA summoned creature can’t use teleportation or planar travel abilities or magical divination abilities. Creatures can’t be summoned into an environment that can’t support them (such as summoning a breathing creature into a vacuum). Creatures summoned using this spell can’t use spells or spell-like abilities that duplicate spells that require expending Resolve Points or expensive materials to cast (such as raise dead).\r\n\r\nTo generate statistics for a summoned creature, first check the Stat Block column of the below tables. If the stat block is \"Alien\", use the creature’s stat block on that link, though it is altered slightly depending on your alignment. Otherwise, if the entry is Tiny, Small, Medium, Large, Huge, or elder, use the elemental stat block of the same name and apply the appropriate graft, listed in the Applied Graft column. Non-elemental creatures lose elemental immunities and do not gain an elemental graft. For example, to get the statistics of an angel from the 1st-level list, you use the tiny elemental stat block and apply the angel summoning graft.\r\n\r\n1st Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Tiny | Summoning | Neutral-aligned\r\nAgathion | Tiny | Summoning | Nonevil\r\nAngel | Tiny | Summoning | Nonevil\r\nArchon  | Tiny | Summoning | Nonchaotic and nonevil\r\nAzata  | Tiny  | Summoning | Nonevil and nonlawful\r\nDaemon  | Tiny | Summoning | Nongood\r\nDemon | Tiny | Summoning | Nongood and nonlawful\r\nDevil | Tiny | Summoning | Nonchaotic and nongood\r\nElemental, Air | Tiny | Elemental | None\r\nElemental, Earth | Tiny | Elemental | None\r\nElemental, Fire | Tiny | Elemental | None\r\nElemental, Water | Tiny | Elemental | None\r\nFirst World Beast | Tiny | Summoning | Mystic\r\nInevitable | Tiny | Summoning | Nonchaotic\r\nProtean | Tiny | Summoning | Nonlawful\r\nRobot | Tiny | Summoning | Technomancer\r\nShadow Creature | Tiny | Summoning | None\r\nSkittermander Whelp | Alien | Simple | None\r\n\r\n2nd Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Small | Summoning | Neutral-aligned\r\nAgathion | Small | Summoning | Nonevil\r\nAngel | Small | Summoning | Nonevil\r\nArchon | Small | Summoning | Nonchaotic and nonevil\r\nAzata | Small | Summoning | Nonevil and nonlawful\r\nDaemon | Small | Summoning | Nongood\r\nDemon | Small | Summoning | Nongood and nonlawful\r\nDevil | Small | Summoning | Nonchaotic and nongood\r\nElemental, Air | Small | Elemental | None\r\nElemental, Earth | Small | Elemental | None\r\nElemental, Fire | Small | Elemental | None\r\nElemental, Water | Small | Elemental | None\r\nFirst World Beast | Small | Summoning | Mystic\r\nInevitable | Small | Summoning | Nonchaotic\r\nProtean | Small | Summoning | Nonlawful\r\nRobot | Small | Summoning | Technomancer\r\nSecurity Robot, Observer-Class | Alien | Simple | Technomancer\r\nShadow Creature | Small | Summoning | None\r\n\r\n3rd Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Medium | Summoning | Neutral-aligned\r\nAgathion | Medium | Summoning | Nonevil\r\nAngel | Medium | Summoning | Nonevil\r\nArchon | Medium | Summoning | Nonchaotic and nonevil\r\nAzata | Medium | Summoning | Nonevil and nonlawful\r\nCrest-Eater | Alien | Simple | None\r\nDaemon | Medium | Summoning | Nongood\r\nDemon | Medium | Summoning | Nongood and nonlawful\r\nDevil | Medium | Summoning | Nonchaotic and nongood\r\nElemental, Air | Medium | Elemental | None\r\nElemental, Earth | Medium | Elemental | None\r\nElemental, Fire | Medium | Elemental | None\r\nElemental, Water | Medium | Elemental | None\r\nFirst World Beast | Medium | Summoning | Mystic\r\nHaan | Alien | Simple | None \r\nInevitable | Medium | Summoning | Nonchaotic\r\nKsarik | Alien | Simple | None\r\nProtean | Medium | Summoning | Nonlawful\r\nRobot | Medium | Summoning | Technomancer\r\nShadow Creature |  Medium | Summoning | None\r\n\r\n4th Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Large | Summoning | Neutral-aligned\r\nAgathion | Large | Summoning | Nonevil\r\nAngel | Large | Summoning | Nonevil\r\nArchon | Large | Summoning | Nonchaotic and nonevil\r\nAzata | Large | Summoning | Nonevil and nonlawful\r\nDaemon | Large | Summoning | Nongood\r\nDemon | Large | Summoning | Nongood and nonlawful\r\nDevil | Large | Summoning | Nonchaotic and nongood\r\nElemental, Air | Large | Elemental | None\r\nElemental, Earth | Large | Elemental | None\r\nElemental, Fire | Large | Elemental | None\r\nElemental, Water | Large | Elemental | None\r\nFirst World Beast | Large | Summoning | Mystic\r\nInevitable | Large | Summoning | Nonchaotic\r\nMountain Eel | Alien | Simple | None\r\nOrocoran | Alien | Simple | None\r\nProtean | Large | Summoning | Nonlawful\r\nRobot | Large | Summoning | Technomancer\r\nShadow Creature | Large | Summoning | None\r\n\r\n5th Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Huge | Summoning | Neutral-aligned\r\nAgathion | Huge | Summoning | Nonevil\r\nAngel | Huge | Summoning | Nonevil\r\nArchon | Huge | Summoning | Nonchaotic and nonevil\r\nAzata | Huge | Summoning | Nonevil and nonlawful\r\nDaemon | Huge | Summoning | Nongood\r\nDemon | Huge | Summoning | Nongood and nonlawful\r\nDevil | Huge | Summoning | Nonchaotic and nongood\r\nElemental, Air | Huge | Elemental | None\r\nElemental, Earth | Huge | Elemental | None\r\nElemental, Fire | Huge | Elemental | None\r\nElemental, Water | Huge | Elemental | None\r\nFirst World Beast | Huge | Summoning | Mystic\r\nInevitable | Huge | Summoning | Nonchaotic\r\nProtean | Huge | Summoning | Nonlawful\r\nRobot | Huge | Summoning | Technomancer\r\nShadow Creature | Huge | Summoning | None\r\nSurnoch | Alien | Simple | None | \r\n\r\n6th Level |&nbsp; Stat Block &nbsp;|&nbsp; Applied Graft &nbsp;|&nbsp; Summoner Requirements&nbsp;\r\n:---:|:---:|:---:|:---:\r\nAeon | Elder | Summoning | Neutral-aligned\r\nAgathion | Elder | Summoning | Nonevil\r\nAngel | Elder | Summoning | Nonevil\r\nArchon | Elder | Summoning | Nonchaotic and nonevil\r\nAzata | Elder | Summoning | Nonevil and nonlawful\r\nDaemon | Elder | Summoning | Nongood\r\nDemon | Elder | Summoning | Nongood and nonlawful\r\nDevil | Elder | Summoning | Nonchaotic and nongood\r\nElemental, Air | Elder | Elemental | None\r\nElemental, Earth | Elder | Elemental | None\r\nElemental, Fire | Elder | Elemental | None\r\nElemental, Water | Elder | Elemental | None\r\nFirst World Beast | Elder | Summoning | ystic\r\nInevitable | Elder | Summoning | Nonchaotic\r\nProtean | Elder | Summoning | Nonlawful\r\nRobot | Elder | Summoning | Technomancer\r\nShadow Creature | Elder | Summoning | None", "brief_description": "This spell summons an extraplanar creature.", "requires_resolve": false}}